[{"name":"Pac-Attack","year":1993,"developer":"Namco Limited","url":"5#P/Pac-Attack%20%28NA%29.sfc","filesize":524288,"score":7.1,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle","desc":"<p>Based on Namco's Japanese-only arcade puzzler Cosmo Gang the Puzzle, <em>Pac-Attack</em> is similar to many block-dropping puzzle games from the time, such as Puyo Puyo.</p><p>The objective of the game is to place ghosts and then, after three pieces (which can include one or two blocks as well), make Pac-Man eat as many ghosts as possible to try and clear up the game area. Pac-Man's directions are chosen at random between left or right, but as he goes moving on the game area (after you place him, of course), if he bumps against a block or a \"wall\" on the game area, he will change his direction. As with many block-dropping puzzlers, if a line of blocks and/or ghosts reaches the top, the game ends. However, by filling up a meter on the left of the game area, a fairy may appear that can clear approximately 6 or 7 lines with ghosts, but it only clears the ghosts, although the blocks that were on top of them will drop.</p><p>Also, like many puzzlers, it contains a versus mode against another human player. It's similar to the many versus modes of puzzle games: eat plenty of ghosts and your opponent will recieve many ghosts on his area.</p><p>The game also includes a Puzzle mode. It features 100 levels, in which you have to eat all ghosts with no more than 4 Pac-Men at least (the number reduces in certain levels), and, unlike the other modes, you can change Pac-Man's direction with the press of a button.</p><p>All of the handheld versions (including the one on Pac-Man Collection) lack the versus mode.</p>"},{"name":"Pac-in-Time","year":1995,"developer":"Atreid Concept SA","url":"5#P/Pac-in-Time%20%28NA%29.sfc","filesize":1048576,"score":7.3,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Fantasy","desc":"<p>Pac-Man gets thrown back in time to his younger days after the nefarious Ghost Witch casted a spell on him for spoiling her plans. Now he has to find his way back to the present time. </p><p>Pac-Man has to go through several areas broken into ten sections each. To exit a section all of the pellets need to be collected in order for the exit to the section to appear. Pac-Man can jump and use tools. Tools include things such as hammers, fireballs, a bubble for underwater survival, and a climbing vine.</p><p>This version of <em>Pac-in-Time</em> should not be confused with other versions of Pac-in-Time as the game engine, level layouts, and aesthetic are different.</p>"},{"name":"Pac-Man 2: The New Adventures","year":1994,"developer":"Namco Limited","url":"5#P/Pac-Man%202%20-%20The%20New%20Adventures%20%28NA%29.sfc","filesize":1572864,"score":6.3,"genres":"Action > Adventure > Side view > 2D scrolling > Puzzle elements > Point and select > Fantasy","desc":"<p>Join Pac-Man in a side scrolling adventure where you must guide him through Pac-Land, solving puzzles and finding objects in order to defeat the evil Ghost Witch of Nentor. You don't control Pac-Man himself, as you must show him where to go and what to look for, while using the slingshot to knock over and find items or open doors and defeat bad guys before Pac-Man bumps into them. You can collect items you find along the paths from Pac-Man's house in the inventory and use them for a later day.</p>"},{"name":"Pacific Theater of Operations","year":1992,"developer":"KOEI Co., Ltd.","url":"7#P.T.O.%20%28Pacific%20Theater%20of%20Operations%29%20%28USA%29.sfc","filesize":1310720,"score":7.5,"genres":"Educational > Strategy > Managerial / business simulation > Geography > History > Naval / watercraft > Historical events > World War II","desc":"<p><em>P.T.O.</em> is another military sim from KOEI. In this game you can choose to be either Japan or the Allies. By managing your fleets and ordering new warships you can control many different sides of the conflict (Ship development, Base defense, Fleet arrangement, Direct battle control, Economic decisions). There are many different options of play in PTO, you can choose to play from one of many different famous battles or you can play the campaign. You can control one side or both. There are also limited controls on victory conditions.</p>"},{"name":"Pacific Theater of Operations II","year":1995,"developer":"KOEI Co., Ltd.","url":"7#P.T.O.%20II%20%28Pacific%20Theater%20of%20Operations%29%20%28USA%29.sfc","filesize":3145728,"score":7.1,"genres":"Simulation > Strategy > Top-down > Naval / watercraft > Historical events > World War II","desc":"<p>PTO II is a KOEI game that depicts the conflict between the USA and Japan during World War II. The player takes control of the Navy forces of both nation, and tries to outsmart each other.</p>"},{"name":"Packy & Marlon","year":1995,"developer":"WaveQuest Inc."},{"name":"Pagemaster, The","year":1994,"developer":"Probe Entertainment Ltd.","url":"5#T/The%20Pagemaster%20%28NA%29.sfc","filesize":2097152,"score":6.9,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p><em>The Pagemaster</em> was released in conjunction with the Macaulay Culkin part action/part cartoon feature film released in 1994. Guide your character through a selection of levels based around themed books, ranging from Horror to Adventure and Fantasy worlds. You can use magic and stomp enemies to death by jumping on their head. Enemies include bats, flying books, giant hands, ghosts, pirates and many more.</p>"},{"name":"Paladin's Quest","year":1992,"developer":"Copya System Ltd.","url":"5#P/Paladin%27s%20Quest%20%28NA%29.sfc","filesize":1572864,"score":6.8,"genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>The world of Lennus is a world of legends and wonders and is divided into two continents; Naskuot, the northern continent and Saskuot, the southern continent. Thirteen years ago a strange disaster befell this world and killed many people. Upon the ruins of a great city and sealing back a great evil, a school of magic was built. Young Chezni is a student of that school of magic, striving to become a great spiritualist and control the elements. Meanwhile, a dictator to the south, Zaygos has conquered the entire continent and seeks to conquer the other half of the world. One day, after class Chezni is dared by a fellow classmate to enter and explore the forbidden tower that sits outside the school of magic. Entering the tower, Chezni will soon learn of the machine, Dal Gren that has been sleeping there for 10,000 years. What consequences will his actions have?</p><p>Paladin's Quest is a 1-player RPG where the player moves around the world and in locations using an overhead view with up to four members in the party. Randomly encountered monsters engage in a first-person view battle mode that is played using turn-based commands to each player. Along with weapons, magic is available and uses the character's own hitpoints to command. There is no healing magic and no healing items, rather some characters have \"bottles\", one type of which can restore HP and these can be filled (nine uses per bottle) at most towns. Each character has a different profieciency in one of eight different elements, which may be combined to produce additional spells. New element usage can sometimes be learned by main characters in temples.</p>"},{"name":"Panel de Pon","year":1995,"developer":"Intelligent Systems Co., Ltd.","url":"5#P/Panel%20de%20Pon%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":1572864,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Falling block puzzle > Tile matching puzzle","desc":"<p>Peace in the world of Popples is being threatened by the devil king Thanatos, who has cast a spell over the world. Lip, the Fairy of Flowers, escaped the grasp of this spell, and must free her friends, the other fairies, and defeat the evil king to restore peace to the land.</p><p><em>Panel de Pon</em> is a fact-paced action puzzler that belies its cute exterior with extremely fast-paced matches. A stack of blocks continually rises from the bottom of the screen, and the player controls a cursor which can swap any two blocks horizontally. Make a row or column of three or more and they'll clear, potentially creating combos from new blocks falling to take their place. Combos will send large garbage blocks to your opponent, which must be eliminated by clearing a piece that is touching it, turning it into normal blocks.</p><p>The game offers a story mode against the computer, as well as a 2-player versus mode, an endless mode, a timed mode where a certain number of blocks must be cleared, and a puzzle mode where a set arrangement of blocks must be cleared in a specific number of moves. A reworked version of the game, which changes all the characters to ones from Super Mario World 2: Yoshi's Island, was released internationally as Tetris Attack.</p>"},{"name":"Panic in Nakayoshi World","year":1994,"developer":"Tom Create Co., Ltd."},{"name":"Paperboy 2","year":1991,"developer":"Tengen Ltd."},{"name":"Parodius","year":1992,"developer":"Konami Co., Ltd.","url":"5#P/Parodius%20Da%21%20-%20Shinwa%20kara%20Owarai%20e%20%28JP%29.sfc","filesize":1048576,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Comedy > Regional differences","desc":"<p>This is mostly the parody of Gradius (Nemesis on some systems), with some flavor from other shoot-em-ups, like Twinbee. The series is available on numerous platforms.</p><p>The game is a right-to-left scrolling shoot-em-up. You can choose from 4 different flying creatures, with different weapons. You must finish 7 stages, each having a boss at the end. You may start at either one, but must complete every level to advance to the final stage.</p>"},{"name":"Peace Keepers, The","year":1993,"developer":"Jaleco Ltd.","url":"5#T/The%20Peace%20Keepers%20%28NA%29.sfc","filesize":2097152,"score":6.7,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>It's the year 2015 and the most powerful organization of the planet, a company named Deutschland Moldavia, is threatening to take over the world by genetically manipulatin humans into mindless slaves or powerful monsters.</p><p>The Peace Keepers is a side-scrolling fighting game similar to games in the Final Fight series. The player can choose from four characters (plus two that become available later in the game) with different strengths and weaknesses. In addition to combinations of standard attacks, jump-, run- and throwing attacks, all characters can also block attacks, perform single heavy attacks, special attacks that consume a certain amount of energy and super attacks. Super attacks damage all enemies on-screen, but can only be used twice per continue. If a character is hit repeatedly, there is a chance that they temporarily switch into \"angry-mode\" during which they are invincible and more powerful. </p><p>Most levels offer different paths and exits, and after every level, a different character may be selected. This means that levels may be played through in different orders and that it is not at all necessary to play through all the levels to reach one of several endings.</p>"},{"name":"Pebble Beach Golf Links","year":1992,"developer":"T&E Soft, Inc."},{"name":"Pebble Beach no Hatō: New - Tournament Edition","year":1996,"developer":"T&E Soft, Inc."},{"name":"PGA European Tour","year":1996,"developer":"Halestorm, Inc.","url":"5#P/PGA%20European%20Tour%20%28NA%29.sfc","filesize":1048576,"score":7.4,"genres":"Simulation > Sports > 3rd-person (Other) > Golf > Licensed","desc":"<p>European Tour is best thought of as a remake of the original game, rather than a sequel as such. It features 5 courses from across Europe, and 60 top European pros, rather than the US-leaned lineup of the original. The graphics are much more detailed and colorful, as you'd expect considering the intervening years of advances in programming skills.</p><p>The control system is the standard three-click method used in most golf games, but you can now define intended draw/fade levels in advance of playing the shot, so that a perfect aim leads to a measured effect, and an imperfect one exaggerating the effect.</p><p>As well as the Stroke Play games of the original (where you count the total score across the whole round of 18 holes and compare this to your opponent), there are also Match Play (where the aim is to win as many individual holes as possible) and Skins (the same, but with money) modes as well.</p>"},{"name":"PGA Tour 96","year":1996,"developer":"Polygames","url":"5#P/PGA%20Tour%20%2796%20%28NA%2C%20Rev%201%29.sfc","filesize":2097152,"score":8.2,"genres":"Simulation > Sports > Behind view > Golf > Licensed","desc":"<p>The team at Polygames make some small improvements to the series in <em>PGA Tour Golf III</em>. It has a US setting in terms of the courses and players, unlike PGA European Tour, with 8 licensed courses in total: Avenel, Las Colinas, River Highlands, Sawgrass, Scottsdale, Southwind, Summerlin and The Woodlands. Gameplay modes include three different practice options (driving range, putting green, and a full round) as well as a tournament, skins challenge, match play, and shoot-out.</p><p>Gameplay follows the standard model with swings made from of a view behind the golfer, with the customary three-click method (start, power, accuracy). Before taking a shot, the club choice, direction and intended draw/fade (spin on the ball) are selected. The game features instant replays and user-created players, stats and tournaments saved to battery-backed RAM. Only the Genesis version has course flybys with tips from PGA pros and switches to a different camera view for the ball's landing.</p>"},{"name":"PGA Tour Golf","year":1992,"developer":"Sterling Silver Software","url":"5#P/PGA%20Tour%20Golf%20%28NA%2C%20Rev%201%29.sfc","filesize":524288,"score":7.9,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p><em>PGA Tour Golf</em> introduced many of the conventions commonly seen in the genre since. The three-click control method (the first to start the swing, the second setting power and over-swing, the third setting draw or fade) allowed for a multitude of different shots, and required a sense of timing. </p><p>Four courses are included, one of them a fantasy 'links' course designed by the programmers. Some of the holes are fiendish, with bunkers, water hazards and trees, and the need to plan strategies to get the best approach to the green.</p><p>When playing a tournament there are 60 opponents, each representing top US golfers - ten of these appear in the game, with one providing tactical advice for each hole.</p>"},{"name":"Phalanx","year":1992,"developer":"Kotobuki System Co., Ltd.","url":"5#P/Phalanx%20%28NA%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p>A futuristic shooter, Phalanx is the name of the prototype starfighter flown by Wink Baufield, a genetically enhanced pilot. It is sent to protect and reclaim Delia IV, a planet in the Andromeda galaxy, which has been colonized by humans for interstellar research purposes. However, an unknown and powerful alien force has overtaken the planet, the military defenses have been completely overwhelmed, and all hope rests on the Phalanx.</p><p>You fly through eight levels, first through various locations in Delia IV, and then you invade the aliens themselves. Like most shooters, you can upgrade your weapons by picking up bonus items dropped by enemy craft.</p>"},{"name":"Phantom 2040","year":1995,"developer":"Viacom New Media","url":"6#Phantom%202040%20%28USA%29.sfc","filesize":2097152,"score":7.3,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Sci-fi / futuristic > Licensed","desc":"<p>The cartoon mini-series: <em>Phantom 2040</em>, right here. It is the aforementioned year, 2040, and the city of Metropia is in total chaos. </p><p>Crime, smuggling and terrorism are escalating. The debase company, Maximum Inc., has invented biotechnology that is threatening to mess about with nature - causing animal extinction and ecosystem adulteration. Evil company owner, Rebicca Madison, would like to rule Metropia and the world.</p><p>In comes Kit Walker, the 24th Phantom, following the proud but secret footsteps of his ancestors. This 18 year old has to fight his way to get things right, or end trying.</p><p>The game has many twist and turns in its plot, and a multitude of endings.</p>"},{"name":"Picross NP Vol. 2","year":1999,"developer":"Jupiter Corp."},{"name":"Picross NP Vol. 3","year":1999,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.1","year":1999,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.4","year":1999,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.5","year":1999,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.6","year":2000,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.7","year":2000,"developer":"Jupiter Corp."},{"name":"Picross NP Vol.8","year":2000,"developer":"Jupiter Corp."},{"name":"Pieces","year":1994,"developer":"Prism Kikaku Ltd.","url":"5#P/Pieces%20%28NA%29.sfc","filesize":1048576,"score":7.8,"genres":"Action > Puzzle > Cards / tiles","desc":"<p><em>Pieces</em> is a new take on Jigsaw puzzles by mixing it with Tetris. Players take pieces of a jigsaw and fit them into the proper outlines on the puzzle to form a picture. Players can compete in the <em>Jigsaw Mode</em> which allows up to five friends to compete against each other, by taking turns, in a race against time depending upon the difficulty setting (four total). Players can also compete against the computer, complete with power-ups that can help the player such as \"Sweeper\" which takes away half of their opponents completed puzzle. There are eight different categories of puzzles to choose from ranging from sports themes to global locations, each with eight puzzles ranging from 36 to 60 pieces in size.</p>"},{"name":"Pilotwings","year":1990,"developer":"Nintendo Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Pilotwings%20%28USA%29.zip","filesize":1,"score":7.8,"genres":"Action > Simulation > Behind view > Flight / aviation > Vehicle simulator","desc":"<p>Fly a selection of aircraft (including training vehicles, fighter planes and helicopters) through a range of training programs and missions. The more training you complete, the better the chance that you will complete the even bigger missions. Try your hand at landing, taking off, party tricks, fly through bad weather and shoot down targets.</p>"},{"name":"Pinball Dreams","year":1994,"developer":"Digital Illusions HB"},{"name":"Pinball Fantasies","year":1995,"developer":"Digital Illusions HB","url":"5#P/Pinball%20Fantasies%20%28NA%29.sfc","filesize":1048576,"score":7.6,"genres":"Action > Top-down > Pinball","desc":"<p>After the success of Pinball Dreams on several systems, a sequel featuring four new tables was created. The gameplay is much the same as the first game, with realistic physics, multi-player options and a high score table to aim for. The tables are Partyland, Speed Devils, Billion Dollar Gameshow and Stones 'n' Bones, taking in a funfair, racing cars, a tacky game-show, and a graveyard. Each one has a range of ramps, combos, light sequences and targets to shoot, as well as general themes which are less influenced by real tables than those in Pinball Dreams.</p>"},{"name":"Pink Goes to Hollywood","year":1993,"developer":"Manley & Associates, Inc.","url":"5#P/Pink%20Goes%20to%20Hollywood%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>While having the same storyline as the Genesis version, this version has different level designs among other differences.</p><p>The game is set up with the opening level being a sort of hub world where other levels can be entered in any order. The levels themselves are based on movie set themes. Movies include Honey, I Shrunk the Pink, Pinkin Hood, Cat on a Hot Pink Roof, Pink Beard, Jungle Pink, The Pink Ranger, Pinkenstein, and The Polter Pink. There are also hidden safe rooms which can be found.</p><p>Players can find tokens throughout the levels which are in turn used to gain access to other levels or can be spent to use movie set items like bridges, stairs, and hooks or even an umbrella and a magic carpet which both can be used for temporary flight.</p><p>Besides hopping on enemies or spraying them with a Squirt sprayer, The Pink Panther can deal with enemies by using items from his bag of tricks like a fly swatter, a stoplight, a jackhammer, sledgehammer, a bowling ball, a detonator, or a white dog.</p><p>Options let the player choose how many lives they start with (3,4, or 5) and at what score intervals (25,000, 50,000, or 100,000) will the player earn an extra one.</p>"},{"name":"Pinocchio","year":1996,"developer":"Virgin Studios London","url":"5#P/Pinocchio%20%28NA%29.sfc","filesize":3145728,"score":7,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Journey through as Geppetto, the carpenter's live wooden puppet, Pinocchio, as he did in his Disney animated film - which itself was based on a children's novel.</p><p>Have Pinocchio run, jump and twist-kick through all the familiar places, including the inside of a whale, and do good deeds enough to become the real human boy he's always wanted to be.</p><p>A standard Disney platformer.</p>"},{"name":"Pipe Dream","year":1992,"developer":"The Assembly Line"},{"name":"Pirates of Dark Water, The","year":1994,"developer":"Sun Corporation","url":"5#T/The%20Pirates%20of%20Dark%20Water%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Action > Side view > Beat 'em up / brawler > Licensed","desc":"<p>The watery world of Mer is threatened by the deadly Dark Water. Prince Ren and his companions must find the Treasures of Rule to control the Dark Water and return Mer to its former glory. Always hot on their heels is the evil pirate-lord Bloth who wants to find the treasures to rule over Mer.</p><p>Based on a cartoon series by the same name, <em>The Pirates of Dark Water</em> is a side scrolling fighting game similar to Final Fight or Streets of Rage.</p><p>The player chooses a character, from among Prince Ren and his two companions Tula and Ioz, who differ in strength and agility, but who use the same basic attacks. There are two attack buttons, one for fast attacks and combinations and one for a single heavy attack. Other controls include: blocking attacks, grabbing and throwing opponents, dash attacks while running, and a special attack that hits multiple enemies consuming life energy at the same time. Most levels also require you to avoid obstacles like chasms, falling rocks or spikes that shoot out of the ground.</p>"},{"name":"Pit-Fighter","year":1991,"developer":"Atari Games Corporation","url":"5#P/Pit-Fighter%20%28NA%29.sfc","filesize":524288,"score":5.3,"genres":"Action > Side view > Arcade > Fighting","desc":"<p><em>Pit-Fighter</em> is a 3rd-person fight game that features digitized graphics of real fighters and zooming effects. Players select one of three fighters (Buzz, Ty or Kato) to take on anyone who dares. At the conclusion of a match, players are individually awarded a Knockout Bonus, Brutality Bonus, and a Fight Purse. Every third match is a Grudge Match where players test the skills of each other. The last man standing is the winner of this three-knockdown match. Players fight their way to the Elimination Match to decide who wins the opportunity to dethrone the champion, the Masked Warrior.</p>"},{"name":"Pitfall: The Mayan Adventure","year":1994,"developer":"Activision, Inc.","url":"5#P/Pitfall%20-%20The%20Mayan%20Adventure%20%28NA%29.sfc","filesize":2097152,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Pitfall: The Mayan Adventure</em> is a side-scrolling action game in which you play adventurer Pitfall Harry Jr in search of his father Pitfall Harry. You battle your way through the Mayan jungles, waterfalls, deserted mines and can bungee jump and boomerang your way to safety. There are 13 levels and the action is fast and gripping. You will need to be attentive—and quick. Or prepare to die.</p>"},{"name":"Plok","year":1993,"developer":"Software Creations Ltd.","url":"6#Plok%20%28USA%29.sfc","filesize":1048576,"score":7.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>At one day, Plok awakes to find out that his flag has been stolen. He spots it on a neighboring island and travels there to get it back. However, as he returns to his home, he realizes that all flags on his island have been replaced with flea-flags. This is only the beginning of his problems though, and he has to face many more challenges before the end of the game.</p><p>Plok has to jump and fight his way through numerous levels, trying to find the exit or fulfilling certain missions such as killing a set number of fleas. Plok can perform two different jumps, a normal jump and a higher spinning jump. He can attack his enemies by throwing his limbs at them. Collecting presents will temporarily equip him with different weapons, or transform him into all sorts of vehicles such as a helicopter or a U.F.O.</p>"},{"name":"Pocky & Rocky","year":1992,"developer":"Natsume Co., Ltd.","url":"7#Pocky%20%26%20Rocky%20%28Europe%29.sfc","filesize":1048576,"score":7.8,"genres":"Action > Isometric > Shooter","desc":"<p>This is a single player or two player simultaneous game.  It has wonderful \"Super Deformed\" type graphics set in ancient Japan and an above average difficulty.</p><p>You play as the Princess Pocky and her Racoon Rocky.  Run through each level beating the enemies and you'll face a goofy boss at the end.  Beat him and you're on to the next level.</p><p>You fight and shoot your way through numerous levels based on temples and shrines.  Pocky shoot playing cards and Rocky shoot leaves for long range attacks.  For short range Pocky uses a rod and Rocky his tail.</p><p>Pocky also has a spin attack and Rocky can freeze into a invulnerable statue. (Think Tanuki Mario)</p>"},{"name":"Pocky & Rocky 2","year":1994,"developer":"Natsume Co., Ltd.","url":"7#Pocky%20%26%20Rocky%202%20%28Europe%29.sfc","filesize":1572864,"score":7.9,"genres":"Action > Top-down > Anime / Manga > Arcade > Shooter","desc":"<p>The sequel to Pocky &amp; Rocky brings back the cooperative shooter action to the SNES with enhanced gameplay mechanics. Princess Luna has been kidnapped by a gang of evil demons and its up to Shinto priestess Pocky and her raccoon buddy Rocky to rescue her.</p><p>As in the previous game, the gameplay involves taking control of either character to clear stage after stage of enemies in classic top-down shooter manner by blasting them with your magic cards or other collectable unique powers. New for the sequel is the ability to play with optional AI-controlled partners that add team-up special moves required to beat certain bosses as well as unique abilities that take the game in different directions (opening locks, or digging to get to the underworld sections of each stage for instance).</p>"},{"name":"Poitto!","year":1994,"developer":"Metro Corporation"},{"name":"Pop'n Twinbee","year":1993,"developer":"Konami Co., Ltd.","url":"5#P/Pop%27n%20TwinBee%20%28NA%29.sfc","filesize":1048576,"score":7.9,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Shooter","desc":"<p>Another top-down shooter in the Twinbee \"cute'em up\" franchise.</p><p>Heroes Light and Pastel decide to go out and help a young maiden bring sense back to her scientist father, who apparently has bumped his head and transformed into a evil mastermind that seeks world domination.</p><p>As the other games in the series Pop'n Twinbee is a vertically-scrolling arcade shooter in which you and a friend get behind the controls of Twinbee and Winbee, the cutest starfighters ever created, and try to clear stage after stage of enemies with your weapons. Being a console original instead of a port, Pop'n features a number of additions to the gameplay mechanics, including an energy bar, eight difficulty levels and a handicap feature when playing with a friend (which makes most enemies target one fighter instead of the other).</p><p>The upgrade system remains consistent with the series's: you shoot colored bells which give different power-ups when collected, including multiple shots, \"options\" and shield energy. Also when correctly powered-up both fighters can join and perform powerful team-up moves.</p>"},{"name":"Pop'n TwinBee Rainbow Bell Adventures","year":1994,"developer":"Konami Co., Ltd."},{"name":"Popeye: Ijiwaru Majo Seahag no Maki","year":1994,"developer":"Technos Japan Corp."},{"name":"Popful Mail","year":1994,"developer":"Nihon Falcom Corp."},{"name":"Populous","year":1990,"developer":"Bullfrog Productions, Ltd.","url":"8#Nintendo%20-%20SNES.zip/Populous%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Managerial / business simulation > Real-time strategy","desc":"<p>You play a god, gaming against other gods in a celestial game of conquest. To win, you must help your chosen people take over the world and wipe out the vermin who worship that other god.</p><p>Each god starts out with a single human, dumped into the middle of the wilderness. Sometimes there is inhabitable land in sight, sometimes not. To get a chance to win, you must change the landscape, creating flat land for your followers to build on. The more followers you have, the more powerful you will be, so take care of them. Build as fast as you can, because the other god is doing the same.</p><p>When you have enough followers, you can make the leader of your people into a hero. He will then go around the land you have built, literally taking strength from the people into himself, and working his way toward the enemy. When he gets there, he will engage in holy warfare upon your enemy's people. He will burn; he will kill.  And he won't stop until they're all dead... or he is.</p><p>But you don't have to let your people have all the fun; the gods have other tools as well. You can drown your enemies one at a time with your land-lowering powers, submerge their towns in swamps, or raise a volcano in the middle of their best farmland. Even better, you can flood the land and drain all the people who didn't build on high ground. </p><p>And when you win, you'll have 500 more worlds to conquer. A god's play is just never done.</p>"},{"name":"Populous II: Trials of the Olympian Gods","year":1993,"developer":"Bullfrog Productions, Ltd.","url":"8#Nintendo%20-%20SNES.zip/Populous%20II%20-%20Trials%20of%20the%20Olympian%20Gods%20%28Europe%29.zip","filesize":1,"score":8.2,"genres":"Strategy > Diagonal-down > Isometric > Real-time > Real-time strategy > Point and select > Classical antiquity > Fantasy","desc":"<p><em>Populous II</em> continues the \"god game\" genre pioneered by Bullfrog's classic <em>Populous</em>. In PII, you're an unproven immortal who must fight your way through an entire pantheon of Greek gods, each with his or her own strategy and attacks, and ultimately enter into a showdown with Zeus himself.</p><p>The gameplay mechanics are similar to <em>Populous</em>, but PII features a wider array of spells, digitized sound, and high-resolution graphics to give the spell effects extra punch. Multiplayer is supported via serial link and dial-up.</p>"},{"name":"Porky Pig's Haunted Holiday","year":1995,"developer":"Phoenix Interactive Entertainment","url":"5#P/Porky%20Pig%27s%20Haunted%20Holiday%20%28NA%29.sfc","filesize":2097152,"score":6.4,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Porky Pig ventures to Dry Gultch Haunted Theme Park and while staying there, falls asleep. He dreams up a nightmare, staring all sorts of fiendish foes including a very annoying Daffy Duck of various sorts. Venturing through ghostly mansions, haunted woods and a strange otherworld that plays the music from Terry Gilliam's Brazil!</p>"},{"name":"Power Drive","year":1994,"developer":"Rage Software Ltd."},{"name":"Power Instinct","year":1994,"developer":"Atlus Co., Ltd.","url":"5#P/Power%20Instinct%20%28NA%29.sfc","filesize":2621440,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting","desc":"<p>The time has come for the Gouketsuji clan to celebrate their fighting tournament. Every 5 years the clan (which has spread all over the world) celebrates a one-on-one fighting tournament to see which family gets to rule and now you get to take part in the contest.</p><p><em>Power Instinct</em> is a one-on-one 2D fighting game in the tradition of Street Fighter 2, in which you select your character from a group of unique fighters and attempt to defeat your opponents in successive fashion using your arcade reflexes and your character's unique moves.</p><p>Features 8 selectable characters, plus a boss character, and single or 2-player Vs gameplay. Also includes a practice mode, battle mode and time attack and life attack modes for extended gameplay.</p>"},{"name":"Power Piggs of the Dark Age","year":1996,"developer":"Radical Entertainment Inc.","url":"5#P/Power%20Piggs%20of%20the%20Dark%20Age%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Fantasy","desc":"<p>The player is put in the role of Bruno, an anthropomorphic pig who has the task to defend his land which is currently under siege by wolves. Bruno comes equipped with a sword and the ability to throw donuts that he finds throughout the six levels of the game. Bruno also has the ability to jump and to also butt slam crates. No description of this game would be complete without mentioning the blowholes which are liberally sprinkled throughout each level. These blowholes will lift Bruno in the air so that he will be able to get to higher plateaus that he simply couldn't get to by just jumping normally.</p>"},{"name":"PowerMonger","year":1993,"developer":"Bullfrog Productions, Ltd."},{"name":"Prehistorik Man","year":1995,"developer":"Titus Interactive, S.A.","url":"5#P/Prehistorik%20Man%20%28NA%29.sfc","filesize":1048576,"score":7.2,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>In <em>Prehistorik Man</em>, the player takes control of a neanderthal who is on a quest to travel through various levels, collecting food items to get his village ready for the fast approaching fall feast. Along the way, the player will encounter an assortment of enemies ranging from spiders, giant rats and even the mighty T-Rex.</p><p>There are five levels in all and the player can upgrade their weapons to axes and mallets throughout the game as well as acquire a hang glider, giving the player the advantage of flight and covering long distances. The main goal of the game is to vanquish enemies, collect food items, and face a boss at the end of each level.</p>"},{"name":"Primal Rage","year":1995,"developer":"Atari Games Corporation","url":"5#P/Primal%20Rage%20%28NA%29.sfc","filesize":3145728,"score":6.7,"genres":"Action > Side view > Arcade > Fighting > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>A meteor struck the Earth and caused great chaos. Seven gods from ancient times awoke, and are now attempting to take control of the post-apocalyptic world.</p><p><em>Primal Rage</em> is a one-on-one fighting game featuring dinosaurs and giant apes as the fighters. The graphics are done with digitized stop-motion animation. Gameplay is similar to Mortal Kombat in that it is viewed from a side perspective, and features deadly finishing moves at the end of the match.</p>"},{"name":"Prince of Persia","year":1992,"developer":"Brøderbund Software, Inc.","url":"6#Prince%20of%20Persia%20%28USA%29.sfc","filesize":1048576,"score":8.2,"genres":"Action > Side view > Fixed / flip-screen > Platform > Puzzle elements > Direct control > Middle East > Regional differences","desc":"<p>While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place.</p><p><em>Prince of Persia</em> is a 2D platformer that is commonly regarded as a progenitor of the cinematic platformer genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements.</p><p>The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars.</p><p>The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.</p>"},{"name":"Prince of Persia 2: The Shadow & The Flame","year":1996,"developer":"Brøderbund Software, Inc.","url":"5#P/Prince%20of%20Persia%202%20%28NA%29.sfc","filesize":2097152,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Middle East","desc":"<p>After having defeated the evil Grand Vizier Jaffar, the brave Prince claimed just one reward: the hand of the beautiful daughter of the Persian Sultan. However, as the Prince approached the palace, his appearance suddenly turned into that of a beggar. Someone who looked just like the Prince ordered to throw him out. It turns out that Jaffar is alive and back for vengeance. Banished from the palace, the unfortunate Prince must travel to faraway lands and find a way to defeat the villain.</p><p><em>Prince of Persia 2</em> is, like its predecessor, a cinematic platformer. Much of the gameplay is reminiscent of the first game, focusing on precise jumping puzzles, swordfighting, and overcoming many hazards in order to stay alive. Swordfighting is more prominent and features situations where several enemies attack the Prince at once. Reinforcements may arrive after the Prince has eliminated all visible enemies. Like its predecessor, the game must be completed within a time limit.</p>"},{"name":"Princess Maker: Legend of Another World","year":1995,"developer":"Gainax Co., Ltd."},{"name":"Princess Minerva","year":1995,"developer":"Riverhill Soft Inc."},{"name":"Pro Quarterback","year":1992,"developer":"Leland Interactive Media","url":"5#P/Pro%20Quarterback%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American)","desc":"<p><em>Pro Quarterback</em> is a football game featuring 27 different teams. Since this game doesn't have an NFL or NFLPA license, there aren't any real NFL teams or players here, although the teams included in the game represent the cities of their real life NFL counterparts and also mimic the colors of their team's uniforms.</p><p>The games options allow the player to choose to play on 6 different field surfaces (grass, mud, dirt, snow, rain and artificial turf) and to choose how long the game will last (2, 5, 10 or 15 minute quarters). There are also no penalties in this game whatsoever. </p><p>Gameplay consists of playing on both offense and defense. There are 26 different offensive plays and 18 different defensive plays to choose from. The game has a down the field view when on offense, so the game doesn't have receivers in windows.</p>"},{"name":"Pro Sport Hockey","year":1994,"developer":"Tose Co., Ltd.","url":"5#P/Pro%20Sport%20Hockey%20%28NA%29.sfc","filesize":1048576,"score":5.8,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>This hockey game includes 24 NHL teams and 288 NHLPA players. The NES version contains an exhibition, training and a super cup mode. The SNES version has a practice and a season mode. The training mode in the NES version allows you to practice both offense and defense. The training mode in the SNES version lets you either practice in an exhibition game or compete in a shootout. The super cup is based on the round-robin format in the NES version. The teams chosen to compete in the super cup are decided by the teams rankings from the season mode in the SNES version.</p><p>The game is played with a top down view of the hockey rink, with the screen scrolling vertically as the puck carrier heads towards a net.</p>"},{"name":"Psycho Dream","year":1992,"developer":"Riot"},{"name":"Push-Over","year":1992,"developer":"Red Rat Software Ltd","url":"5#P/Push-Over%20%28NA%29.sfc","filesize":524288,"score":7.9,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Platform > Licensed","desc":"<p>You're playing a small ant that is willing to help a friend in a rather inconvenient situation. Apparently, the Quavers mascot Colin Curly likes his Quavers so much he lost balance and dropped them down a giant ant-hill. It's now your job to go in, in a mission to solve puzzles and retrieve the snacks for your friend.</p><p>Now, this ant-hill is a bit different from the ones you saw, and especially from the one you live in. Its path is filled with domino-like tiles and closed gates that must get through to find the snacks. You'll have to traverse different themed worlds in order to retrieve Colin's precious Quavers.</p><p>The main game consists in controlling the ant from a standard third-person platformer perspective and moving dominoes to place them in a well imagined line, so that when you push the correct one, all of them fall with a specifically marked tile falling last. The door will otherwise stay shut and you will be unable to progress. In addition to that, your ant can't fall from too high or it will die and make you restart the level.</p><p>Every domino tile has its own marking. For example, yellow ones are the ones you simply push in a direction so they push the one next to them, most often in a chain reaction. Red ones, on the contrary, can't be pushed at all (but can be moved) and tiles that hit it will fall back in the opposite direction. Other types of tiles include one that explodes when being pushed or hit by another tile, clearing the way for other tiles; one that keeps moving ahead until it hits another tile; one that creates a bridge over a gap; or one that moves straight up and stick to the ceiling, pushing a tile next to it.</p><p>Each level is timed and requires quick thinking in order to be completed successfully. Upon completion of a level, the player is given a password that can be used to resume the game at the level they last left off.</p><p>The SNES version doesn't have the Quavers branding and involves retrieving drops of cash for a rat character instead.</p>"},{"name":"Putty","year":1993,"developer":"System 3 Software Ltd."},{"name":"Putty Squad","year":1994,"developer":"System 3 Software Limited"},{"name":"Puyo Puyo","year":1993,"developer":"Compile"},{"name":"Puyo Puyo 2","year":1995,"developer":"Compile"},{"name":"Puzzle'N Desu!","year":1995,"developer":"Nihon Bussan Co., Ltd."}]