[{"name":"R-Type III & Super R-Type (Collector's Edition)","year":2018,"developer":""},{"name":"R-Type III: The Third Lightning","year":1993,"developer":"Irem Corp.","url":":R-Type III (Europe)","filesize":413820,"score":7.2,"genres":"Action > Side view > 2D scrolling > Arcade > Shooter > Space flight > Sci-fi / futuristic > Regional differences","desc":"<p>The evil Bydo Empire returns in this entry of the R-Type series. So climb into the latest R-Type vessel, the R-90,  and blast through six side-scrolling levels on your way to destroy the Bydo mothership.</p><p>Gameplay is still the classic R-Type way with huge levels and bosses. With your detachable laser unit, you can fire in front or behind your ship. R-Type III now features three different kinds of laser unit, selectable at the start of a game. Each offers different laser types depending on the power-ups collected.</p>"},{"name":"Race Drivin'","year":1992,"developer":"Atari Games Corporation","url":":Race Drivin' (USA) (Rev 1.1)","filesize":149841,"score":6.5,"genres":"Racing / Driving > 1st-person > Arcade > Tricks / stunts > Automobile > Track racing > Vehicle simulator","desc":"<p><em>Race Drivin'</em> is a sequel to the driving simulator Hard Drivin'. Game play is similar to the first game. The player must complete laps around the race track before a timer expires. There are several checkpoints around the track which increase player's time as he passes. </p><p><em>Race Drivin'</em> has three courses, one of which is the track from <em>Hard Drivin'</em>. There is a new super-stunt track, and an autocross course. The player also may choose from three types of cars.</p>"},{"name":"Radical Dreamers: Nusumenai Hōseki","year":1996,"developer":"Square Co., Ltd."},{"name":"Radical Rex","year":1994,"developer":"Beam Software Pty., Ltd.","url":":Radical Rex (USA)","filesize":719386,"score":6.7,"genres":"Action > Side view > 2D scrolling > Platform > Skateboarding > Prehistoric","desc":"<p>Radical Rex is a fire-breathing Tyrannosaurus on a skateboard who has to save the dinosaur race under the spell of an evil creature. The game consists of 10 levels set in the prehistoric age. Radical Rex can use a skateboard or glide down hills, jump, kick and breath fire. Tougher enemies need multiple hits and when burnt Rex needs to kick them once more to destroy them or use his scream (hits everything on the screen). While playing Rex collects eggs, health, power-ups for his fire breath and scream refills. Checkpoints are shown as torches that need to be charged with fire. After each level, there is a Bomberman-like sequence to earn an extra continue. Enemies include flies, turtles, toads and all kinds of dinosaurs.</p>"},{"name":"Raiden","year":1991,"developer":"Seibu Kaihatsu Inc.","url":":Raiden Trad (USA)","filesize":529614,"score":6.9,"genres":"Action > Top-down > Arcade > Shooter","desc":"<p>In the year 2090, Earth is invaded by extra-terrestrials. The World Alliance of Nations has developed a supersonic attack fighter, Raiden, to defend the Earth. A pilot must take control of the experimental fighter to destroy the alien warships that just happen to look like odd variations of typical military tanks and planes with gadgets attached to them. </p><p><em>Raiden</em> (called Raiden Trad on the Genesis and SNES) is an over-head vertical-scrolling shooter, based on an arcade game of the same title. It features two forms of weapon upgrades and two types of missiles (normal or homing). You start the game with several bombs which you can use to destroy most enemies on the screen to get yourself out of a jam. Each level ends with a large boss or bosses.</p>"},{"name":"Rampart","year":1992,"developer":"Atari Games Corporation","url":":Rampart (USA)","filesize":217598,"score":7.3,"genres":"Action > Strategy > Diagonal-down > Real-time > Arcade > Shooter > Licensed","desc":"<p>Tetris meets shoot-'em-up, <em>Rampart</em> is a game combining strategy and artillery action. Build your castle from Tetris-style pieces, place your cannons, bombard the enemy, try to repair, do it all over again. The original arcade release has a single-player and a two-player mode; later revisions incorporate three-player gameplay.</p>"},{"name":"Ranma 1/2: Akanekodan-teki Hiho","year":1993,"developer":"Atelier Double Co. Ltd."},{"name":"Ranma 1/2: Chōgi Ranbu-hen","year":1994,"developer":"Rumic Soft"},{"name":"Ranma 1/2: Hard Battle","year":1992,"developer":"NCS Corporation"},{"name":"Rap Jam: Volume One","year":1995,"developer":"64WD Creation S.A.R.L.","url":":Rap Jam - Volume One (USA)","filesize":1383391,"score":"","genres":"Sports > 3rd-person (Other) > Basketball","desc":"<p>This game combines basketball with some of the most popular rappers of the time as choose-able players. Some of the artists included are: Public Enemy, LL Cool J, Naughty By Nature, Queen Latifah (!), Yo-Yo, House Of Pain, Onyx, Warren G. and Coolio. The gameplay is modeled after the fast-paced NBA Jam and takes place on various outdoor courts in 5 different U.S. cities. Up to four players can compete, and the \"Xtra\" button works similar to turbo. There's a shot meter that enables you to sink jumpers and rattle the rim. No 3-point shots exist and there are no fouls in the game.</p>"},{"name":"Realm","year":1996,"developer":"Flair Software Ltd.","url":":Realm (Europe)","filesize":641803,"score":6.5,"genres":"Action > Side view > Platform > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>In the year 5069 A.D., an alien invasion has devastated the planet, nearly killing the entire population and leaving the major cities of the world in ruins.  Out of this chaos, Earth's last hope has arisen with a Biomech cyborg that travels through the five realms (levels) of the game in order to destroy the alien menace and bring humanity back from the brink of annihilation.</p><p>The gameplay is a side-scrolling action game, where the player travels throughout stages using weapons such as lasers, heat-seeking missiles and plasma boomerangs to destroy the various enemies scattered throughout the stages and face the standard huge menacing bosses to advance to the next level.  Power-ups can also be picked up that range from weapon upgrades to crystals that can produce a temporary shield to protect the player from enemy fire.</p>"},{"name":"Record of Lodoss War","year":1995,"developer":"Thinking Rabbit"},{"name":"Redline: F1 Racer","year":1992,"developer":"Genki Co., Ltd.","url":":Redline F-1 Racer (USA)","filesize":638999,"score":6.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Licensed","desc":"<p>Race a race car through 18 different levels as you compete with other racers. Race against a friend and upgrade your car as you win money from racing. Check the weather before a race to see if you need to put rain tires on your car, and see what advice there is in the course description. Race through tunnels and around sharp curves and tricky twists in the track's and try to be #1!</p>"},{"name":"Rejoice: Aretha Ōkoku no Kanata","year":1995,"developer":"Japan Art Media Co., Ltd."},{"name":"Relief Pitcher","year":1994,"developer":"Atari Games Corporation","url":":Relief Pitcher (USA)","filesize":1259803,"score":"","genres":"Sports > 3rd-person (Other) > Arcade > Baseball","desc":"<p>This baseball game has the following game modes: Starting Pitcher - 9 Inning game for either one or two players, Relief Pitcher - 12 game season for one player, and Relief Pitcher - Best of 7 series for two players.</p><p>The Starting Pitcher mode lets the player play out a full 9 inning baseball game. Players choose from one of four fictional teams, each with their own specialty such as being a power hitting team or a good fielding team. Players then select their pitchers special pitch type (knuckleball, rising fastball, screwball, or sinker), whether to pitch left or right-handed, and whether to pitch overhand or sidearm. On the field, pitching and batting are done from a behind the batter view. When pitching, a meter that requires timing determines the pitcher's grip. the max power of the pitch, or whether the pitcher intentionally walks the batter. While at bat, players have to time their swing to hit the pitch. Batters can swing both high and low, swing normally or with power, and bunt. On offense, if the player has runners on base, the player can choose to have the base runners lead off the base, steal, or hit and run.</p><p>The Relief Pitcher - 12 game season mode puts the player in several game saving situations to try to help their team win games. The two player Relief Pitcher - Best of 7 series is similar, with two players competing against each other in 7 different near the end of game situations.</p><p>Jack Buck is on hand to give the play by play commentary.</p>"},{"name":"Ren & Stimpy Show, The: Buckeroo$!","year":1995,"developer":"Absolute Entertainment, Inc.","url":":Ren & Stimpy Show, The - Buckeroo$! (USA)","filesize":666863,"score":"","genres":"Action > Side view > 2D scrolling > Shooter > Licensed","desc":"<p>Oh, hi kids! I'm so excited about my new invention - the Gametron 5000 Moneymaker. It pays you money for playing video games - the more you play, the more you make.</p>"},{"name":"Ren & Stimpy Show, The: Fire Dogs","year":1994,"developer":"Argonaut Games PLC","url":":Ren & Stimpy Show, The - Fire Dogs (USA)","filesize":369978,"score":"","genres":"Action > Arcade > Platform > Licensed","desc":"<p>Based on the Nickelodeon cartoon, Fire Dogs was one of the episodes in the first season and inspires this game cartridge.  You start as the dimwitted cat Stimpy who has to search through the different levels of a firehouse to find these objects to proceed: a helmet, hose, pair of socks, rope, trampoline, uniform, and a beaver(!).  They all have to be placed on a fire truck before time runs out.  You can jump, climb up stairs and firepoles, and grab items while avoiding or putting out fires with water and eluding a speedy fireman by painting yourself like a dalmatian to avoid getting thrown out. </p><p>A short 30 second bonus round follows where you must find Ren, the psychotic chihuahua.  This is followed by another 30 second round to bounce as many bags of Gritty Kitty Litter into a bin as you can.</p><p>The second level has both Ren and Stimpy holding the trampoline to catch objects falling from a burning building.  Again, there is a time limit by which all items must be caught.  If successful, you return to the firehouse again the next day and must survive a week to gain the award of the Sacred Golden Fire Hydrant Helmets.</p>"},{"name":"Ren & Stimpy Show, The: Time Warp","year":1994,"developer":"Sculptured Software, Inc.","url":":Ren & Stimpy Show, The - Time Warp (USA)","filesize":1013659,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Licensed","desc":"<p>In <em>The Ren &amp; Stimpy Show: Time Warp</em>, the player takes command of the comedy duo on a quest through time to stop Stimpy's beloved hero, Muddy Mudskipper, from changing history and ruining space and time.</p><p>The game is a side-scrolling platformer mixed with side-scrolling shooting sequences where the player takes command of a space ship through time portals in between stages. There are five stages to play in: the backyard, the Big City, the Untamed World, a zoo and a haunted house. To defeat enemies on their way, Ren and Stimpy will find various crazy weapons like beaver saws and watermelon bows, as well as other items to help them out in their quest, such as rubber nipples used for climbing walls.</p><p>There are also various obstacles and traps the players must avoid, like the Crockostimpy and the Happy Helmet which will temporarily incapacitate the player until it is knocked off their head. The player can find health power-ups to restore their health and earn points by picking up money symbols. The game also features the voice talents of Billy West.</p>"},{"name":"Ren & Stimpy Show, The: Veediots!","year":1993,"developer":"Gray Matter Inc.","url":":Ren & Stimpy Show, The - Veediots! (USA)","filesize":816637,"score":6.3,"genres":"Action > Side view > Arcade > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p><em>Veediots!</em> lets the player experience four classic episodes of the Ren &amp; Stimpy Show.</p><p>One is the episode \"The Boy Who Cried Rat\", where the player takes control of Ren dressed as a mouse and has to reach the end of a house while avoiding obstacles and enemies as well as Stimpy. Towards the end of this stage, the player must travel through Stimpy's mouth in order to complete the stage by avoiding various pitfalls and obstacles.</p><p>The second episode is \"In the Army\" where once again the player takes control of Ren as they travel through an army base, punch at enemies including soldiers, avoid various pitfalls and use various objects scattered throughout the stage in order to advance.</p><p>The third episode is \"Stimpy's Invention\", where the player takes control of Stimpy as they must escape a demented laboratory by avoiding pitfalls and enemies while collecting items to assemble the \"Happy Helmet\" and use it on Ren in order to complete the stage.</p><p>The final stage is \"Marooned\", where the player takes control of Stimpy as he's swallowed by a giant alien. They must avoid various enemies as they fall down the throat until they land in the stomach. Then the player must make it to the end of the level, attacking enemies and avoiding pits of acid in order to reach the end of the stage.</p><p>There are also power-ups for each stage including health icons and powered toast icons that will give the player a brief stint of invincibility. The game also features the voice talent of Billy West.</p>"},{"name":"Rendering Ranger R²","year":1995,"developer":"Rainbow Arts Software GmbH"},{"name":"Revolution X","year":1995,"developer":"Midway Manufacturing Company","url":":Revolution X (USA)","filesize":1839900,"score":5.1,"genres":"Action > 1st-person > Rail shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Revolution X is about the ol' Rock &amp; Roll.</p><p>There is an evil nation putting the youth down and banning our beloved rock music. Who you gonna call? Aerosmith!With the help of Aerosmith, the player must shoot his/her way through enemy infested levels, (light) guns blazing, collecting power-ups and releasing hostages.</p><p>Almost all of the graphics are digitized and Aerosmith themselves are too! There are also lots of fmv videos. </p>"},{"name":"Rex Ronan: Experimental Surgeon","year":1993,"developer":"Sculptured Software, Inc.","url":":Rex Ronan - Experimental Surgeon (USA)","filesize":417847,"score":"","genres":"Action > Educational > Side view > Fighting > Platform > Health / nutrition","desc":"<p>This game comes at you with a <em>Fantastic Voyage</em> tale of a microsurgeon miniaturized to a near-microscopic scale in order to enter the body and save the life of a tobacco salesman, ironically laid low by health complications caused by the very cigarettes he sold. Rex must be asking himself, \"My parents put a mortgage on their house to put me through eight years of medical school just so I could scrub tar off someone's lungs like a window-washer?\" But it gets worse: Big Tobacco, pre-emptively attempting to silence the turnabout whistleblowing revelation they anticipate in the unlikely event of this salesman's recovery, have some shrinking technology of their own, and have introduced sinister nanobots into his body to ensure his -- and Rex's -- untimely demises.</p><p>Washing off goo and attempting to survive the robot sprites' poor collision-detection routines comprise the large part of this game (albeit in exotic, well-rendered environments such as The Mouth, The Heart, The Lungs, and eventually The Brain -- where you struggle to clean up regenerating blobs of nicotine addiction); sporadically you also encounter mines which grill you on smoking-related health facts and myths, rewarding correct answers and blowing up when presented with falsehoods. Though the majority of the game plays like a 2D platform shooter, there are also over-the-shoulder 1st-person inter-level sequences where you pilot a futuristic vessel through bronchial tubes and blood vessels like something out of Space Harrier or Tempest -- only with more globs of diseased sputum zooming straight toward you.</p>"},{"name":"Riddick Bowe Boxing","year":1993,"developer":"Micronet Co. Ltd.","url":":Riddick Bowe Boxing (USA)","filesize":426343,"score":6.2,"genres":"Sports > Side view > Boxing > Licensed","desc":"<p><em>Riddick Bowe Boxing</em> is another one of the many boxing games released at the time, but with subtle differences. The HUD contains damage and energy meters along with a miniature ring up the top of the screen, useful to see the player's position in the ring so as not to get backed into a corner real easily.</p><p>Players can compete in the standard, 1-Player v. CPU, 1-Player v. 2-Player or even a career mode, where there are four preset fighters to choose from along with an option to create customers boxers. The career starts out at position #25 in the ranking and players slowly work up the ladder, going to the gym in between bouts to build up stats to eventually take on \"Big Daddy\" himself, Riddick Bowe.</p><p>The game is practically a copy of Evander Holyfield's Real Deal Boxing, save for the graphics style and the included fighters.</p>"},{"name":"Rise of the Phoenix","year":1994,"developer":"KOEI Co., Ltd.","url":":Rise of the Phoenix (USA)","filesize":1015463,"score":7.1,"genres":"Strategy > Top-down > Turn-based > Historical events","desc":"<p>Another in the long line of Koei strategy games, this one takes place in 206 B.C. as two rival warlords, Liu Bang and Xiang Yu fight for control of China. The gameplay consists of viewing overhead maps, showing cities and armies, letting the player view the battles which consists of a castle siege and an open-field battle.</p><p>Among the many options, the player can choose to move or attack among others such as sending secret night raids into enemy camps, take control of towns and cities, set up ambushes and even dam up rivers to divert them into flooding out an enemy fortress. </p><p>The goal of the game is to destroy the enemy army and take control of all the cities in China by building armies and raising taxes in occupied territories in order to build the army. The player can choose either Lui Bang or Xiang Yu, playing against the computer or go head-to-head against a friend.</p>"},{"name":"Rise of the Robots","year":1994,"developer":"Mirage Technologies (Multimedia) Ltd.","url":":Rise of the Robots (USA)","filesize":3038531,"score":4.4,"genres":"Action > Side view > 2D scrolling > Fighting > Cyberpunk / dark sci-fi","desc":"<p>Electrocorp, the world's leading manufacturer and developer of advanced robotics ran the Leader Project to develop a multi-task, ultra-intelligent, self-aware robot to manage every aspect of the factory plant. The end result was the Supervisor Droid, a machine capable of assuming any form and accessing any database. But when an EGO virus infected the Supervisor's self-awareness it started to consider its need above of those of the company, infecting the other robots in the plant and declaring itself their leader. Electrocorp then sent its top-secret ECO32-5 Cyborg to infiltrate the plant and destroy the supervisor.</p><p><em>Rise of the Robots</em> is a versus fighting game. The player controls the ECO32-5 Cyborg and must fight all the other robots in the plant until finally meeting the Supervisor Droid. The controls consist of 3 buttons for punches and 3 buttons for kicks (one for each in the Game Gear version), and jumping, moving, crouching and blocking are performed with the directional pad. The Cyborg has two super moves, the Turbo Head Butt and the Shoulder Barge. The player can choose the difficulty, number of rounds and time limit for the fights, as well as turn turn the super moves off.</p><p>The game has three modes: mission, where the player fights each robot in a fixed order; training, where the player can fight any robot in any desired order; and two players versus mode (absent in the Game Gear version), where the second player chooses any of the enemy robots to fight with. It features an AI system that reacts to the player style, 3D rendered cutscenes and the title song was composed by Queen's guitarist Brian May.</p>"},{"name":"Risky Challenge","year":1995,"developer":"KAN's Co., Ltd."},{"name":"Rival Turf!","year":1992,"developer":"Jaleco Ltd.","url":":Rival Turf! (Europe)","filesize":706221,"score":6.1,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler > Direct control > Crime > Regional differences","desc":"<p>When a ruthless gang led by Big Al invades their turf, it's up to the Brawl Brothers to take back their streets and send their rivals home with their tails between their legs. You can go at it alone or team up with a friend for some simultaneous two-player action as you kick, punch, and body slam your way to victory through six stages of no holds barred, hand-to-hand fighting action. There are all kinds of realistic street-fighting techniques to master, including body slams, leg sweeps, jabs, hooks, and uppercuts. If you want a fight but aren't feeling friendly, then turn the tables on your friend and go head-to-head for bragging rights and control of the streets. In RIVAL TURF, only the strong survive…can you take it?</p>"},{"name":"River City Girls Zero","year":1994,"developer":"Almanic Corp."},{"name":"Road Riot 4WD","year":1992,"developer":"Atari Games Corporation","url":":Road Riot 4WD (USA)","filesize":319669,"score":5.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Off-roading > Track racing > Vehicular combat > Oceania","desc":"<p>A game featuring four wheel drive racing with the addition of vehicular combat.</p><p>The game features 3 difficulty levels (rookie, intermediate, and pro). Players start out on a simple beginner track and after completing that, get to compete on 11 different tracks in various different locales to win the series championship. Some locations are located in the United States like New Jersey and Las Vegas, while other tracks are located on other continents such as Africa,Australia, and even Antarctica. Each of these tracks has a host whose team of 3 vehicles the player has to beat.</p><p>The players vehicle is equipped with an unlimited amount of missiles that can be used to shoot at opposing vehicles to slow them down. Crashing into certain obstacles will earn the player hazard pay which increases their score.</p>"},{"name":"Road Runner's Death Valley Rally","year":1992,"developer":"ICOM Simulations, Inc.","url":":Road Runner's Death Valley Rally (USA)","filesize":597702,"score":7,"genres":"Racing / Driving > Side view > Top-down > 2D scrolling > Arcade > Platform > Puzzle elements > Licensed","desc":"<p>Everybody has remembered waking up early on the weekend to watch Saturday morning cartoons. But would would happen if the cartoons were interactive? Well, you might end up with something like Death Valley Rally. The object is pretty simple: Race the Road Runner through each level as quickly as you can while collecting different colored flags, which are worth different amounts of points. When you reach the ending, if you're fast enough, you'll also get a time bonus, but if you're good enough, you'll get a flag bonus. Some of the flags are INCREDIBLY difficult to find, and the fact that you won't usually be able to find them, will challenge (or at least frustrate) most gamers. You can run, turbo run (by stocking up on bird seed), peck, and jump in this wild adventure, as you try to catch the escape the ever-witty Wile E. Coyote and his assorted ACME contraptions.</p>"},{"name":"RoboCop 3","year":1992,"developer":"Ocean Software Ltd.","url":":RoboCop 3 (Europe)","filesize":463667,"score":5.7,"genres":"Action > Side view > Top-down > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Crime > Licensed","desc":"<p><em>RoboCop 3</em> is a side-scrolling platform shooter. You get missions (such as rescuing your colleagues who are being kept hostages), which are divided into several smaller levels. The levels usually consist of several platforms, and are heavily populated by enemies who shoot at you. You can gather special repair kits, which will be used to restore your health after you've completed a level. \"RoboCop 3\" is more of a shooter than its predecessors, having more and tougher enemies.</p>"},{"name":"RoboCop Versus the Terminator","year":1993,"developer":"Interplay Productions, Inc.","url":":RoboCop Versus The Terminator (Europe)","filesize":771251,"score":6.8,"genres":"Action > 1st-person > Side view > 2D scrolling > Platform > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p>In the future, human soldiers of John Connor's resistance force against the machines are fighting a losing war against Skynet and its robot forces. After discovering that one of the foundation technologies for Skynet is the cybernetics technology used in the creation of Robocop, one of the resistance's soldiers, Flo, is sent back in time before the rise of the machines to destroy Robocop and stop Skynet from being built. However Skynet learns of the time travel attempt and sends Terminators to stop Flo.</p><p>In the game you control Robocop who may move across the screen, jump, fire and exchange weapons. Robocop starts with the Auto-9 which has unlimited ammunition. Other weapons may be more powerful but contain limited ammo. Beginning the game on a mission of law enforcement, you soon meet up with Flo and must engage in battle against Terminators, the forces of OCP and several obstacles.</p>"},{"name":"Robotrek","year":1994,"developer":"Ancient Co. Ltd.","url":":Robotrek (USA)","filesize":1161820,"score":7.3,"genres":"Action > Role-playing (RPG) > Side view > Top-down > Anime / Manga > Sci-fi / futuristic > Steampunk","desc":"<p>There exists a prosperous town named Rococo built on all the latest modern conveniences. Living in Rococo is a famous inventor, Dr. Akihabara and his son. All is peaceful until suddenly a group known as \"Hackers\" appear and begin causing trouble. The Hackers and their robotic monsters take part in robberies, vandalism and destruction around the world. Dr. Akihabara leaves on a voyage determined to thwart the Hackers plan, leaving his son behind in Rococo. As strange things begin to happen in and around Rococo, Akihabara's son decides to investigate. Idolizing his father and also wishing to grow up to be an inventor, he builds himself a robotic fighting machine and sets out on his Robotrek...</p><p><em>Robotrek</em> is a fantasy RPG with sci-fi and steampunk elements. Players take the role of Akihabara's son, living in his lab at Rococo. The majority of the game is an overhead view, traveling through areas, talking to people and using items. Early on in the game, the player will learn how to create a robot in the laboratory and will use this this robot in a side-view battle mode to combat monsters and gain experience. The robots can be upgraded and equipped with different types of weapons, both found and invented. The player can have a total of three different robots to choose to send to battle, which allows customization strategies for certain situations and enemies.</p><p>Akihabara's son will also need to think up new inventions to thwart the challenges in front of him. He gets the ideas for these inventions from talking to people or witnessing events which cause a lightbulb to go off above his head. New items then become available for production in the lab. Also, many existing items including his own inventions can be combined properly in the lab to create new items and weapons. Items no longer wanted can often be turned into scrap which sometimes is also able to be combined.</p>"},{"name":"Rock n' Roll Racing","year":1993,"developer":"Blizzard Entertainment Inc.","url":":Rock n' Roll Racing (USA)","filesize":763659,"score":8.3,"genres":"Action > Racing / Driving > Diagonal-down > Arcade > Shooter > Sci-fi / futuristic","desc":"<p><em>Rock 'n Roll Racing</em> is an arcade combat racing game. Combat plays a heavy role in the game, as each car has a frontal weapon, such as a laser or missile, and a drop weapon, such as spikes or mines. As you complete races, you get more money to upgrade your car. The soundtrack features famous rock tracks such as \"Born to Be Wild, \"Bad to the Bone,\" \"The Peter Gunn Theme,\" \"Highway Star\" and \"Paranoid.\"</p><p>The game is very similar to RPM Racing. The later released PC version is an official release, but based on the SNES version incorporating the ZSNES emulator and limited to three tracks.</p>"},{"name":"Rocketeer, The","year":1992,"developer":"NovaLogic, Inc.","url":":Rocketeer, The (USA)","filesize":625629,"score":5.9,"genres":"Action > Racing / Driving > Arcade > Shooter > Flight / aviation > Interwar > Licensed","desc":"<p>Based on the Dave Stevens' original comic book series and the movie made by the Walt Disney Company.  Participate in several action sequences that mimic the same sequences in the movie, like racing a plane, a shootout in a warehouse, and hand-to-hand combat on top of a flying blimp.</p>"},{"name":"RockFall","year":2013,"developer":"Playsoft.co"},{"name":"Rocko's Modern Life: Spunky's Dangerous Day","year":1994,"developer":"Viacom New Media","url":":Rocko's Modern Life - Spunky's Dangerous Day (USA)","filesize":837263,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Licensed","desc":"<p><em>Rocko's Modern Life</em> is a side-scrolling action game where the player takes control of the Nickelodeon character, Rocko, as they travel through three different stages (Rock-O-Whey Beach, Hill-O-Stench garbage dump, and Laundryland) trying to protect his beloved dog Spunky from the various dangers throughout the stages.</p><p>As Rocko travels through the stage, he has to perform various tasks to keep Spunky out of danger such as tossing him above onto safer platforms, moving objects to break his fall or fight off various enemies that want to harm him.</p><p>There is no time limit and the game starts out with lives, with a health bar for Spunky while the player's character, Rocko, cannot be hurt. The story is told through comic-style panels and features the classic characters such as Heffer, the Bigheads and Earl the local bulldog.</p>"},{"name":"Rocky Rodent","year":1993,"developer":"Irem Corp.","url":":Rocky Rodent (USA)","filesize":607500,"score":7.1,"genres":"Action > Side view > Platform","desc":"<p>Mafia member Don Garcia has kidnapped Melody, the daughter of the owner of the Rose Restaurant. Rocky Rodent agrees to rescue her in exchange for an all-you-can-eat meal.</p><p>In order to find Melody, Rocky Rodent has to complete a number of fast-paced, side-scrolling platformer levels. While he can also defeat enemies by jumping on them, his most important weapons are four different hairstyles: His first hairstyle allows him to skewer and throw his enemies, destroy porous blocks as well as cling to and jump up certain ledges. A mohawk can be thrown at enemies like a boomerang or thrown into certain walls, from where it serves as a trampoline. Braids can be used as a grappling hook and a corkscrew-like haircut lets him bounce on his head to jump higher than normal. When Rocky is attacked by an enemy, he loses his current haircut. If he is attacked while not wearing any special haircut, he loses a life.</p>"},{"name":"Roger Clemens' MVP Baseball","year":1992,"developer":"Sculptured Software, Inc.","url":":Roger Clemens' MVP Baseball (USA) (Rev 1)","filesize":617891,"score":5.7,"genres":"Sports > Diagonal-down > Baseball","desc":"<p>Roger Clemens is known by some as the greatest pitcher in baseball history. In  <em>Roger Clemens' MPV Baseball</em> players play a standard a 9 innings baseball game in Exhibition mode and a full regular season can be played including the World Championship Playoffs in the Regular Season mode. While playing in Regular Season mode the player can see their chosen team’s progress by using the in game calendar showing all the games.</p><p>Players select a fictional team from the following groups:<em> </em><em>National Division West:</em>* San Francisco Quakes, Los Angeles Apaches, Cincinnati Big Cats, San Diego Suns, Houston Mustangs, and Atlanta Condors.</p><ul><li><p><strong>National Division East:</strong> Chicago Swords, Montreal Lumberjacks, New York Buffalos, St. Louis Commandos, Pittsburgh Panthers, and Philadelphia Generals.</p></li><li><p><strong>American Division West:</strong> Oakland Bashers, Seattle Pioneers, Minnesota Hounds, California Waves, Texas Cowboys, Chicago Red Birds, and Kansas City Kings.</p></li><li><p><strong>American Division East:</strong> Toronto Bears, Boston Hornets, New York Rebels, Detroit Wheels, Milwaukee Marshals, Baltimore Eagles, and Cleveland Tomahawks.</p></li></ul><p>Each team has a set of players the make up the team each with their own skill level and statistics which, like the teams, is fictional other then Clemens himself who is on the Boston Hornets team. </p><p>When controlling the pitcher the player can control the speed and spin of the pitch as well as the pitchers position on the plate. The pitcher can also stop the opponent stealing a base which can be seen via windows showing the positions of all the baserunners. When controlling the batter the player has to time the hit to successfully hit the ball so it will not be a missed hit or a foul, or has the option to not hit in case of a ‘ball’. The player can also steal a base while batting. After the ball is hit the game goes into fielding mode where the camera shifts to a view that is lower than the normal 45 degree angle (the fielder gets smaller as he moves away from the camera). The player then controls the closest fielder to get or catch the ball and then throw it to the selected base. There are many different cameras angles that the game selects depending on the location of the ball. The camera can be on the left, center, or right side of the field in ether infield or outfield position and all cameras can pan to follow the ball. </p><p>The player can use a password to save their progress in Regular Season mode. An exhibition match can be played in two player mode with the use of two controllers.</p>"},{"name":"Romance of the Three Kingdoms","year":1994,"developer":"KOEI Co., Ltd."},{"name":"Romance of the Three Kingdoms II","year":1991,"developer":"KOEI Co., Ltd.","url":":Romance of the Three Kingdoms II (USA)","filesize":604351,"score":7.8,"genres":"Strategy > Top-down > Turn-based > Turn-based strategy > China (Ancient / Imperial) > Historical events","desc":"<p>The sequel to Romance of the Three Kingdoms. The game concept is still the same, though they did improve a lot of features that one may consider 'disturbing' from <em>RTK I</em> (e.g. Generals dying easily due to disease, etc.). <em>RTK</em> can be said to be much more 'stable' where players no longer have to worry that much about time length in the game, as the game take a slower time rate to allow the players to build up their forces without much interference. The <em>RTK II</em> gameplay and interface is closely similar to Nobunaga's Ambition II.</p>"},{"name":"Romance of the Three Kingdoms III: Dragon of Destiny","year":1992,"developer":"KOEI Co., Ltd.","url":":Romance of the Three Kingdoms III - Dragon of Destiny (USA)","filesize":883021,"score":7.7,"genres":"Strategy > Top-down > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p><em>Romance of the Three Kingdoms III: Dragon of Destiny</em> is another strategy game by Koei. The concept is the same here as in Koei's other wargames: conquer all you can!</p><p>In this case the historical setting is ancient China. The country is under the control of one Emperor, but all of the faction leaders want to be the emperor themselves. You begin with one territory and you must conquer more to win the game.</p>"},{"name":"Romance of the Three Kingdoms IV: Wall of Fire","year":1994,"developer":"KOEI Co., Ltd.","url":":Romance of the Three Kingdoms IV - Wall of Fire (USA)","filesize":1535393,"score":7,"genres":"Strategy > Top-down > Isometric > Turn-based > China (Ancient / Imperial) > Historical events","desc":"<p>The Three Kingdoms era of Chinese history is the setting for this strategic war game. Select one of 38 leaders and guide your people to power by military or diplomatic means in an isometrically viewed world. Military tactics such as well-placed taunts and deliberate enemy confusion are on offer. Weaponry includes catapults and automatic-firing crossbows.</p>"},{"name":"Romancing SaGa","year":1992,"developer":"Square Co., Ltd."},{"name":"Romancing SaGa 2","year":1993,"developer":"Square Co., Ltd."},{"name":"Romancing SaGa 3","year":1995,"developer":"Square Co., Ltd.","url":":Romancing Sa-Ga 3 (Japan) (Rev 1)","filesize":2601800,"score":"","genres":"Role-playing (RPG) > Top-down > Turn-based > Fantasy","desc":"<p>Every 300 years the Death Eclipse kills all newly born creatures. Men, women, and children, animals and plants, even ferocious monsters - no one can survive the devastation caused by the Eclipse. No one except a child chosen by the destiny. 600 years ago, such a child survived the Death Eclipse, only to become a demon king. During the next Eclipse, a chosen child became a holy king, and he defeated the evil demon king. Now, when the next Eclipse is nearing, nobody knows who the next fortunate survivor will become - a demon or a holy man?</p><p>In <em>Romancing SaGa 3</em>, you can play through the story controlling any one of the eight main characters - Julian, Monica, Mikhael, Harid, Katarina, Thomas, Elena, and Sarah. The story is common for all eight characters, and they often join together and share the same piece of a story. The princess Monica learns about a rebellion planned by a treacherous Baron to dethrone her brother, Marquis Mikhael. She goes to warn him, but on her way, she loses her horse, and has to stop in an inn of the town Shinnon. There, she meets travelers who agree to lend her a horse and accompany her to see her brother. When they finally reach Mikhael, a war begins...</p><p>The game has a refined upgrading system: you can upgrade your weapons and your spells by using them continuously. The party combat is turn-based, and there are also strategic army-vs.-army battles you'll have to command.</p>"},{"name":"RPM Racing","year":1991,"developer":"Silicon & Synapse, Inc.","url":":Radical Psycho Machine Racing (USA)","filesize":311153,"score":"","genres":"Racing / Driving > Diagonal-down > 2D scrolling > Direct control > Automobile > Track racing","desc":"<p>RPM Racing was preceded by Rareware's R.C. Pro-Am in 1988 and Electronic Art's Racing Destruction Set in 1985, with the latter being the larger influence. It is a precursor to Rock 'n Roll Racing, which was done by the same developer.</p><p>Combat, obstacles, and traction on the non-flat tracks play a significant role. There are 3 vehicle types to choose from that perform differently on pavement, dirt, ice, flat or bumpy tracks. Cars can be armed with oil, nitro, and mines. Additionally, there are 3 levels of tires, engines, shocks, and armor.</p><p>There are full race season, single race, and custom track modes. In 1 player games, the 2nd player is replaced with one of 8 AI opponents who are each associated with their own vehicle. There are 128 total tracks in this game.</p><p>In season mode, each track has an entrance fee and cash prize for placing 1st; often lesser cash prizes for lesser placements are also awarded. For an additional fee, racers can opt to move to a higher racing class (levels) where fees and prizes are bigger. Each class has its own set of tracks that the player may choose from. No track is mandatory or unavailable within a class. The player also has the option of going back to a lower class for free, which may become necessary if funds are eaten up be fees without winning prizes. However, going up always incurs a fee, even if the player has been there before.</p><p>During custom track designing, players can set the track's laps, gravity, and starting line type. Each track section can be pavement, dirt, or ice. Track sections are laid out like puzzle pieces on a 2D non-isometric grid (Pipe-Mania style). Sections include horizontal and vertical straights, four standard 90° turns, eight T-sections for diverging and converging multiple paths in any direction, and a criss-cross. Either a horizontal or vertical special straight section is used as the starting grid.</p>"},{"name":"Rudra no Hihō","year":1996,"developer":"Square Co., Ltd."},{"name":"Ruin Arm","year":1995,"developer":"Plex"},{"name":"Run Saber","year":1993,"developer":"Hori Electric Co., Ltd.","url":":Run Saber (USA)","filesize":528270,"score":7.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Sci-fi / futuristic","desc":"<p>In the year 2998, the brilliant Dr. Bruford is experimenting with genetic structures and radiation. He hopes to create new functions in nature that will remove the pollution from the Earth before it is too late. Unfortunately Dr. Bruford's experiments go wrong and genetic monsters are unleashed upon the world. The only thing that can stop these creatures are Dr. Bruford's previous achievement: Genetically enhanced warriors known as the Run Sabers. Two of the Run Sabers, Sheena and Allen are ready to activate.</p><p>Run Saber is a side-scrolling platform game similar in gameplay to Strider. Players assume the role of one or both of the Run Saber characters. Choosing either Sheena with her Ice powers or Allen with his Thunder powers, players must defeat mutant monsters. The Run Sabers can move side to side, jump in the air, attack with a sword, climb along walls or roofs, slide across the ground and drop-kick. Additionally, each character has a special move, which damages everything on the screen with either Ice or Lightning, and which can be activated by collecting orb power-ups. Other power-ups include small health, large health, extra life and a larger sword. Players progress through 5 different levels, often encountering powerful boss and miniboss mutant creatures.</p>"}]