[{"name":"Saban's Power Rangers Zeo: Battle Racers","year":1996,"developer":"Natsume Co., Ltd."},{"name":"Samurai Shodown","year":1994,"developer":"TAKARA Co., Ltd.","url":"5#S/Samurai%20Shodown%20%28NA%29.sfc","filesize":4194304,"score":8.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>In early feudal Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who had possessed and taken over Amakusa's body, as Ambrosia wishes to shroud the world into eternal darkness. Now, the player must select from out of 12 fierce warriors and plus 3 bonus characters in order to fight for the honor of defeating Amakusa once and for all, while fulfilling a specific mission for each and every warrior in the game.</p><p>The Genesis version of the game does not however include the Earthquake which has been removed due to its 16-bit memory capacity and technical size limitations.</p>"},{"name":"Sangokushi Eiketsuden","year":1995,"developer":"KOEI Co., Ltd."},{"name":"Sansara Naga 2","year":1994,"developer":"Victor Entertainment Inc."},{"name":"Satella-Q","year":1995,"developer":"Nintendo EAD"},{"name":"Saturday Night Slam Masters","year":1994,"developer":"Capcom Co., Ltd.","url":"5#S/Saturday%20Night%20Slam%20Masters%20%28NA%29.sfc","filesize":3145728,"score":7.3,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Fighting > Wrestling","desc":"<p><em>Saturday Night Slam Masters</em> is a wrestling game. Ten wrestlers with different fighting styles and individual special attacks are available. They are controlled with three buttons; one for jumping, one for attacking and one for pinning. When close to your opponents, you can grab them to perform various moves ranging from ordinary attacks to body slams to throws. Since the action takes place in a ring, it is also possible to climb the turnbuckle or use the ropes to your advantage. You can also leave the ring for a limited amount of time to fight with different weapons that can be found outside the ring.</p><p>Apart from a standard Single Match mode, the SNES version also features a Battle Royal mode for up to four players. This mode is not available in the Genesis version, which features a Death Match mode that can not be found in the SNES version. A Death Match is a no rules match in which weapons can be used used and the rope is replaced with barbed wire.</p>"},{"name":"Scooby-Doo Mystery","year":1995,"developer":"Argonaut Software Ltd.","url":"5#S/Scooby-Doo%20Mystery%20%28NA%29.sfc","filesize":2097152,"score":6.8,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>This version is different from it's Genesis counterpart. While the gameplay is similar (exploring levels to collect clues and solve the mystery), there are four different episodes for this version. While visiting the Drabwell Ranch, ghost's interrupt the festivities and the gang must find out who is behind the hauntings and why. Another adventure takes the gang to Deadman's Cove where a ghostly pirate has been scaring off tourists and it is up to Scooby and the Gang to bring it to a halt. The other two mysteries take place at a fun fair and a haunted mansion.</p><p>Players can use Scooby's unique sniffing ability to find clues. Scooby also consume Scooby Snacks to reduce the fright meter. Additionally there are a series of mini-games that player can participate in such as \"Wac-A-Monster\" or \"Make a Scooby Sandwich\". The graphics are faithfully recreated to resemble the long-running Hanna Barbara series.</p>"},{"name":"SD The Great Battle: Aratanaru Chōsen","year":1990,"developer":""},{"name":"SeaQuest DSV","year":1995,"developer":"Sculptured Software, Inc.","url":"5#S/SeaQuest%20DSV%20%28NA%29.sfc","filesize":2097152,"score":7.1,"genres":"Action > Isometric > Platform > Naval / watercraft > Sci-fi / futuristic > Licensed","desc":"<p>Based on the first season of the TV series of the same name, your character is an officer of the UEO: The United Earth Oceans Organization. You begin the game inside a training simulation, which upon successful completion ensures your transfer to the crew of the seaQuest DSV where you will be called upon to perform the same duties.</p><p>Primarily, your function is to navigate the seaQuest Deep Submergence Vessel around the underwater map to various 'mission areas' where you will be called upon to use the on board vehicles to accomplish some task. Typical missions include salvage operations, rescue operations, disarmament of underwater explosives, termination of enemies and exploration. Damage of underwater property is deducted from your budget and completion of objectives adds to it. The money must be used to resupply weapons and buy additional vehicles. Underwater is a dangerous place.</p><p>The vehicles you have at your command include* Speeder: A simple two-man vessel designed entirely for speed. It is also a combat vessel and may fire forwards, move up &amp; down and change orientation between facing left and facing right</p><ul><li>Stinger: A prototype \"next generation\" attack vessel, this one-man sub allows you to orientate in any direction to fire your weapon accurately.</li><li>Sea Crab: A slow vehicle used for excavation, mining, and rescue missions. It is the only vessel that can dock with other vessels and one of only two that can pick up undersea objects for transport. It comes with a water jet to clear debris and a retractable drill</li><li>Sea Truck: Slow and bulky, this vessel may move up and down and change it's orientation between left and right. It's weapons are torpedoes and mines which may be dropped behind it. Furthermore it can also pick up undersea objects for transport</li><li>Remote (HR) Probe: Small and agile, this vehicle contains only a very simple weapon. It's main purpose however is underwater welding and repair of objects. It can also activate switches</li><li>Darwin - Intelligent Dolphin and seaQuest mascot: Darwin the Dolphin is perhaps the most agile of the vehicles, and may take off in bursts of speed. However Darwin has no weapons with which to defend himself and is very vulnerable. Darwin is able to get into tiny spaces that none of the other vehicles can reach. Darwin is able to activate switches.</li></ul>"},{"name":"Secret of Evermore","year":1995,"developer":"Square Soft, Inc.","url":"6#Secret%20of%20Evermore%20%28USA%29.sfc","filesize":3145728,"score":7.8,"genres":"Role-playing (RPG) > Top-down > Action RPG > Sci-fi / futuristic","desc":"<p>A boy and his dog live together in the town of Podunk. One day, the boy chases the dog into an old abandoned mansion where a scientist lived thirty years ago. Some of his equipment is still operational, and when the dog chews on it, they are both sent to the strange world of Evermore, and have to figure out how to get back.</p><p><em>Secret of Evermore</em> is an action RPG similar to Secret of Mana, with a few key changes. Multiplayer is out. Rather than three characters, there are just the two. The equivalent of magic is alchemy, where each effect requires several base ingredients which the player gathers as the game advances.</p>"},{"name":"Secret of Mana","year":1993,"developer":"Square Co., Ltd.","url":"6#Secret%20of%20Mana%20%28USA%29.sfc","filesize":2097152,"score":8.3,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Action RPG > Fantasy > Regional differences","desc":"<p>Long ago, people lived in harmony with the natural world and used the power of Mana to help their nations grow. But when evil forces took control of the Mana Fortress, seeking to use it to conquer the world, a terrible war began which destroyed much of civilization but brought peace to the world once more. Over the long years, the events of the past became but legends to the new generations of humans. But history repeats itself... </p><p>One day while exploring a forbidden valley near his village, a young boy finds a rusty sword stuck in a stone. He does not realize that this is the Mana sword of legend, used in the great war of the past. By drawing the sword, the boy unwittingly summons hordes of monsters, and is expelled from his village for breaking the ancient taboo. A mysterious knight Jema who is passing through the area recognizes the sword and gives him instructions for the future. First, he must repair the sword, and then, with its help, take control of the Mana seeds which can be found hidden around the world to prevent them from falling into evil hands.</p><p><em>Secret of Mana</em> is an action RPG, featuring real-time hack-and-slash style combat, in which up to two computer-controlled companions can accompany you. The protagonist has a stamina gauge: the more stamina he has, the more powerful his strike is. The player also has access to a growing arsenal of spells with various effects. It is possible to upgrade weapons, armor, and magic to higher levels.</p>"},{"name":"Secret of the Stars","year":1993,"developer":"Tecmo, Ltd.","url":"9#Tecmo%20Secret%20of%20the%20Stars%20%28USA%29.zip","filesize":1,"score":5.7,"genres":"Role-playing (RPG) > 1st-person > Diagonal-down > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Regional differences","desc":"<p>You are a young boy named Ray, who lives with his foster-father in a small country house on an island. But he can not enjoy his idyllic life for a long time. Ray is told about the evil wizard Homncruise, who plans to conquer the world. Defeating Homncruise won't be easy: first Ray must find the magic crest of his fallen father, and build a strong team of legendary warriors, named Aquitallion. Only then will he and his comrades be ready to face Homncruise and save the world.</p><p>In this game you wander around the world map, visiting towns and dungeons, and fighting monsters in turn-based combat viewed from first-person perspective, much like in <em>Dragon Quest</em> games. You'll have two parties at your disposal, and will be able to switch between them at any time. One party is the Aquitallion, the \"main\" one, and the only one which can access plot-progressing areas. The other parties can be used for visiting dungeons and retrieving valuable items. At a certain point in the game, you'll also be able to build and manage your own town.</p>"},{"name":"Seifuku Densetsu: Pretty Fighter","year":1994,"developer":"Genki Co., Ltd."},{"name":"Seiken Densetsu 3","year":1995,"developer":"Square Co., Ltd.","url":"5#S/Seiken%20Densetsu%203%20%28English%20Translated%2C%20Rev%201.01%20-%20Bugfix%20Edition%20Version%29.sfc","filesize":6291456,"score":7.9,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Action RPG > Fantasy","desc":"<p><em>Seiken Densetsu 3</em> is set in the same world as the two previous <em>Seiken Densetsu</em> games (the first is Final Fantasy Adventure, and the second is most known as Secret of Mana). The mysterious power of Mana is also the center of all events in <em>Seiken Densetsu 3</em>. Years have passed, and all the destructive powers of Mana have been securely sealed by Mana Swords into eight seeds, all placed in eight different kingdoms. But some people know about those sealed powers, and they don't want to free them for the sake of humanity, but for their own gain - such as the kingdom of Altena, which is slowly freezing and which can be saved only by the legendary powers.</p><p>The game features several plot lines connected to each other by their common background. In the beginning of the game, you are offered to choose a group of three among six different characters of different classes: Duran the Fighter, Angela the Magic User, Lisa the Amazon, Carlie the Cleric, Kevin the Grappler and Hawk the Thief. Each one of them has her/his own background story and dwells in a different land. Gradually, the connections between those different characters become apparent, and the seemingly loose story lines are connected into a whole.</p><p><em>Seiken Densetsu 3</em>, like the previous game of the series, is an action RPG, with real time combat.</p>"},{"name":"Sengoku","year":1993,"developer":"SNK Corporation"},{"name":"Sgt. Saunders' Combat!","year":1995,"developer":"Chickenhead"},{"name":"Shadowrun","year":1993,"developer":"Beam Software Pty., Ltd.","url":"6#Shadowrun%20%28USA%29.sfc","filesize":1048576,"score":7.7,"genres":"Role-playing (RPG) > Diagonal-down > Isometric > Action RPG > Cyberpunk / dark sci-fi > Fantasy > Sci-fi / futuristic > Detective / mystery > Licensed","desc":"<p>After the Awakening, magic has been re-discovered, and human beings have accepted the existence of those they thought to be fantasy creatures. Mega-corporations and cyberworlds had to give space to elves and Native American shamans. Jake Armitage was a seemingly ordinary data courier, assassinated by a hit squad in the year 2050 in Seattle, Washington. Miraculously, his true story began after his death. A mysterious figure approached Jake and cast a spell on him; after that, he woke up in the morgue. </p><p>Jake doesn't know what happened to him, he doesn't even remember his own name. He is contacted by a shamanistic Dog totem with a cryptic message about his mission. Wandering through the large city where monorails, computers, and street gangs armed with automatic weapons co-exist with orcs, dwarves, and vampires, he begins to unravel the mystery, gradually learning about dangers awaiting him around every corner, and his own past.</p><p><em>Shadowrun</em> is based on the pen-and-paper role-playing game of the same name, more specifically on the novel <em>Never Deal with a Dragon</em> by Robert Charrette. It is entirely different from the Genesis adaptation of the same license. The game is a skill-based RPG with action-oriented combat. Most of the time Jake uses firearms; he can also learn magic spells, primarily with defensive and support capabilities. The player can hire \"deckers\", temporary party members who can aid Jake in battles, and to whom the player can assign basic commands or let them be controlled by the AI.</p><p>Karma points are awarded to the player for successfully eliminating enemies. These act like experience points in other RPGs and can be manually distributed by the player. The player can increase the character's basic parameters (such as hit points or charisma), as well as have him master various skills. These include firearms, computers, negotiation, leadership, and others. </p><p>Jake can also use his cyberdeck to access cyberspace known as the Matrix, for plot-related purposes or in order to obtain money. Represented by an icon, Jake moves through the cyberspace, fighting programs that protect data from intruders. Jake's success in these endeavours largely depends on his computer skill.</p><p>Dialogue with non-playable characters plays an important role. Most quests involve Jake exploring various locations in Seattle and gathering information from people. Conversations are topic-based; often it is necessary to learn about a particular topic from a specific character and then choose it in a conversation with another one to obtain the necessary information.</p>"},{"name":"Shanghai II: Dragon's Eye","year":1992,"developer":"Activision, Inc.","url":"5#S/Shanghai%20II%20-%20Dragon%27s%20Eye%20%28NA%29.sfc","filesize":1048576,"score":7.9,"genres":"Puzzle > Top-down > Fixed / flip-screen > Cards / tiles > Tile matching puzzle","desc":"<p><em>Dragon's Eye</em> is an installment in the tile-matching game series initiated by Activision. Players try to remove mahjong tiles in pairs from a set pattern. Different versions of the game have up to eight different tile sets, twelve patterns based on the animals of the Chinese zodiac, and a layout editor for creating patterns.</p><p>In addition to the standard mode, the game also features \"Dragon's Eye\", a two-player Shanghai variant. Players take turns adding and removing tiles from a small field with one player attempting to remove all the tiles and the other trying to position tiles to make this impossible.</p>"},{"name":"Shanghai III","year":1994,"developer":"Kuusoukagaku Corp."},{"name":"Shanghai: Triple-Threat","year":1995,"developer":"Activision, Inc."},{"name":"Shaq Fu","year":1994,"developer":"Unexpected Development","url":"5#S/Shaq-Fu%20%28NA%29.sfc","filesize":2097152,"score":5.5,"genres":"Action > Side view > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>While en route to a charity game in Tokyo, basketball star Shaquille O'Neal (called \"Shaq\" for short) is drawn into an alternate dimension by a local man who believes only Shaq can save his grandson. Once there, he must fight a succession of 11 opponents, one at a time, with gameplay resembling Street Fighter 2 or Mortal Kombat.</p><p>The game's graphics used similar rotoscoping techniques (similar to those used in Flashback or Prince of Persia) making Shaq's 7'2\" frame is represented. As well as the story mode, the player can play individual fights, either with 1 or 2 players, although one human player must always be Shaq. Shaq can jump a huge distance, although he struggles to block.</p>"},{"name":"Shien's Revenge","year":1994,"developer":"Almanic Corp."},{"name":"Shijō Saikyō League Serie A: Ace Striker","year":1995,"developer":""},{"name":"Shin Kidō Senki Gundam Wing: Endless Duel","year":1996,"developer":"Natsume Co., Ltd."},{"name":"Shin Megami Tensei","year":1992,"developer":"Atlus Co., Ltd.","url":"5#S/Shin%20Megami%20Tensei%20%28English%20Translated%2C%20Rev%201%20With%20Bugfixes%2C%20Rev%201%20and%20the%20Auto%20Map%20Patch%2C%20Rev%201.3%29.sfc","filesize":2097152,"score":7.5,"genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p>A young man lives together with his mother in Kichijoji, a district in modern Tokyo. One day, he has a strange dream: he is being sucked into another dimension, a strange maze-like structure. A spirit appears in front of him and asks him his name. As he proceeds further, he meets a man who is hanging on a cross, another one who is being tormented by a demon, and a mysterious young woman who is bathing in a pool.</p><p>\"Wake up!\" - the voice of his mother cuts through the dream. The young man wakes up and checks his computer. Suddenly, a message arrives: the world is headed towards destruction. Only he who can summon demons through a virtual space will be able to prevent a disaster. Unable to understand what that means, the young man goes outside and finds out a murder has occurred in the nearby park. The district must be cut off from the rest of the city until the murderer is found. As the young man acquires a device that allows him to communicate with demons, he begins to realize that his role in the upcoming events may be greater than he thought.</p><p>A follow-up to the first two <em>Megami Tensei</em> games, <em>Shin Megami Tensei</em> is a first-person RPG set in modern-day and post-apocalyptic Tokyo. The hero of the game can summon demons, who consume a mysterious energy called Magnetite, which can be obtained from battles. The summoned demon joins the party and is then fully controllable by the player. The active party can include up to six characters: the hero, the heroine, and four slots usually reserved for the demons, though other human characters might also join. There is a wide variety of demons in the game, most of which are taken from real-world mythologies. The demons have levels, individual statistics, spells, special abilities, etc.</p><p>Enemy encounters are random, and the first-person combat is turn-based. During combat, human characters can use swords or guns; the heroine is also able to learn and cast magic spells. Unlike most other Japanese RPGs, the game allows the player to raise the parameters of the two main characters manually when leveling up. A major gameplay element are demon conversations, which is usually the only way to recruit demons. Typically, the player has to convince the demon to join the party by choosing appropriate dialogue lines. </p><p>All the creatures in the world of <em>Shin Megami Tensei</em> belong to one of the three ideologies: Law, Chaos, or Neutral. The narrative is largely dedicated to conflicts between these ideologies; during several key moments in the story, the player has to decide which one to follow. Joining one of the ideologies influences the subsequent narrative as well as some gameplay elements: certain weapons can be only equipped by a follower of a specific ideology, demons are more likely to join the hero if he shares their ideology, etc.</p>"},{"name":"Shin Megami Tensei II","year":1994,"developer":"Atlus Co., Ltd.","url":"5#S/Shin%20Megami%20Tensei%20II%20%28English%20Translated%2C%20Rev%201%29.smc","filesize":2621440,"score":"","genres":"Role-playing (RPG) > 1st-person > Turn-based > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p>Fifty years have passed since the hero of Shin Megami Tensei followed the neutral path, defeated the leaders of Law and Chaos, and founded a state where followers of both ideologies could live freely. But his reign of freedom doesn't last long. The Messian faith gains power, expanding the Cathedral into a new enclosed environment named Tokyo Millennium. The Gaians rise up, but their rebellion is repressed by the Messians' elite warrior class, the Temple Knights. People flock into the encapsulated city, submitting themselves to the strict hierarchy imposed by the Messian Center, where only the privileged living in the Center district are safe from demonic assaults.</p><p>A few years later, a retired arena fighter Okamoto rescues a man named Hawk, who was fighting for his life against a demon. He trains him to fight in the arena of the Valhalla district, hoping that he would win the tournament, which will grant them both citizenship in the Center district. When Hawk succeeds, he is brought before a Messian bishop, and learns the shocking truth about his own origins and the role he is supposed to play in the grand scheme of events. A new battle for a better future begins.</p><p><em>Shin Megami Tensei II</em> retains all the gameplay features of the previous game. The player is able to summon demons, fuse them to create more powerful ones, make them participate in battles, talk to random enemies and receive information from them, etc. The combat is turn-based, and the player explores the complex, maze-like dungeons from a first-person perspective view. Like in the first game, the Law, Chaos, and Neutral alignments play an important role: during the course of the game, the player will have to make choices that influence the alignment of the protagonist, steering the storyline into different directions.</p><p>New features include a \"magic succession\" system, which allows demons to carry over their original magic spells when they are fused into new ones, a few additional spells and abilities, and the possibility to play at the casino and win unique items.</p>"},{"name":"Shin Momotarō Densetsu","year":1993,"developer":"Hudson Soft Company, Ltd."},{"name":"Shin Nihon Pro Wrestling '94: Battlefield in Tokyo Dome","year":1994,"developer":"Fujicom Co. Ltd"},{"name":"Shodai: Nekketsu Kōha Kunio-kun","year":1992,"developer":"Technos Japan Corp."},{"name":"Shutokō Battle '94: Drift King","year":1994,"developer":"Genki Co., Ltd."},{"name":"Sid Meier's Civilization","year":1994,"developer":"MPS Labs","url":"5#S/Sid%20Meier%27s%20Civilization%20%28NA%29.sfc","filesize":1572864,"score":8,"genres":"Strategy > Top-down > Isometric > Turn-based > 4X > Managerial / business simulation > Turn-based strategy > Multiple units/characters control","desc":"<p><em>Civilization</em> has the widest scope of any strategy game of its time. You are a leader of a nation. You begin in the Stone Age, and complete the game in the XXIth century (unless your civilization gets destroyed earlier). Your eventual goal is to become the dominant civilization in the world, either by wiping out everybody else, or being the first to get a space ship to Alpha Centauri.</p><p>As the nation's leader, you have many responsibilities. You have to build cities, and then micromanage them, constructing various buildings. Most of people in your cities will be working on the neighbouring lands to get food (without it, your city won't survive or grow), production (used to build military units and buildings) and trade (which can be exchanged for money, science (see below) or luxuries that make people happy. You decide how much trade you want to invest into each of these areas.) You have to make sure that your people are in a good mood; if they get too unhappy, the city will collapse into disorder, and won't produce anything until you fix the situation. </p><p>If you're ambitious, you can build Wonders of the World - epic constructions, such as the Pyramids or the Hoover Dam. Each Wonder is an unique thing, and only one of each can exist in the world. They give you a lot of benefits if you complete them, but they take a long time to build, and many of them will eventually stop working. </p><p>There are other nations in the world, and there are also barbarians, so you'll have to invest into the military to protect yourself and to attack. Sure, you can sign peace treaties with other nations, and even exchange scientific knowledge with them (although sometimes they'll demand tribute from you), but eventually you'll probably have to fight. You control each of your military units on the world map, attacking your opponents' units and cities (possibly taking over them). </p><p>Not all units are for combat though. Settlers are used to build cities, create roads (for easier travel of your units) and improve the land around cities, increasing production. Diplomats can be sent to foreign cities to negotiate with the other nations or create embassies, but they can also bribe enemy units to join you and conduct espionage and sabotage in the enemies' cities. Caravans can be sent to faraway cities to increase trade in their home city, and they can also help in building Wonders of the World. </p><p>Scientific progress is an important part of the game. The more science your cities produce, the faster you research new technologies. Initially, you'll be finding out about the wonders of Alphabet or Bronze Working, but late in the game you'll be researching Computers and Robotics. Most technologies give you some new units, buildings and other things, although some have more interesting effects - for example, after inventing the Automobile, you'll find out that your citizens started producing pollution. Pollution is a bad thing; if there's too much of it, global warming may occur. </p><p>How your cities prosper depends partially on the type of government that your nation has. Initially you're living in Despotism, but this can stunt growth of your civilization, so it's a good idea to switch to something else - Monarchy, Republic, Democracy or Communism.</p>"},{"name":"Side Pocket","year":1993,"developer":"Data East Corporation"},{"name":"SimAnt","year":1993,"developer":"Maxis Software Inc."},{"name":"SimCity","year":1991,"developer":"Maxis Software Inc.","url":"6#SimCity%20%28USA%29.sfc","filesize":524288,"score":7.8,"genres":"Simulation > Top-down > Free-roaming camera > City building / construction simulation > Managerial / business simulation > Contemporary","desc":"<p><em>SimCity</em> sets you as the mayor of a new municipality, with the responsibility of building and maintaining a place where citizens can move to and work and be happy. The first task is to place essentials such as housing, transport links, schools, factories, and shops. There are 50 types of these, allowing for homes of all standards and different types of businesses. Make sure to consider which sites are effective for which tasks. Some power sources pollute, others don't but are more expensive. Taxes must be raised to ensure an income, and then portions allocated to public services such as policing and roads. Earthquakes, floods, and fires are all emergency situations that must be dealt with to contain any damage.</p><p>Successful mayoring will cause the small village to grow into a town, then a city, and finally a metropolis. As the city's size grows so do its needs. Commercial buildings may suddenly find that they need an airport to expand trade, or housing may find itself changing rapidly as vast amounts of people come and leave.</p><p>The game also includes 8 pre-defined time-limited scenarios, with specific challenges and targets. The environment varies in each game (especially if you have the Terrain Editor add-on), and this should affect your choices.</p>"},{"name":"SimCity 2000","year":1995,"developer":"Maxis Software Inc.","url":"5#S/SimCity%202000%20-%20The%20Ultimate%20City%20Simulator%20%28NA%29.sfc","filesize":2097152,"score":7.7,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > City building / construction simulation > Managerial / business simulation > Point and select > Contemporary","desc":"<p><em>SimCity 2000</em> is the successor to the city simulation game Sim City. You are once again the mayor, but this time you can fully customize the terrain before building your city. The graphics are isometric, whereas the original had graphics displayed in a top-down fashion.</p><p>This title adds numerous features over the original such as the ability of building \"light\" zones, subways, hospitals, colleges, zoos, and arcos which are actually cities in cities. You can now give names to places, and your city is surrounded by neighboring towns with which you can trade goods. Finally, instead of the poll in the first game, you now have the option of reading several newspapers to get an idea of your progress.</p>"},{"name":"SimEarth: The Living Planet","year":1991,"developer":"Maxis Software Inc.","url":"5#S/SimEarth%20-%20The%20Living%20Planet%20%28NA%29.sfc","filesize":1048576,"score":7.1,"genres":"Educational > Simulation > Top-down > Ecology / nature","desc":"<p><em>SimEarth</em> puts you in charge of an entire planet throughout its 10 billion year lifespan. Your ultimate task is to guide the planet’s inhabitants into the stars, from its humble single-celled roots.</p><p>The main threats you face include pollution, disease, famine, war and global warming. The controls available to you include the chance to move mountains and continents, creating different levels of species, and unleash tidal waves and earthquakes so as to reshape your planet. All of these things take from your limited energy, which must be replenished.</p>"},{"name":"Simpsons, The: Bart's Nightmare","year":1993,"developer":"Sculptured Software, Inc.","url":"5#T/The%20Simpsons%20-%20Bart%27s%20Nightmare%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Action > Side view > Top-down > Arcade > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Bart Simpson has to stay up late and write a paper for class tomorrow. For once, he is determined to get a good mark. However, very quickly, he falls asleep. Nightmare after nightmare haunt his subconsciousness, and it is up to you to get over each one, so that Bart will eventually wake up. </p><p><em>Bart's Nightmare</em> is an action game based on the TV cartoon show <em>The Simpsons</em>. The player navigates Bart through the side-scrolling overworld, collecting pages of his homework while avoiding various enemies modeled after characters from the show. For example, his sister Lisa would occasionally turn him into a frog, Principal Skinner may force him to wear a Sunday school uniform (slowing his movement), etc. Bart can repel enemies by blowing a bubble gum at them. </p><p>Once a homework page has been found, the player can step through colored doors and engage in various mini-games. These involve Bart transforming into a \"Bartzilla\", a giant monster out to destroy Springfield; swimming through Bart's own bloodstream, using air pumps to kill germs; being attacked by Itchy and Scratchy, the duo from the meta-fictional violent cartoon; flying over the city as the superhero Bartman, fighting boss enemies; and exploring the treacherous columns in the Temple of Maggie as Indiana Bart.</p>"},{"name":"SimTown","year":1996,"developer":"Maxis Software Inc."},{"name":"Sink or Swim","year":1994,"developer":"Zeppelin Games Limited","url":"5#S/Sink%20or%20Swim%20%28NA%29.sfc","filesize":524288,"score":6.7,"genres":"Puzzle > Side view > 2D scrolling > Real-time","desc":"<p>Your name is Kevin Codner – rescue mariner extraordinaire, answering the distress call of a sinking cruise liner, the SS Lucifer. You set off in your little submarine and board the ship where a horde of passengers desperately need your keen oversight and \"shipsmarts\".</p><p>In 60 levels you have to rescue as many passengers (dubbed the Dim Passengers) as possible. At the beginning the passengers fall through a tube in the level. Similar to Lemmings you have to find a way for the passengers to the exit of the level. In order to do so, you must blast hindrances such as cargo boxes and bulkheads with bombs or, when no bombs are left, reposition the boxes with a crane. There are also conveyor belts in the levels. If the belt moves in the wrong way, the passengers either can't use it or may even be transported to their dooms, being dropped off into water, fire or steam jets. You can usually choose the direction of the belts by pulling a lever.</p><p>There are several types of scenarios that Kevin Codner (you) are faced with throughout the game. Of course the puzzles get progressively more difficult, involving things like patching up cracked pipes to stop a lethal jet of steam from cooking the distressed passengers. You can blast away obstacles and stack crates in creative manners. For instance, you can have them fall onto each other to form a bridge across a gap or to provide shielding from fire. This is usually done by hoisting them onto conveyor belts using a crane.</p><p>Each level has a certain \"save limit\", meaning you have to save at least a certain amount of passengers. This again is akin a bit towards Lemmings, and lots of levels have a built-in time limit, represented by water pouring into the compartment, rising ominously. When the water rises high enough, the passengers will get carried along with it, and they can only swim for a short period of time before getting exhausted and drowning, so you'd better be on time with some assistance.</p><p>At the end of each level you receive a password (again, Lemmings-style) so that you may pick up your game from the current level without having to progress through them all from the get-go.</p><p>Genesis and SNES versions feature 100 levels. Also, the Genesis version shows a password only once in 5 levels starting from level 5. Although the passwords for each level actually exist, they are never given by the game.</p>"},{"name":"Skuljagger: Revolt of the Westicans","year":1992,"developer":"Realtime Associates, Inc.","url":"5#S/Skuljagger%20-%20Revolt%20of%20the%20Westicans%20%28NA%29.sfc","filesize":524288,"score":5.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>The pirate Sküljagger and his crew hold the island of Westica hostage. Forcing the people who live there to be his slaves, Sküljagger rules unopposed with an iron fist. A brave sailor named Storm Jaxon decides to rebel and steal Sküljagger's magical sword. Now he must fight for his life and ultimately to free the Westican people.</p><p><em>Sküljagger: Revolt of the Westicans</em> is a sidescrolling platform game. Players select between a 1 player game, an alternating turn 2 player game or Bubblegum Practice. The player controls Storm Jaxon who is able to run left and right, jump and swing Sküljagger's magic sword. Storm must reach the end of each level before time runs out or risk losing a life. Under normal circumstances, touching an enemy or projectile will cause him to die, though the sword is often able to destroy projectiles. By collecting red jewels, Storm is able to both augment the sword with a projectile attack and be protected from one enemy attack. Green jewels will also protect from one enemy attack, however collecting 25 of them will grant an extra life. Blue jewels add additional time for Storm to complete each level. Finding a mask will make Storm invulnerable for a short time. These power-ups are either floating in the air of each level or hidden away in chests, boxes, rocks and coconuts. However these items which may hide items can also be picked up and thrown at enemies.</p><p>In addition to the power-ups listed above, fruity bubblegum can also be found. Only one bubble gum flavor can be carried at a time and it will be held until the player activates it. Grape bubblegum encases Storm in a giant invulnerable bubble that can bounce higher than jumping alone. Cherry bubblegum will require the player to inflate manually, but will allow Storm to fly. Beware as over inflating the bubble will pop it. Watermelon bubblegum will turn Storm into a projectile that damages anything on the screen, also gathering items. Orange bubblegum will let Storm spit out pellets at enemies which will destroy them. Bubblegum power-ups can be tested in the special bubblegum practice option of the menu.</p>"},{"name":"Skyblazer","year":1993,"developer":"Ukiyotei Company, Ltd.","url":"6#Skyblazer%20%28USA%29.sfc","filesize":1048576,"score":7.9,"genres":"Action > Side view > Platform","desc":"<p>Arianna, a young sorceress, has been kidnapped by Ashura. Sky has pledged his life to rescuing her. Sky must venture through many colorful stages and nice background effects.</p><p>Skyblazer is a blend of side-scrolling fighting with magical skills. Locating potions to recover energy and gaining magic points to thrash the enemies becomes a major part of the gameplay. Sky can also stick to and climb vertically up walls.</p>"},{"name":"Slam Dunk: SD Heat Up!!","year":1995,"developer":"Tose Co., Ltd."},{"name":"Slayers","year":1994,"developer":"BEC Co., Ltd.","url":"5#S/Slayers%20%28English%20Translated%2C%20Rev%201.01%29.sfc","filesize":2097152,"score":"","genres":"Role-playing (RPG) > 1st-person > Top-down > Anime / Manga > Turn-based > Fantasy > Licensed","desc":"<p><em>Slayers</em> is based on an manga series of the same name (also known as <em>Lina the Teenage Sorceress</em>). The heroine of the manga (and of the game) is Lina Inverse, a seventeen-year-old girl who can use magic and is also proficient with the sword. Lina particularly likes money, and often robs rich people and hunts for treasure. She also has a sense for justice - if a village or a town is in trouble, Lina will do anything to protect it and fight the bad guys. In the game, Lina is knocked down after a fight against mysterious attackers, and is found by the inhabitants of the nearby village. The trouble is, she can't remember anything! When she meets her long-time companion Naga, their first objective become to investigate the goblin attacks on the population, but Lina's ultimate quest is to regain her memory and find out who or what has attacked her.</p><p>The game is a traditional Japanese-style RPG with towns, dungeons, random enemies, and turn-based combat viewed from first-person perspective, in Dragon Quest fashion. The characters can attack physically or use special attacks. Lina can also cast various magical spells. There is no overworld character navigation; instead, the player selects locations on the map for instant travel. The game features anime-style cutscenes.</p>"},{"name":"Smart Ball","year":1991,"developer":"System Sacom","url":"5#S/Smart%20Ball%20%28English%20Translated%2C%20Rev%201%20With%20Restored%20Content%2C%20Alt%20Font%2C%20and%20Fixed%20Controls%20Patches%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>King Geoffrey of Kyliria has recently passed away.  Jerry, his eldest son, was all set to take the throne, however his younger brother Tom was overcome with jealously and hired an evil wizard to kidnap Jerry's wife, and also turn his brother Jerry into a gelatinous ball. Now Tom will be able to rule over Kyliria unopposed. Players take on the role of the now transformed Jerry who is out to take back his kingdom and his wife, and of course regain his human form. </p><p>The game involves going through 8 stages (broken up into two parts each) of side-scrolling action. At the end of each stage is a boss monster that must be disposed of.</p><p>Jerry moves by sliding across the ground and can latch on to walls and climb them. Jerry can also jump, stretch out to cling to ceilings, and also move at a faster pace. Jerry can consume balls that he finds during a stage and can then fire them out of his body at enemies blocking his path. Enemies can also be defeated by jumping on them and then flattening Jerry's body on them. Also, there are flowers that contain items for Jerry to collect. Items include life, which refills health, a 1-up that adds an extra life, and a seed, which will grow a climbable beanstalk when planted. If the player collects the scattered letters that appear in every stage that spell out the name Jerry, the player will earn two extra lives.</p><p>The Japanese version of this game contains towns in between levels, where the player has the option to speak with townspeople to move the storyline along. This element of the game was removed when it was later released in North America.</p>"},{"name":"Smash Tennis","year":1993,"developer":"Namcot","url":"5#S/Smash%20Tennis%20%28NTSC%20Conversion%29.sfc","filesize":1048576,"score":7.4,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>The controls of <em>Smash Tennis</em> work similar to other tennis games and especially Namco's previous tennis game World Court Tennis: the player moves the athlete over the court and presses buttons with the correct timing in order to win the match. This time there is no story mode, but a tournament mode instead. Here the goal is to win the Grand Slam by playing various tournament matches. However, a match only has a single set. There are 20 athletes (both male and female) to choose from which have different advantages and drawbacks. </p><p>The exhibition matches are more free form: the player can choose the conditions of the match, especially the surface which influences the ball physics. Some of them are recreations of realistic tennis stadiums, others are fictional places like a strand or in front of a temple. Here there are optical gags built in, e.g. a mountaineer who falls down when hit with the ball. The \"Whistle-Stop-Tour\" allows to play against the same opponent on multiple surfaces.</p>"},{"name":"Smurfs Travel the World, The","year":1996,"developer":"Virtual Studio"},{"name":"Smurfs, The","year":1994,"developer":"Infogrames Europe SA","url":"5#T/The%20Smurfs%20%28NTSC%20Conversion%29.sfc","filesize":1048576,"score":7.3,"genres":"Action > Side view > 2D scrolling > Platform > Licensed","desc":"<p>Free the Smurfs before Gargamel smurfs then all!Platform game where you will be able to play with the jockey smurf, the brainy smurf, the greedy smurf and the hefty smurf to resolve the adventure.All of the classic SMURF characters are along for the adventure, guaranteeing you a Smurf-tastic time.</p>"},{"name":"Snoopy Concert","year":1995,"developer":"Nintendo R&D1"},{"name":"Snow White in Happily Ever After","year":1994,"developer":"Imagitec Design Inc.","url":"5#S/Snow%20White%20in%20Happily%20Ever%20After%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Action > Side view > Arcade > Fantasy > Licensed","desc":"<p>Follow the further story of Snow White after the evil Queen's death. Her brother Lord Maliss, who can take the form of a dragon, changes Snow White's Prince into a monster Shadow Man.  You can play as Snow White or Shadow Man and must go through eight levels full of platform obstacles and enemies to free the kingdom from his evil sorcery.  This side-scrolling platformer is based on an animated movie by Filmation released in 1993.  </p><p>You collect fruit and stars through each level and can jump on some enemies or throw apples at them (which are also used to break through blocks). Be careful as you jump on platforms as going too close to the edge can cause you to lose balance and fall.  On the screen, your health is shown by a heart.  If you get hit by an enemy, fall down a pit, or fall from too high, it will decrease by one.  If it reaches zero, you lose one of three lives.  Some special attacks can be used, if possessed, like apple bombs.  Eventually a sign \"Find The Exit\" will appear and you can exit to the next level.  If you make it to the end, you must fight Maliss in dragon form.  You can change the difficulty level or choose a continuous play option as well.</p>"},{"name":"Soccer Kid","year":1993,"developer":"Krisalis Software Ltd."},{"name":"Socks the Cat: Rocks the Hill","year":2018,"developer":"Realtime Associates, Inc."},{"name":"Soldiers of Fortune","year":1993,"developer":"The Bitmap Brothers","url":"5#S/Soldiers%20of%20Fortune%20%28NA%29.sfc","filesize":1572864,"score":7.6,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Steampunk","desc":"<p>A time traveler from the future was stranded in Victorian England, and his knowledge of yet unknown technological inventions was passed to the Royal Society, headed by Baron Fortesque. With the help of this knowledge, Fortesque managed to construct an immensely complex artificial intelligence known as the Chaos Engine. However, creation rebelled against its creator, assimilated its mind, and turned Britain into a war zone populated by mad machines. Mercenaries are willing to enter this dangerous place and put an end to the chaos, hoping for an appropriate reward.</p><p><em>Chaos Engine</em> (<em>Soldiers of Fortune</em> in the US) is a run-and-gun overhead shooter. Sixteen levels (in four groups of four) await the players in the game. The basic gameplay is similar to Gauntlet, but in an open-air setting, with bridges across rivers and other features in the maps. The visuals are in the 'metallic and blue' style Bitmap Brothers appeared to favor.</p><p>There are six characters available in the game, each with different strengths and weaknesses, and different starting prices. In two-player mode, each player chooses a character and plays co-operatively, but in one-player games, the player also chooses a character for the computer to control, with its artificial intelligence allowing it to open doors, pick up power-ups and take on enemies away from the ones occupying the player-controlled character.</p>"},{"name":"Solid Runner","year":1997,"developer":"Sting, Inc."},{"name":"Sonic Blast Man","year":1992,"developer":"ITL Co., Ltd.","url":"5#S/Sonic%20Blast%20Man%20%28NA%29.sfc","filesize":1048576,"score":6.8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Fighting","desc":"<p>You take on the role of Sonic Blast Man, a superhero, in this side-scrolling shooter, fighting against various forms of evil. While you have the typical punch, jump, and kick moves, the Sonic Blast Man also has two special power moves: Dynamite Punch and Screw Bomb. You travel through five different stages and fight enemies ranging from local ruffians to robots and even aliens from outer space.</p>"},{"name":"Sonic Blast Man II","year":1994,"developer":"ITL Co., Ltd.","url":"6#Sonic%20Blast%20Man%20II%20%28USA%29.sfc","filesize":1572864,"score":7,"genres":"Action > Side view > Beat 'em up / brawler","desc":"<p>Heavy Blast Man is once again trying to take over the Earth.  People are being turned into hideous monsters and being made to serve him. Sonic Blast Man returns along with some new friends, Sonia and Captain Choyear. Together, they battle Heavy Blast Man and his minions to save the Earth from destruction.</p><p>You control one of three characters in this side-scroller, as you fight your way through various levels filled with enemies and bosses. Beat them up with the basic punches and kicks or use your super moves to get out of tight spots.</p>"},{"name":"Soreyuke Ebisumaru! Karakuri Meiro - Kieta Goemon no Nazo!!","year":1996,"developer":"Konami Co., Ltd."},{"name":"SOS","year":1993,"developer":"Human Entertainment, Inc.","url":"5#S/S.O.S.%20%28NA%29.sfc","filesize":1048576,"score":6.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Puzzle elements > Interwar","desc":"<p>The date is Tuesday, September 13th, 1921. It's a stormy night, and the luxury ocean liner \"Lady Crithania\" is about to be capsized by an enormous wave. Many of its crew and its 2300 passengers will be killed outright in the initial overturning; in the transfigured catastrophic ship environment, most of the remainder will be unable to locate, reach and secure a safe exit from the sinking ship before it floods entirely. </p><p>Inspired by Paul Gallico's 1969 novel <em>The Poseidon Adventure</em>, this game puts the player in the shoes of one of four denizens of the fated vessel: Capris Wisher, architect; Redwin Gardener, counselor; Luke Haines, sailor; or Jeffrey Howell, doctor. Each of these gentlemen possess certain exclusive skills and distinct backstories and motivations - a successful strategy toward winning the game will vary greatly depending on which character the player initially selects to control.</p><p>The goal is not to be on the ship when it goes down for the last time. Accomplishing this demands mastery of a new skill hitherto untapped by its platform-game spiritual predecessors Prince of Persia and Flashback: exploring and navigating the ship in both an upright and an upside-down position, as well as many of the gradiated permutations between - thanks to dizzying Mode 7 abuse, the game environment will tip, tilt and skew at predictable intervals, granting access to some previously unreachable areas while denying access to other portions of the ship the player perhaps intended to go back through.</p><p>A successful evacuation is going to require the assistance of other survivors. Supposing the player can find and reach them, it will still be necessary to safely lead them past obstacles and hazards; as with most NPCs, they're slower and less agile than the protagonist, necessitating plotting out the simplest, safest course possible, given the circumstances. The game's ending is determined by which and how many people the player managed to rescue.</p><p>The game must be completed within a time limit of one hour. Since injury in this dangerous and unpredictable environment is so frequent and, indeed, inevitable, death has been replaced by a deduction of five minutes from the time remaining; but no matter how safe the protagonist may find himself after one hour of game time, when the countdown reaches zero, it's game over.</p>"},{"name":"Soul Blazer","year":1992,"developer":"Quintet Co., Ltd.","url":"6#Soul%20Blazer%20%28USA%29.sfc","filesize":1048576,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > Action RPG > Fantasy","desc":"<p>You have been called by the Master to restore life to the Friel empire. The ruler, King Magridd, struck a deal with the evil Deathtoll - in exchange for the soul of one living being, Deathtoll will give him a piece of gold. Magridd's greed got the better of him, and, thinking of the millions of souls of every living creature around the world, readily agreed to the deal. But Magridd himself has since disappeared, and the the land is now devoid of life - instead only filled with Deathtoll's monstrous minions. Will you be able to save Friel's subjects from their horrible fate?</p><p><em>Soul Blazer</em> is an action RPG in the style of The Legend of Zelda. Like <em>Zelda</em>, battles are not turn-based - the player directly attacks enemies and dodges them. As they progress, they also unlock special items which allows them to complete tasks for characters or access special areas (such as the Dream Rod, which transports you into someone's - or some<em>thing's</em> - dream). Unlike <em>Zelda</em>, the game has an experience meter, and the player levels up and becomes stronger as they defeat enemies. The game's unique hook is that there are \"Monster Lairs\" spread all over the land of Friel. When they destroy all the enemies in a lair, they don't come back, and when they step on the empty lair, it restores part of the game world, bringing back anything from plants, to animals, to people, to buildings and more. Each restored soul helps in some way - for example, the player can climb regrown ivy to reach new areas, reunite families by bringing back husband and wife, rebuild cities by restoring architects, and talk to characters to complete even more quests.</p><p>The player's main goal is to find six Stones, which allow them to gain access to the World of Evil, where Deathtoll resides. These stones are guarded by key characters in different parts of the world, usually the rulers, who require the player to defeat a boss character to rescue them. While most of the game allows them to progress in a linear fashion, there are certain souls that can only be restored by killing monsters that can't be harmed with their earlier weapons. The player will need to find special weaponry and then backtrack to previous areas to rescue these souls. It's also advisable to revisit previous locations, as certain characters may have new sidequests to complete which can reward them with new items to make them even stronger.</p>"},{"name":"Space Ace","year":1993,"developer":"Oxford Digital Enterprises Ltd."},{"name":"Space Football: One on One","year":1992,"developer":"Argonaut Software Ltd.","url":"5#S/Space%20Football%20-%20One%20on%20One%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Sports > 1st-person > Sci-fi / futuristic","desc":"<p>In the futuristic sports game Space Football, 2 players steering hovercrafts try to score touchdowns on each other by picking up and carrying a hoverball into a touchdown area. The hovercraft has the ability to accelerate, reverse, track the hoverball, and it can also fire at the opposing player to make him drop the ball if he's carrying it. If the player's hovercraft picks up the hoverball, they must try to get to the touchdown area within four seconds or else the hoverball gets automatically fumbled. Each game is played for a duration of 500 time units and the player with the highest score when the time runs out is declared the winner.</p><p>The playfield itself presents features that can affect the way the match is played. Some playfields contain things such as jumps, spinners, and force arrows which can help or hinder a players movement. </p><p>There are a total of 12 drivers to choose from, with 4 per every speed level (slow, medium, and high).</p>"},{"name":"Space Invaders","year":1994,"developer":"Kinesoft Development Corp.","url":"5#S/Space%20Invaders%20%28NA%29.sfc","filesize":262144,"score":6.8,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>This version of <em>Space Invaders</em> is based on the 1994 arcade game Space Invaders DX but lacks the parody mode of that game. What remains is the classic mode that allows the player to choose the type of arcade cabinet (upright, black &amp; white, etc.) as background to the action as well as the versus mode for two players. The versus mode is split-screen, each player trying to survive and eliminate more invaders than the opponent.</p><p>The Game Boy version has both one- and two-player modes using the usual Game Boy tones (black and grey). However, plugging the cart into a Super Game Boy allows playing the game in all four cabinet types of the SNES version. </p><p>The PC Engine (TurboGrafx) CD version offers an additional \"cosmic versus\" mode, where the background is composed of anime-style pictures of girls. They also appear in the \"omake mode\", which is a single-player variant with the same backgrounds.</p><p>The WonderSwan version doesn't offer all four cabinet types (only black &amp; white) but keeps the versus mode.</p>"},{"name":"Space Megaforce","year":1992,"developer":"Compile","url":"5#S/Super%20Aleste%20%28English%20Translated%2C%20Rev%201.2%29.sfc","filesize":1048576,"score":8.3,"genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Compile's Aleste series lands on the SNES with the appropriately named Super Aleste. Taking the role of a lone starfighter pilot, you are tasked with destroying an evil alien armada in standard 2D shooter fashion. And while you may be alone, you certainly won't be underpowered, with eight different types of weapons, each having six power-up levels for a grand total of 48 firing modes (not counting bomb power-ups), Super Aleste boasts one of the largest arsenals in 2D shooter history.</p><p>Gameplay is single-player only with 3 difficulty levels. Also included is a short campaign with different levels that plays mostly like a \"survival\" mode with the objective being to outlast the time limit and rack the most points.</p>"},{"name":"Spanky's Quest","year":1991,"developer":"Natsume Co., Ltd."},{"name":"Sparkster","year":1994,"developer":"Konami Co., Ltd.","url":"6#Sparkster%20%28USA%29.sfc","filesize":1048576,"score":7.8,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p><em>Sparkster</em> is a 2D side-scrolling platformer starring the eponymous hero who previously appeared in Rocket Knight Adventures. It is very different from the contemporary Genesis title Sparkster, as it does not continue the story from the first game and has completely different levels, enemies and gameplay mechanics. In that way it can be considered a spin-off in the series. The introduction merely shows how an elderly man captures a girl and takes her into his airship. At that point Sparkster appears and he decides to chase them.</p><p>Sparkster is an opossum (marsupial) carrying a rocket pack on his back. He can move around, duck, jump and hang from branches or rails. His regular attack is a sword slash that sends out a circular projectile. Through the L and R buttons he can dash left and right in a circle of fire. Keeping the attack button pressed powers up a rocket meter. When full, different types or actions can be performed: dashing left, right or up to cover a large distance, ricocheting off walls in a diagonal motion, or a stationary attack.</p><p>The game consists of nine levels of which the last two can only be accessed on higher difficulty levels. Sparkster collects diamonds for points, defeats all types of robot enemies and collects apples to restore his heart meter near the top of the screen. Most of the game consists of regular platforming gameplay, with a few diversions where Sparkster rides a robot bird, or is shown from a top-down view flying in the air like a vertically-scrolling shooter. All levels have a level boss along with a large number of mid-level bosses. The game supports a password system.</p>"},{"name":"Spectre","year":1994,"developer":"Peninsula Gameworks","url":"5#S/Spectre%20%28NA%29.sfc","filesize":917504,"score":6.6,"genres":"Action > Racing / Driving > Strategy > 1st-person > Arcade > Shooter > Tank > Sci-fi / futuristic","desc":"<p><em>Spectre</em> is a 3D shooter where the player drives a little red car/tank and blasts away enemies. The gameplay is similar to Battlezone, and obviously inspired by it.</p><p>There is a selection of three tanks, each with three values (speed; armor; and firepower) balanced out to match its name: Tough Guy is heavy on armor, but slow and not very powerful; Speedy is fast, but low armor; and Balanced combines both strengths, but decreased. A fourth tank allows the player to design a custom variant.</p><p>Every level consists of a large plane filled with enemy tanks, several psychedelic walls with odd images that often flicker or warp resembling an acid trip, and tacky 3D models like windmills. The object of each level is to either destroy all the enemy tanks in the level, or to collect all the flags. Every level has a certain theme to it, anything from plain green to a colorful blinking eye or images of sand dunes are to be found on the walls, windmills and flags throughout the level.</p><p>With every passing level, enemy tanks grow smarter and their rates of fire increases. Also in later levels, new, smarter, more powerful enemy tanks join the skirmish. The player has a limited amount of ammo, but driving over ammo deposits replenishes a small amount of ammunition, as well as driving over shield deposits grants additional shields. The three different views (first, third, and top-down) allow the player to incorporate additional strategies into the battles.</p><p>The game boasts having supposedly an infinite amount of levels, though anything after level 80 is almost instant death. A high score table is also included.</p><p>An additional note-worthy feature of this game is the multi-player mode. Up to eight players are supported over IPX, or NetBios (or two via modem or serial port). The network option offers three Cyberspace Scenarios: 1. <strong>Arena</strong> - free-for-all battles, get one point for each opponent destroyed.2. <strong>Flag Rally</strong> - a match point given for collecting six flags, destroy someone to get any flags being carried.3. <strong>Base Raid</strong> - Akin to \"capture the flag\". Two teams, two bases; get match point for destroying opponent base.</p><p>The CD-ROM manual includes a \"Cyberpunk story\", to give background information on the game which consisted of a cyberjock named Hart who lived for the battles in the Arena.</p>"},{"name":"Speed Racer in My Most Dangerous Adventures","year":1994,"developer":"Radical Entertainment Inc.","url":"5#S/Speed%20Racer%20%28NA%29.sfc","filesize":2097152,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Automobile > Street racing > Licensed","desc":"<p>This game is a take on the anime cartoon series <em>Speed Racer</em>. You play as Speed, an aspiring race car driver with his trusty car, The Mach 5, along with his GO team, out to travel the world and win every international grand prix on the circuit.</p><p>Along the way, you fight off the infamous villains of the series, out to stop Speed by any means necessary, even capturing his girlfriend, Trixie. There are seven levels in all and in between racing levels you'll be on foot in side-scrolling action, fighting off thugs and gangsters, collecting power ups to help you out, including green flags in order to keep your health up.</p>"},{"name":"Speedy Gonzales in Los Gatos Bandidos","year":1994,"developer":"Sun Corporation","url":"5#S/Speedy%20Gonzales%20-%20Los%20Gatos%20Bandidos%20%28NA%20-%20Level%206-1%20Bugfix%2C%20Rev%201%29.sfc","filesize":1048576,"score":6.4,"genres":"Action > Side view > Arcade > Platform > Licensed","desc":"<p>In a small Mexican village, all the mice were enjoying a fiesta until Los Gatos Bandidos, a group of cats, came and kidnapped them all. Only Slowpoke escaped and sent for his cousin, the fastest mouse in Mexico... Speedy Gonzales! Following the trail of the Bandidos, Speedy will enter each level and try to rescue as many mice as possible while chasing after cheese and avoiding natural hazards. Ariba! Ariba!</p><p>The gameplay in Speedy Gonzales resembles the Sonic the Hedgehog series of games more than anything else. For the most part Speedy will run, run across fields and up slopes and into tunnels. There are also mousetraps which function similarly to Sonic's trampolines and will propel Speedy into the air. Speedy has a short range kick for attacking and can occasionally pick up items and use them at a later time.</p>"},{"name":"Spider-Man","year":1994,"developer":"Western Technologies Inc."},{"name":"Spider-Man / Venom: Maximum Carnage","year":1994,"developer":"Software Creations Ltd.","url":"8#Nintendo%20-%20SNES.zip/Spider-Man%20-%20Venom%20-%20Maximum%20Carnage%20%28USA%29.zip","filesize":1,"score":6.7,"genres":"Action > Beat 'em up / brawler > Fighting > Platform > Licensed","desc":"<p>Loosely based on the comic book series, the story opens as Carnage breaks out of the insane asylum and wreaks mayhem. Spiderman immediately acknowledges the new job at hand and sets out to stop him.</p><p>You start off with Spidey but in certain parts you get to choose between him and Venom, which takes you through an alternate routes. The gameplay is your standard beat-em-up, the regular punching and jump-kicking, with the addition of the all important webbing - ie web swinging, web shield etc.</p>"},{"name":"Spider-Man / X-Men: Arcade's Revenge","year":1992,"developer":"Software Creations Ltd.","url":"5#S/Spider-Man%20-%20X-Men%20-%20Arcade%27s%20Revenge%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Spider-Man and members of the X-Men have teamed up in this side-scrolling action game to fight against Arcade, who has built a giant amusement park for the sole purpose of trapping and destroying the super-heroes. You first play as Spider-Man, who sees the X-Men get kidnapped by Arcade and follows them. Once you make it inside Arcade's park you can choose to play as Spider-Man, Cyclops, Storm, Gambit, or Wolverine, each of whom are trapped in a different part of Arcade's maze of deadly traps. You must navigate all five of them safely out, using their different skills and abilities while defeating baddies and bosses along the way.</p>"},{"name":"Spindizzy Worlds","year":1992,"developer":"Arsys Software, Inc.","url":"5#S/Spindizzy%20Worlds%20%28NA%29.sfc","filesize":1048576,"score":7.8,"genres":"Action > Puzzle > Diagonal-down > Top-down > Fixed / flip-screen > Isometric > Arcade > Direct control","desc":"<p>On it's most basic level, <em>Spindizzy Worlds</em> is, like its predecessor, similar to Marble Madness. Controlling GERALD, you must move through the isometrically viewed landscape (largely flick-screen on the ST). There are two skill levels; the harder one features more of the precarious ledges and falls of <em>Spindizzy</em>. Each one takes you to a different matrix of levels, which can be played in different orders and each consist of 10 screens, with a bonus level at the end.</p><p>You have limited energy, which can be recharged by collecting crystals. Fuel is limited, and is reduced by contact with hazards - generating a replacement GERALD takes time. There are many gates which are opened by running into spaces of the same colour. There are also aliens to avoid, and most movement is along thin slippery ledges with heavily inertia-based controls.</p>"},{"name":"Spirou","year":1995,"developer":"Infogrames Europe SA"},{"name":"Sporting News Baseball, The","year":1994,"developer":"Hudson Soft Company, Ltd.","url":"5#T/The%20Sporting%20News%20Baseball%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p><em>The Sporting News Baseball</em> doesn't feature a Major League license, but does feature the MLBPA license, meaning that it features some of the best players of the time, such as Ken Griffey Jr., Daryl Strawberry and John Smoltz, to name a few. There are only three stadiums to pick from; two are generic but the other is the baseball field from the movie Field of Dreams.</p><p>There are several modes such as exhibition games, All-Star Game, the Home Run Derby, and a pennant race. The gameplay is similar to other baseball games, certain buttons to swing the bat and bunting or selecting pitches.</p>"},{"name":"Sports Illustrated: Championship Football & Baseball","year":1994,"developer":"Malibu Interactive","url":"5#S/Sports%20Illustrated%20-%20Championship%20Football%20%26%20Baseball%20%28NA%29.sfc","filesize":2097152,"score":"","genres":"Sports > 3rd-person (Other) > Isometric > Baseball > Football (American) > Licensed","desc":"<p>A sports game licensed by the leading sports magazine, Sports Illustrated. The title features both football and baseball games. Choose to play a 16-game football season, complete with 90 different offensive players and full championship setup. Or you can hit the baseball diamond, pick from 28 different teams, and obliterate the competition with a variety of pitches and exciting drives and diving catches.</p>"},{"name":"Spriggan Powered","year":1996,"developer":"Kaga Tech"},{"name":"St Andrews: Eikō to Rekishi no Old Course","year":1995,"developer":""},{"name":"Star Fox","year":1993,"developer":"Nintendo EAD","url":"8#Nintendo%20-%20SNES.zip/Star%20Fox%20%28USA%29%20%28Rev%202%29.zip","filesize":1,"score":7.9,"genres":"Action > Behind view > Arcade > Rail shooter > Space flight > Sci-fi / futuristic","desc":"<p>This is the first SNES title using the Super FX chip; you are flying ace Fox McCloud, who with his trusted wingmen and his powerful Arwing starfighter, must rid the Lylat System of the evil that surrounds it. Wave after wave of enemies will fly towards you, and with the advice of your wingmen, you must guide your way through each level and take down as many as you can.</p>"},{"name":"Star Fox: Super Weekend","year":1993,"developer":"Argonaut Games PLC"},{"name":"Star Ocean","year":1996,"developer":"tri-Ace Inc.","url":"5#S/Star%20Ocean%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":6291456,"score":7.6,"genres":"Action > Role-playing (RPG) > Top-down > Isometric > Anime / Manga > Fantasy > Sci-fi / futuristic","desc":"<p>A young boy named Ratix lives in the town Clatos on a planet with medieval culture, together with his best friends Dorn and Milly. They belong to respectable families of warriors and healers, and excel in battles kills. One day, a letter from a neighbor town arrives. A strange disease has plagued the town and its inhabitants plead the healers of Clatos to help them. Milly's father decides to go, but he himself catches the disease. The young adventurers must save Milly's father and other people at all costs. But in the beginning of their journey, they discover a crashed space ship with people who belong to a much more advanced civilization. People from two different worlds must work together to solve the grand mystery.</p><p><em>Star Ocean</em> is a Japanese-style role-playing game that contains some stand-out features, such as Approval Rating: people like or dislike each other and their behavior towards Ratix and within the party might change depending on their feelings to him and your own actions. The combat is fast-paced, real-time: the player controls Ratix, while other party members are AI-controlled. It is possible to customize combat tactics by assigning roles to the protagonist's companions, and pause the combat at any time to make strategic decisions.</p>"},{"name":"Star Trek: Deep Space Nine - Crossroads of Time","year":1995,"developer":"Novotrade Software Kft.","url":"5#S/Star%20Trek%20-%20Deep%20Space%20Nine%20-%20Crossroads%20of%20Time%20%28NA%29.sfc","filesize":1048576,"score":6.4,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic > Licensed","desc":"<p><em>\"Star Trek: Deep Space Nine - Crossroads of Time\"</em> is a 2D action game based on the famous TV series. You play Benjamin Sisko, commander of Federation space station Deep Space Nine. When the station is attacked by Bajoran terrorists, your mission to uncover their plot leads you from DS9 to Bajor, beyond the wormhole and even through time itself.</p><p>Moving through the side-scrolling environments of DS9 and other places, Sisko must complete several missions like disarming bombs or rescuing hostages. If necessary, Sisko can use a phaser to stun enemies. To solve puzzles, he can use a tricorder and other items. The plot is often carried forward by interacting with other characters from the TV series.</p>"},{"name":"Star Trek: Starfleet Academy - Starship Bridge Simulator","year":1995,"developer":"Interplay Productions, Inc.","url":"5#S/Star%20Trek%20-%20Starfleet%20Academy%20-%20Starship%20Bridge%20Simulator%20%28NA%29.sfc","filesize":1048576,"score":6.5,"genres":"Simulation > 1st-person > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Two years before the better-known computer game came this title, in which the aim is to successfully complete the space combat element of Starfleet training. You will fight Klingons, deal with repairs, and find yourself in all manner of dangerous situations, but try to stay within Starfleet directives.</p><p>The game is viewed from the bridge of your vessel (there are 5 different ones in total), with polygons used to display the action. Information on the world situation at the time of the game is supplied within the game. There are quick missions bringing scenes from Star Trek movies to life.</p>"},{"name":"Star Trek: The Next Generation - Future's Past","year":1994,"developer":"Spectrum Holobyte, Inc.","url":"5#S/Star%20Trek%20-%20The%20Next%20Generation%20-%20Future%27s%20Past%20%28NA%29.sfc","filesize":2097152,"score":7.1,"genres":"Action > 1st-person > Behind view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>The Romulans request permission to enter the Neutral Zone in order to search for a team of their researchers that they claim has gone missing. The USS Enterprise is sent to monitor their activities and find out their real motives.</p><p>Gameplay is divided into three parts: commanding the Enterprise from the bridge, controlling an away team on a planetary mission and combat with other ships.</p><p>From the bridge you can control all of the ship's main functions. <em>Conn</em>: Set course to a different planet or sector. <em>Communication</em>: Communicate with other ships. <em>Sensors</em>: Receive information on your surroundings or planets you are orbiting. <em>Computer</em>: Access a database that contains lots of information on planets, races, technology, your crew, etc. <em>Engineering</em>: If the Enterprise got damaged during combat, you can use this command to allocate resources to the different parts of the ship that need to be repaired. <em>Briefing Room</em>: Receive orders and information on your current mission. <em>Tactical</em> Station: Engage in combat. <em>Transporter</em>: Assemble an away team and beam it down to a planet (which is only possible if your current mission requires it).</p><p>Before starting an away mission, you have to assemble a team of four crew members that differ in strength and in tactical and technical ability. Some crew members also have special abilities: Dr. Crusher can heal other crew members, Geordi and Data can see in the dark and Data can survive without air. Away missions are shown from a top-down perspective and you can control each team member individually or order different members to follow your currently selected character around. Most away missions are a mixture of simple (real time) combat and puzzle solving that usually consists getting hints from tricorder readings and finding objects that have to be used in the correct way.</p><p>Ship battles are also seen from a top-down perspective and let you attack enemy ships with phasers and photon torpedoes, while keeping an eye on your shields and trying to dodge your enemy's torpedoes. If your ship is too heavily damaged, you can surrender and hope that your enemy spares you.</p><p>While the SNES and Genesis versions are essentially the same game, there are some noticeable differences. The Genesis version plays considerably faster during ship battles and on away missions as well as on the bridge (meaning it takes much less time to repair the ship). There are many graphical differences and the map layout for away missions is slightly different from the SNES version as well.</p>"},{"name":"Stargate","year":1995,"developer":"Probe Entertainment Ltd.","url":"7#Stargate%20%28Europe%29%20%5BEn%2CFr%2CDe%5D.sfc","filesize":2097152,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Licensed","desc":"<p>Based on the movie of the same name, a mystical circular portal called a \"Stargate\" has been uncovered. In attempting to unlock its secrets, its power is unlocked creating a passageway to a different world named Abydos. A special forces team is sent to the new world to investigate but is soon ambushed and its supplies taken including a powerful nuclear bomb.</p><p>As Colonel O'Neil, a variety of objectives must be met starting with the recovery of supplies and the finding of other teammates, including civilian archaeologist Daniel Jackson. Once regrouped, O'Neil must lead the attack on the god, Ra and escape back to Earth before the power of the nuclear bomb can be unleashed on this new world.</p><p>The game is a side-scroller platform adventure. The player controls O'Neil on a variety of objectives and is armed with a rifle weapon and grenades. Embarking through desert, caverns and nomad towns... eventually to the palace of Ra.</p>"},{"name":"Steel Talons","year":1993,"developer":"Atari Games Corporation"},{"name":"Sterling Sharpe: End 2 End","year":1995,"developer":"Tose Co., Ltd.","url":"5#S/Sterling%20Sharpe%20-%20End%202%20End%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Football (American) > Licensed","desc":"<p><em>End 2 End</em> is a football game with the main attraction of it being that it has the personal endorsement of former Green Bay Packer, Sterling Sharpe. Game modes consist of <em>Exhibition</em>, <em>Playoff</em> and <em>All-Star</em>, however there is no <em>Season</em> mode. The game features 30 different teams modeled after their NFL counterparts except that their nicknames and logos are absent from the game as well as their being no actual NFL players.</p>"},{"name":"Stone Protectors","year":1994,"developer":"Eurocom Developments Ltd"},{"name":"Street Combat","year":1992,"developer":"NCS Corporation","url":"5#S/Street%20Combat%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Licensed > Regional differences","desc":"<p>Street Combat is a one-on-one 2D fighting game in which several martial artists, athletes and crime-fighters from all across the globe decide to compete against each other in a street fighting tournament for fame and glory.</p><p>Single player mode allows you to choose between two versions of the \"hero\" character (Steven) and then takes you through 7 best 2-out-of-3 matches against a collection of different martial artists. A 2-player Vs mode allows you to freely select any of the characters without restrictions.</p><p>Gameplay is similar to other one-on-one beat 'em ups, in which you control your characters movements and attacks in a scrolling 2D plane attempting to defeat your opponent with special moves (triggered by specific controller motions) and avoid his attacks.</p>"},{"name":"Street Fighter Alpha 2","year":1996,"developer":"Capcom Co., Ltd.","url":"5#S/Street%20Fighter%20Alpha%202%20%28NA%29.sfc","filesize":4194304,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Direct control","desc":"<p>Another Street Fighter sequel (this time for Street Fighter Alpha) adds even more to the classic fighting series.</p><p>New characters in this version include Gen (a wise kung-fu master), Rolento (who you may remember from another Capcom classic, Final Fight) and Sakura, a young school girl who follows her hero Ryu so close, she has the same type of moves. Dhalsim and Zangief also return to the fight with some news moves.</p><p>The other major difference is the loss of chain-combos and the gain of a custom combo system. Once you reach the required level (which is 1 at the least) you can execute a custom combo by combining any of the buttons (which there are 6 in total) or any of the special attacks (fireballs, etc.)</p>"},{"name":"Street Fighter II","year":2017,"developer":"","url":"5#S/Street%20Fighter%20II%20%28NA%29.sfc","filesize":2097152,"score":"","genres":"Special edition > Physical extras","desc":"<p>The <em>30th Anniversary Edition</em> of Street Fighter II published by iam8bit is the original game on a brand-new playable SNES cartridge in a tri-fold box w/ foil, gloss and embossments. Limited to a total of 5500 copies, of which 4500 copies come in <em>Opaque Ryu Headband Red</em> and 1000 copies come in <em>Translucent, Glow-in-the-Dark Blanka Green</em>. The original manual has been worked over and includes mini posters. The tri-fold packaging doubles as a mini poster when opened up.</p>"},{"name":"Street Fighter II Turbo","year":1993,"developer":"Capcom Co., Ltd.","url":"5#S/Street%20Fighter%20II%20Turbo%20%28NA%2C%20Rev%201%29.sfc","filesize":2621440,"score":8.5,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Direct control","desc":"<p>Choose from twelve street fighters from around the world, skilled in a variety of martial arts -- for instance, a character named E.Honda is a sumo wrestler from Japan, while Ken is a master of Tae Kwon Do from the United States. Journey to different countries to defeat other fighters, eventually leading up to a battle with evil man M.Bison. Besides the standard punches and kicks, each character can also execute special moves, such as energy projectiles or lightning-fast kicks, for more damage or to create a chain of hit combos. </p><p>This installment in the Street Fighter series is essentially an upgrade to the Champion Edition game with some improvements and changes, such as new or upgraded moves, costume colors, and increased game speed.</p>"},{"name":"Street Fighter II: The World Warrior","year":1992,"developer":"Capcom Co., Ltd."},{"name":"Street Hockey '95","year":1994,"developer":"GTE Vantage Inc.","url":"5#S/Street%20Hockey%20%2795%20%28NA%29.sfc","filesize":3145728,"score":"","genres":"Action > Sports > Side view > Arcade > Hockey","desc":"<p><em>Street Hockey '95</em> is like ice hockey without ice and in urban environments with no-holds barred rules. Instead of ice skates, roller blades are used as players can pick from nine different skaters and assemble their squad in a series of game modes. There are five modes in all: Fat Point, Rush, Whack, Crammit and Hot Puck, each with their own rules, time-limit and scoring system (ex. Fat Point awards players different points by what kind of shot they scored the goal with).</p><p>There are six different environments to choose from ranging from empty swimming pools to construction sites filled with various obstacles that can stop the player dead in their tracks, but also has ramps so players can avoid the obstacles. It also features multiplayer capabilities using an adapter to allow four friends to compete head-to-head.</p>"},{"name":"Street Racer","year":1994,"developer":"Vivid Image","url":"5#S/Street%20Racer%20%28NA%29.sfc","filesize":1048576,"score":7.5,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Street Racer</em> is a kart racing game similar to Super Mario Kart.</p><p>Up to four players can play by split-screen. If there are no human opponents, the player can drive against seven computer opponents in three leagues. If the player wins the first league, they can play the second and so on. The game has eight different vehicles with different skills in speed, haste or resistance. There are also some power-ups on the tracks such as bombs, nitro fuel, and health packs.</p>"},{"name":"Strike Gunner S.T.G.","year":1992,"developer":"Athena Co., Ltd.","url":"7#Strike%20Gunner%20S.T.G%20%28USA%29.sfc","filesize":1048576,"score":5.8,"genres":"Action > Top-down > 2D scrolling > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Strike Gunner S.T.G.</em> is a vertical-scrolling jet fighter adventure set in the far-off year of A.D. 2008. The player controls their fighter as the scene unfolds around them, as enemies of air, land, and sea continuously enter the screen in wave after wave of assault. The player(s) begins with a set number of lives, a number which can be added to with good play. Run out, and your mission is over - there are no saves!</p><p>Before each level, the player chooses one special weapon that can be utilized via an often-refilled meter, in addition to their normal guns. But choose wisely, you can only use one special weapon per round, and once used, it will be unavailable to you in later rounds! Play solo or with a human wingman.</p>"},{"name":"Striker","year":1992,"developer":"Rage Software Ltd."},{"name":"Stunt Race FX","year":1994,"developer":"Nintendo EAD","url":"8#Nintendo%20-%20SNES.zip/Stunt%20Race%20FX%20%28USA%29%20%28Rev%201%29.zip","filesize":1,"score":7.4,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Thanks to an improved version of the SuperFX Chip, Stunt Race FX was the first racing game for the SNES to feature fully polygonal cars and levels, which made it possible for the game to include gradients and obstacles that could not be realized in earlier, \"flat\" racing games.</p><p>The game features four modes of play: Speed Trax is basically an arcade mode where the player has to qualify for each upcoming race by reaching checkpoints while collecting items to restore his damage- and boost-bar. It is divided into a Novice-, Expert-, and Master class, with each class featuring four unique tracks.In Stunt Trax the player has to complete courses filled with obstacles within a certain time limit while trying to collect as many stars as possible.Battle Trax is a two player mode taking place on special tracks without any CPU-controlled opponents.Finally, Test Run let's the player practice all tracks that have been unlocked.</p>"},{"name":"Sunset Riders","year":1993,"developer":"Konami Co., Ltd.","url":"6#Sunset%20Riders%20%28USA%29.sfc","filesize":1048576,"score":7.6,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Western > Regional differences","desc":"<p>The Wild West...full of the criminal element. Sir Richard Rose, the most despicable face in the criminal lot, has enough power to control the mining facilities, cattle ranches, and trading communities and turn everything to his favor. With that much power, he could literally buy himself the Wild West and control everything!</p><p>The people need help, desperately. And just as things were looking grim, who should ride into town but 4 men who have made a pact: to put down Sir Richard Rose and make the Wild West a free and peaceful place to live.</p><p>Steve, Bob, Billy, and Cormano are the Sunset Riders, and they're about to live out the wildest shootout the Wild West has ever seen...</p>"},{"name":"Super 4 in 1 Multicart","year":2013,"developer":""},{"name":"Super Adventure Island","year":1992,"developer":"Hudson Soft Company, Ltd.","url":"5#S/Super%20Adventure%20Island%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>You are a caveman named Master Higgins. You have a beautiful girlfriend, and you like spending time sunbathing together on high trees and other places on the tropic island Waku-Waku. But all of a sudden, an evil magician turns your wife into a stone! As you begin to realize what happened, a bird grasps you and throws down somewhere on the island. You have to find your way back and to save your girl from the grim reality of petrification...</p><p>This emotional drama turns out to be a rather simple platform game. The short, linear levels are all timed, so you have to hurry up and not to get delayed by the many treasures you might find on your way. You will have a weapon, your old trusty boomerang, which you will be able to upgrade during the game. After a series on levels, you will be invited to a boss battle. The sooner you complete a level, the more bonus points you get.</p>"},{"name":"Super Adventure Island II","year":1994,"developer":"Hudson Soft Company, Ltd.","url":"6#Super%20Adventure%20Island%20II%20%28USA%29.sfc","filesize":1572864,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform","desc":"<p>Master Higgins finally marries his lovely girlfriend Tina. But out of nowhere, a powerful tropical cyclone destroyed the idyllic mood of their honeymoon. And not only this: it separated the ardent lovers again. After the winds stopped blowing, Tina found herself somewhere on a tropical coast. As for Master Higgins, he went to the king of Waku-Waku and, along with his main quest to save his brand new wife, got an assignment to rescue a princess as well, whom the king was about to marry. Is there a connection between those two events?..</p><p><em>Super Adventure Island II</em> is a platform game. What distinguishes it from most other games of its type (including its own predecessor) are its light role-playing and puzzle-solving elements, comparable to those of Dragon's Trap. The player can navigate Master Higgins on his raft on the overhead map, docking at different islands. Most of these islands are inaccessible in the beginning, but as the player completes stages and receives the necessary items, new areas open up, including interconnected passages.</p><p>The islands themselves are large platform stages. Some areas are optional and contain items that permanently increase Master Higgins' health, as well as various weapons, armor, and magic abilities. Switch-manipulating and other types of puzzles must sometimes be solved to access these areas. Regular enemies drop health- and magic-restoring items, as well as coins, while boss enemies often award the player with a key item necessary to advance. Money can be spent on resting in inns, better equipment in shops, and new abilities learned at specific locations. The player can also visit a casino and gamble for money. The game can be saved anywhere, but reverts to the \"hub\" Waku-Waku island when reloaded.</p>"},{"name":"Super Air Diver","year":1993,"developer":"Copya System Ltd.","url":"7#Super%20Air%20Diver%20%28Europe%29.sfc","filesize":524288,"score":6.7,"genres":"Action > Behind view > Arcade > Shooter > Flight / aviation","desc":"<p><em>Lock On</em> is a jet fighter game that has the classic one man vs. the forces of evil formula. After a vicious warlord threatens the nations of the world, the United Nations have recruited a hot shot ace pilot by the name of Jake Steel to go after the madman and bring peace back to the world.</p><p>The player will partake in a variety of missions against both air and ground forces and can fly in four different aircraft (the British made Tornado, the Japanese FSX, the A-10 Warthog and the F-14 Tomcat). The player can use each jets strengths to their advantage along with their powerful weaponry such as Vulcan cannons and heat seeking missiles against enemy jet fighters, tanks and other various enemies scattered throughout each mission.</p>"},{"name":"Super Alfred Chicken","year":1994,"developer":"Twilight","url":"5#S/Super%20Alfred%20Chicken%20%28NA%29.sfc","filesize":1048576,"score":7,"genres":"Action > Side view > Platform","desc":"<p><em>Super Alfred Chicken</em> is a side-scrolling platformer. The evil Meca Chickens want to produce a super army by cloning Alfred's friends. Of course Alfred has to stop them now.</p><p>The gameplay follows the genre standards: Alfred walks through the 21 levels and needs to avoid enemies/obstacles by jumping over them. Every contact with enemies is deadly except when using Alfred's dive bomb attack. Occasionally there are simple switch puzzles to solve, mostly in order to find secret rooms with goodies. Examples for power-ups are hidden watering cans (collecting all unlocks a different ending), additional time, temporary invincibility or diamonds (100 reward an extra life). Balloons on the way act as restarting points after death. In some instances, the level ends with a boss fight.</p>"},{"name":"Super Aquatic Games, The","year":1993,"developer":"Millennium Interactive Ltd.","url":"5#T/The%20Super%20Aquatic%20Games%2C%20Starring%20the%20Aquabats%20%28NA%29.sfc","filesize":524288,"score":6.6,"genres":"Sports > Side view > 2D scrolling > Arcade > Olympiad / mixed sports","desc":"<p><em>The Super Aquatic Games</em> was conceived partly as an Olympics tie-in, and partly as a stop-gap for James Pond fans (the third platform title in the series (Operation Starfish) was in the process of being heavily delayed, eventually being released in 1994). This game saw Pond and friends competing in the underwater Olympics.</p><p>The events take the form of various mini-games, usually in the same vein as Hyper Sports, but with an aquatic theme and the humour seen in the <em>James Pond series</em> (e.g. The 100 Metre Splash). More unusual mini-games include Kipper Watching, which involves 'heading' incoming beach balls away from a troop of sleeping seals, and Gymnastics. Events can be played with up to 4 players.</p>"},{"name":"Super Back to the Future Part II","year":1993,"developer":"Toshiba-EMI Ltd."},{"name":"Super Baseball 2020","year":1993,"developer":"SNK Corporation"},{"name":"Super Baseball Simulator 1.000","year":1991,"developer":"Culture Brain Inc.","url":"5#S/Super%20Baseball%20Simulator%201.000%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Sports > Arcade > Baseball","desc":"<p>I slight upgrade to the NES release that retains the fun factor of the original while adding a few select updates and additions. The graphics have been improved, but not substantially. The special hits and pitches have been tweaked with new ones added and old ones dropped.</p>"},{"name":"Super Bases Loaded","year":1991,"developer":"Tose Co., Ltd.","url":"5#S/Super%20Bases%20Loaded%20%28NA%29.sfc","filesize":1048576,"score":6.7,"genres":"Sports > 3rd-person (Other) > Direct control > Baseball > Licensed","desc":"<p>Another baseball game in the Bases Loaded series. The game features a 1 and 2 player game plus a watch mode that allows the player to watch two computer players play each other.</p><p>During the 1 player game the player selects 1 of 13 fictional teams and plays the other 12 teams in a row. The overall goal, instead of just merely winning baseball games, is to play the perfect game and get a perfect rating. During a game, players start with an overall rating of a 100, and then after the game is finished game points are added or subtracted in 13 different rated categories such as number of errors made, the number of walks, pitched, number of times struck out, etc... The players final game points determines the difficulty level of their next opponent. The game has up to 5 difficulty rankings. Scoring a perfect 100 game points on a level 5 rated team will complete the game.</p><p>Both pitching and hitting are done from a behind the pitcher viewpoint and players can select whether to turn the designated hitter rule on or off.</p><p>The game also has an option to edit players.</p>"},{"name":"Super Bases Loaded 2","year":1994,"developer":"Jaleco Ltd.","url":"5#S/Super%20Bases%20Loaded%202%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Sports > 3rd-person (Other) > Baseball","desc":"<p><em>Super Bases Loaded 2</em> is the 16-bit remake of the original NES versions. It features the modes <em>Exhibition</em>, <em>Season</em>, and <em>All Star</em> and features a battery backup that will allow the player to keep track of stats and resume play at their own leisure.</p><p>The game also allows the player to create their own team and use them in either exhibition or season mode. It does feature a full 162-game season, but does not feature any MLB license, instead it consists of two fantasy leagues with seven teams to each league, along with three generic stadiums. The DSP chip is also utilized to give's the appearance of realistic 3D movement of the players.</p>"},{"name":"Super Bases Loaded 3: License to Steal","year":1995,"developer":"Jaleco Ltd.","url":"5#S/Super%20Bases%20Loaded%203%20-%20License%20to%20Steal%20%28NA%29.sfc","filesize":2097152,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p><em>Super Bases Loaded 3</em> is the follow-up to Super Bases Loaded 2 which includes updated stats of over 700 actual MLBPA players including Barry Bonds, Kirby Puckett and Terry Gwynn, just to name a few. The modes of play include the standard <em>Exhibition</em> and <em>Season</em>, but also include a <em>Championship Tournament</em> and an <em>MVP Game</em>. However, since there is no MLB license, there are no team nicknames or logos, and also no World Series is included in the game. The game only contains three generic stadiums. A battery back-up is present that allows players to save games.</p>"},{"name":"Super Batter Up","year":1992,"developer":"Namco Limited","url":"5#S/Super%20Batter%20Up%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Diagonal-down > Direct control > Baseball > Licensed","desc":"<p><em>Super Batter Up</em> is a baseball game with both a 1 and 2 player mode plus a league mode. The game carries the MLBPA license, but not an MLB license, so it only features all the players from the 1991 season playing for a team in a city that they really play for. Players get to play in either a dome, modern, or traditional stadium each with their own unique characteristics.</p><p>The 1 and 2 player mode lets the player play an exhibition game against the computer or another player. League mode lets the player play through a season of games against computer controlled teams.</p><p>Pitching and batting are done from a behind the batter viewpoint. When batting players can sub in a pinch hitter and when on base, a pinch runner, and when pitching can call in a relief pitcher from the bullpen. </p><p>Game options include setting the number of innings (1, 3, 5, 7, or 9), turning errors on or off, and turning the called game option on or off.</p>"},{"name":"Super Battleship: The Classic Naval Combat Game","year":1993,"developer":"Synergistic Software, Inc.","url":"5#S/Super%20Battleship%20%28NA%29.sfc","filesize":524288,"score":5.3,"genres":"Action > Strategy > 1st-person > Side view > Top-down > Turn-based > Board game > Direct control > Naval / watercraft > Licensed","desc":"<p>This game features two different modes of play: Classic Battleship and Super Battleship.</p><p>Classic Battleship is the typical Battleship game where the players set up their ships on a grid, then take turns choosing 3 places at a time to target and hope they hit the opposing players ship. The game ends when all the opposing players ships are sunk. This mode contains four difficulty levels: Ensign, Lieutenant, Commander, and Admiral.</p><p>Super Battleship involves eight levels consisting of sixteen missions total. Missions include sinking enemy ships in a certain number of rounds, escorting ships to their destinations, defending cities from attack, and destroying enemy airfields. Gameplay consists of a turn-based moving of ships utilizing an overhead view. The player can then target any enemy units within the ship's range and attack. Attacking brings up an action sequence where both ships trade volleys of gunfire until one of them either sinks or retreats.</p>"},{"name":"Super Battletank 2","year":1994,"developer":"Absolute Entertainment, Inc.","url":"7#Super%20Battletank%202%20%28Europe%29.sfc","filesize":2097152,"score":7,"genres":"Action > Simulation > 1st-person > Tank","desc":"<p>In this sequel to Super Battletank, the player takes control of the feared M1A2 Battletank in 16 missions centered in the Middle East. After they are attacked by an unknown group of enemies on both land and air, the player is tasked to root out these enemies and stop any further attacks on Coalition forces.</p><p>Much like its predecessor, the gameplay is a first-person tank simulation, using radar to scout out enemy tanks and using the main turret gun to disable and kill any opposing tanks, jeeps, APCs and various other heavy weapons including SCUD missiles. If the player encounters and air resistance, they can mount their Phalanx machine gun to cut down enemy choppers.</p><p>Players also have smoke screens that can temporarily make them unseen to any enemy forces, plus they can call in supply drops to replenish their armor and ammo as well as air support that can level any opposing force in their wake.</p>"},{"name":"Super Black Bass","year":1992,"developer":"Hot-B Co., Ltd.","url":"5#S/Super%20Black%20Bass%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > 1st-person > Behind view > Fishing","desc":"<p><em>Super Black Bass</em> is a bass fishing game where players can compete in four different lake tournaments. Player can fish in: <em>Skywater Lake (Local Amateur)</em>, <em>Clear Lake (Amateur)</em>, <em>Murphy Lake (Pro)</em> and <em>Bluestone Lake (Super Bass)</em>, the goal of which is to catch a certain weight limit of bass before a certain time limit.</p><p>There are two screens, the boating screen where players navigate a lake using the D-Pad to navigate, the \"A\" button for acceleration and the \"B\" button for reverse. The \"Y\" button is used to enter the fishing screen. There is also a fish finder on the lower part of the screen that helps the player in locating a good place to fish.</p><p>When the player enters the \"fishing screen\", they can use the \"L &amp; R\" shoulder buttons to increase the distance meter, the \"X\" button brings up the lure selection screen, the \"B\" button can bring an overhead view of the location the player currently has the lure set for and the \"Y\" button brings the player back to the \"boat mode\". To cast, the player presses the \"A\" button once to start the cast meter and a pressing it again when the meter is set at a certain limit to cast it.</p><p>While fishing, the player will have an overhead top-down mode of the lake, using the \"A\" button to reel in their lure and using the D-Pad to manipulate movement of the lure. Fish can be seen through the water, outlined in a light color while bigger fish are seen stationary and cast in a dark shadow. Once the player hooks the fish, a meter will show up at the bottom, showing the tension of the line, when it hits to the far right of the meter, the line will snap. The line can also be manually cut by pressing the \"A+B\" buttons together.</p><p>There are eight different lures to choose from (Pencil Bait, Torpedo, Jitterbug, Frog, Crankbait, Spoon, Furry Sinker &amp; Plastic Worm) along with several different color variations to choose from and five fish to catch (Blue Gill, Rainbow Trout, Catfish, Northern Pike and the game's namesake, Bass).</p><p>There are also attributes the player can have, Technique and Strength, that can be upgraded by catching more bass and progress can be kept through a password feature.</p>"},{"name":"Super Bomberman","year":1993,"developer":"Hudson Soft Company, Ltd.","url":"6#Super%20Bomberman%20%28USA%29.sfc","filesize":524288,"score":7.8,"genres":"Action > Top-down > Fixed / flip-screen > Anime / Manga > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>Super Bomberman is the first Bomberman game on the Super NES.  Like most games in the Bomberman series, Super Bomberman features a normal game as well as the famous battle mode.</p><p>In the normal game, Mr. Karat and Dr. Mukk have been terrorizing Diamond City.  You must go from board to board, defeating the bad guys and solving puzzles to move to the next board.</p><p>In battle mode, up to four players go head to head in a battle to the death.  Players can be computer controlled or human controlled via the Super MultiTap.</p>"},{"name":"Super Bomberman 2","year":1994,"developer":"Hudson Soft Company, Ltd.","url":"5#S/Super%20Bomberman%202%20%28NA%29.sfc","filesize":1048576,"score":8.1,"genres":"Action > Top-down > 2D scrolling > Anime / Manga > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>This is the second game in the Bomberman series for the Super Nintendo.  This game is much like the first in gameplay but has new levels and a new story to play though.</p><p>The graphics are slightly different from the first game but in general the game holds most of the same style as the first.  There are a few new features such as colour coded bomb blasts and a few different powerups but other than that the second game is the same as the first.</p>"},{"name":"Super Bomberman 3","year":1995,"developer":"Hudson Soft Company, Ltd.","url":"5#S/Super%20Bomberman%203%20%28NTSC%20Conversion%29.sfc","filesize":1572864,"score":8,"genres":"Action > Top-down > Fixed / flip-screen > Anime / Manga > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>The third bomberman game in the SNES series.  This game was an overhaul of the entire system of bombermans from before.  Again there are new levels and a new story but there are also a lot of new features.</p><p>Super Bomberman 3 adds in 5 player support using a multitap and the extra controller slot.  The \"revenge\" or \"miso bomber\" feature was introduced in this game.  That is when a player dies they can still throw bombs in from the sidelines in an attempt to swap places with a player that is still alive.  Many new powerups were added in this game including the Kangaroo which in addition to giving a player and extra hit allowed them to have some extra ablity including jumping, laying rows of bombs, and high speed running.</p><p>Players are also not limited to the traditional Bomberman.  There is a wide selection of different characters that the player can choose from.</p>"},{"name":"Super Bomberman 4","year":1996,"developer":"Produce Co., Ltd.","url":"5#S/Super%20Bomberman%204%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":2097152,"score":"","genres":"Action > Top-down > Anime / Manga > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>The fourth addition to the Bomberman series for the SNES.  This game is almost identical to Super Bomberman 3 only with new levels and a new story.</p><p>A small twist in this game is that instead of choosing the traditional bomberman or a country specific character players get to choose between bosses from the previous game when playing battle mode.  Each character has a special power from a jet pack to throwing abilities.</p>"},{"name":"Super Bomberman 5","year":1997,"developer":"Hudson Soft Company, Ltd.","url":"5#S/Super%20Bomberman%205%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":2097152,"score":7.8,"genres":"Action > Top-down > Fixed / flip-screen > Anime / Manga > Arcade > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>The fifth and final Bomberman released for the SNES (so far).  This game is very similar to Super Bomberman 3 and 4.  Again there is a new story and new battle arenas but other than that it is the same game.  Players choose between the bosses of the story game levels in battle games like in Super Bomberman 4 yet they have not special powers this time around.</p>"},{"name":"Super Bomberman: Panic Bomber W","year":1995,"developer":"Raizing Co., Ltd."},{"name":"Super Bonk","year":1994,"developer":"A.I Co., Ltd.","url":"5#S/Super%20Bonk%20%28NA%29.sfc","filesize":1572864,"score":7.4,"genres":"Action > Side view > 2D scrolling > Arcade > Platform","desc":"<p>The fourth game in the regular \"Bonk\" caveman series, Bonk is back on his first Super Nintendo outing.</p><p>In this side-scrolling platformer adventure, the gameplay is similar to Bonk 3. Super Bonk allows Bonk to travel through time from his prehistoric levels, the insides of a dinosaur, a version of modern Chinatown, and even the moon!  Along the way, Bonk can find power-ups that can change his form to creatures such as a shooting Bonk crab, a dinosaur form called \"Big Kronk\", find candies that change his size from tiny to huge, travel through transportation tubes, and find multiple bonus levels.</p><p>Bonk still uses his head to smash his enemies, propeller seeds that allow Bonk to fly, and for the first time, can carry spring flowers on his head in his continuing battle against his arch nemesis, King Drool!</p>"},{"name":"Super Bowling","year":1992,"developer":"KID Corp.","url":"5#S/Super%20Bowling%20%28NA%29.sfc","filesize":524288,"score":6.8,"genres":"Sports > 3rd-person (Other) > Bowling","desc":"<p><em>Super Bowling</em> is a bowling game for up to four players.</p><p>Three different game modes are available: Turkey Bowl is standard 10-frame bowling. Golf Mode features nine different \"holes\" (pin setups) and a par number for each, with scoring depending on number of throws needed to knock over all pins compared to par. Finally, Practice Mode allows setting up any number of pin combinations for practicing.</p><p>Before a round, the players can choose from four different characters that each differ in spin control and power. Customizable options then include left-or right-handedness, ball weight, lane oil distance, and difficulty (normal or hard).</p><p>During a round, players can set up player position and aim. After locking those in, the spin meter appears, with a bowling ball moving from left to right and back, with the ideal spin position in the center. Stopping it sets the spin, which makes the player start their run and has the power meter appear, which works like the spin meter: for maximum power, the meter must be stopped in the center.</p>"},{"name":"Super Buster Bros.","year":1992,"developer":"Mitchell Corporation","url":"5#S/Super%20Buster%20Bros.%20%28NA%2C%20Rev%201%29.sfc","filesize":524288,"score":7.1,"genres":"Action > Side view > Fixed / flip-screen > Arcade > Platform > Shooter","desc":"<p><em>Super Bust Bros.</em> is an adventure for one or two players that takes the player around the world, aiming to rid the planet of a terrible foe: seemingly innocuous-looking bubbles. The main portion of the game is Tour mode, where the player visits a series of different levels representing different countries of the world. Each player's character is armed with a gun, which shoots a vertical cable. If this hits a bubble, it will cause it to split in two. Upgrades allow two cables to be shot at once, or the ability to stick a cable to the ceiling where it will cling for a few seconds, bursting any bubble that hits it.</p><p>Players must clear each screen of bubbles before progressing to the next one. The largest bubbles will have 4 degrees of splitting before clearing. Many level layouts have ladders, barriers and breakable bricks in part of the screen, affecting movement of both the player and the bubbles. Faster bubbles in the shape of diamonds also bounce around the screen going any which way rather than bouncing in predictable arcs like the other bubbles.</p><p>Several power-up tokens are also available, offering features such as splitting all bubbles down to their minimal size, freezing the bubbles for a few seconds, and various different weapons. Monsters also enter the screen periodically, which hit the bubbles and take them down a size, and can often be directed by the cable weapon.</p><p>In addition to the main Tour mode, the game also features Panic mode, in which a succession of bubbles are thrown at at the players. As the player progresses, the amount of bubbles required to reach the next level also increases, similar to scoring on Tetris.</p>"},{"name":"Super Caesars Palace","year":1993,"developer":"The Illusions Gaming Company","url":"5#S/Super%20Caesars%20Palace%20%28NA%29.sfc","filesize":524288,"score":6.6,"genres":"Gambling > 1st-person > Diagonal-down > Fixed / flip-screen > Cards / tiles > Direct control > Licensed","desc":"<p><em>Super Caesars Palace</em> is the upgraded sequel to the original Caesars Palace for the NES. This version features nine different games to choose from: Blackjack, Keno, Roulette, Scratchers, Horse Racing, Red Dog, Craps, Video Poker and Slot Machines, each with their own degree of difficulty and strategy.</p><p>Once a player reaches a sufficient amount of funds, they can then go to the V.I.P. room and play more high stakes versions of these games to either win big or lose big. To add more realism, the player can also visit ATMs to draw more cash for playing in case they are running low on on-hand cash. It also has a password feature that will allow the player to pick up and continue their game at a later time.</p>"},{"name":"Super Castlevania IV","year":1991,"developer":"Konami Co., Ltd.","url":"7#Super%20Castlevania%20IV%20%28Europe%29.sfc","filesize":1048576,"score":8.4,"genres":"Action > Side view > 2D scrolling > Platform > Fantasy > Horror > Regional differences","desc":"<p><em>Super Castlevania IV</em> is, story-wise, a remake of the first game in the series. Set in the year 1691, the game casts the player in the role of Simon Belmont, a vampire hunter armed with a powerful whip, on a quest to defeat the evil Count Dracula in his castle. Despite the identical plot, the six castle stages have different layouts and themes; also, five initial stages that depict Simon's advancement towards the castle through various environments have been added.</p><p>The gameplay consists of traversing timed, linear platform stages, defeating enemies with the whip or sub-weapons that require collecting hearts and can be found by destroying parts of the scenery. Simon's stand-out ability in this installment are eight-directional attacks with his whip, which allow him, among others, to damage enemies standing below and above him. Holding out the whip will block enemy attacks. Simon can also latch his whip on special grappling points to swing over pits and obstacles. Game progression is saved by passwords given to the player after a stage has been completed.</p><p>Visually, the game uses hardware \"Mode 7\" effects such as parallax scrolling, rotating rooms, and pseudo-3D objects in some locations.</p>"},{"name":"Super Chase HQ","year":1993,"developer":"Taito Corporation","url":"5#S/Super%20Chase%20H.Q.%20%28NA%29.sfc","filesize":1048576,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > Automobile > Crime","desc":"<p><em>Super Chase: Criminal Termination</em> is an enhanced sequel to Chase H.Q. As usual, you must drive your way towards a criminal's vehicle, which is known to be involved in some crime, while avoiding passing cars to gain points. Your car also comes equipped with three turbos, which can be useful if you are way behind the vehicle.</p><p>But this time, cars aren't just the only things that you have to worry about. You will also encounter bikes that shoot or throw firebombs at you, as well as cars that go the wrong way. (If you crash into one of these, you'll be sent flying through the air.) Not to mention other obstacles such as barricades.</p><p>Furthermore, as well as the criminal's damage indicator, you also have your own. When you finally catch up with each criminal, they are likely to shoot at you if you get too close to their vehicle, but you may encounter criminals who have different ways of attacking you. The fourth criminal, for example, launches a missile at you if you are further behind him. Once you are shot at and hit, your indicator decreases for every time you are hit, but this rule does not apply when you're hit by passing cars. When your indicator is empty or when you're out of time, the game ends.</p><p>When you complete each round, a statistics screen will appear, and you are awarded points based on the time remaining, how much damage you've done, and the number of nitros that are used. One of the options allow you to display the game's speedometer in either MPH or Km/h. The game also has a storyline, which can be viewed in between rounds.</p>"},{"name":"Super Chinese World 2: Uchū Ichibuto Daikai","year":1993,"developer":"Culture Brain Inc."},{"name":"Super Chinese World 3","year":1995,"developer":"Culture Brain Inc."},{"name":"Super Conflict","year":1993,"developer":"Manley & Associates, Inc.","url":"7#Super%20Conflict%20%28Europe%29.sfc","filesize":1048576,"score":7.3,"genres":"Simulation > Top-down > Naval / watercraft > Tank","desc":"<p>Super Conflict is a strategy game that compares itself to a game of chess: there are two sides (Blue or Red) who must destroy the opposing force's Flag Unit. (In the fifth skill level, there is also a Flag Ship, and the game is lost if either one is destroyed.) Scenarios are laid on on a hexagonal grid, and each space has its own terrain type and can be occupied by one unit. You move your units around and attack enemy units in adjacent hexagons. There are also cities, airports, and shipyards, which you can occupy and use for your own purposes (ie. to repair a unit). Depending on the skill level or scenario you can also construct factories to produce additional units.</p>"},{"name":"Super Dany","year":1994,"developer":"Cryo Interactive Entertainment"},{"name":"Super Double Dragon","year":1992,"developer":"Technos Japan Corp.","url":"8#Nintendo%20-%20SNES.zip/Super%20Double%20Dragon%20%28USA%29.zip","filesize":1,"score":6.9,"genres":"Action > Side view > 2D scrolling > Arcade > Beat 'em up / brawler","desc":"<p>Billy and Jimmy Lee return for another adventure. This time, fellow martial arts instructor and narcotics investigator, Marian, has disappeared while attempting to infiltrate the ruthless criminal mob known as the Black Shadow Warriors.</p><p>Once again it is up to you (and a friend) to battle your way through a selection of side-scrolling beat 'em up levels to defeat the Shadow Warriors and their leader Duke, and save Marian.</p>"},{"name":"Super Dropzone: Intergalactic Rescue Mission","year":1994,"developer":"Eurocom Developments Ltd"},{"name":"Super Famicom Wars","year":1998,"developer":"Intelligent Systems Co., Ltd."},{"name":"Super Final Match Tennis","year":1994,"developer":"Human Entertainment, Inc."},{"name":"Super Fire Pro Wrestling Queen's Special","year":1995,"developer":"Human Entertainment, Inc.","url":"5#S/Super%20Fire%20Pro%20Wrestling%20-%20Queen%27s%20Special%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":3145728,"score":"","genres":"Sports > Isometric > Fighting > Wrestling > Martial arts > Licensed","desc":"<p>Long before the WWE introduced the <em>Divas</em> wrestling matches, in Japan there was a more serious affair, where wrestling skill was more important than breast implants, and matches were \"real\" (as far as wrestling goes) instead of pillow-fighting or bra and panties fights.</p><p>In this game in the Fire Pro Series, the cast of the All Japan Women's Pro-Wrestling promotion are available, all fighting to win the Red belt, the highest prize of the federation. It's also possible to fight in single matches, tournaments, Battle Royal and Elimination matches. The usual array of options in CAW is present, being possible to create 16 new Wrestlers.</p><p>Gameplay, as usual is the series, is dramatically different than in most western games. Each wrestler has a bunch of moves, ranked from weak to strong. While it's possible to connect any of them from open situations, while grappling only when the opponent is already beaten the most powerful moves can be successfully used.</p>"},{"name":"Super Fire Pro Wrestling X Premium","year":1996,"developer":"Human Entertainment, Inc.","url":"5#S/Super%20Fire%20Pro%20Wrestling%20X%20Premium%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":4194304,"score":"","genres":"Sports > Isometric > Fighting > Wrestling > Martial arts","desc":"<p>In this final appearance of Fire Pro series on 16-bit consoles, the usual roster of over 150 wrestlers from several wresting promotions worldwide including several styles from Shoot or Pancrase to American and Lucha are joined by 80 Create-a-wrestler slots, plus secret wrestlers such as legends Gotch or Thesz or the roster of Blazing Tornado. While all fighters have fictional names, a lot of them are perfectly recognizable by their attire, stance and style. The CAW mode allows the player to create a wrestler from scratch, setting how they look (choosing face, size, clothing and setting colours) and fight, with several styles and stances available, as well as over 500 moves, each more suitable for certain styles and skills. To make them fight more realistically when controlled by the AI, the CAW mode also allows one to set move priorities.</p><p>Five game modes are available, including World Championship (single and tag), Battle Royale, 5-man Elimination Mode, League Battle and the One Night Dream Match. There are several referees available (each with their own quirks) and variant rules, from allowing fighting outside the ring without count-out (or disallowing it) to the disabling of disqualifications from illegal moves.</p>"},{"name":"Super Flappy Bird","year":2017,"developer":""},{"name":"Super Formation Soccer 95: della Serie A","year":1995,"developer":"Human Entertainment, Inc."},{"name":"Super Formation Soccer II","year":1993,"developer":"Human Entertainment, Inc."},{"name":"Super Ghouls 'N Ghosts","year":1991,"developer":"Capcom Co., Ltd.","url":"6#Super%20Ghouls%27n%20Ghosts%20%28USA%29.sfc","filesize":1048576,"score":8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Direct control > Fantasy > Horror","desc":"<p>4 years after Arthur saved Princess PrinPrin from the evil demon Loki, a wonderful celebration is about to take place! Arthur and the Princess are engaged, and the wedding is to take place at last! Thousands from around the kingdom have come to witness this joyous event!</p><p>But somewhere in the darkness of the forest lurks a horrible evil...</p><p>Arthur and PrinPrin are spending a quiet moment locked in embrace, when she is suddenly snatched away by a huge demon! As her screams echo through the night, Arthur rushes from the castle, and pursues the demon to the graveyard, where he is greeted by hundreds of horrible ghouls and monsters!</p><p>Now, this time, they've gone too far...Arthur is ready for them...</p>"},{"name":"Super Goal! 2","year":1993,"developer":"Tose Co., Ltd.","url":"5#S/Super%20Goal%21%202%20%28NA%29.sfc","filesize":524288,"score":7.2,"genres":"Simulation > Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p><em>Super Goal! 2</em> is a soccer game with the two game modes: <em>Tournament</em> and <em>Exhibition</em>, that can support two simultaneous players for one on one action, and has 20 International teams to choose from including Germany, Brazil, Argentina and U.S.A. just to name a few along with players modeled after their real-life counterparts.</p><p>Players can customize each game to their liking including rule set-ups, stadiums, team formations and including the soccer ball design. It features real-life rules and regulations and soccer moves including bicycle kicks and slide tackles. It also has a password feature for player's to pick up and play at their leisure.</p>"},{"name":"Super Godzilla","year":1993,"developer":"Advance Communication Company","url":"7#Super%20Godzilla%20%28USA%29.sfc","filesize":1572864,"score":5.6,"genres":"Action > Strategy > Side view > Top-down > 2D scrolling > Fighting > Sci-fi / futuristic > Licensed","desc":"<p><em>Super Godzilla</em> is a 16-bit Godzilla game where the player can take control of Toho's famous big green lizard as they rampage through Japan. The game is divided into two main gameplay modes, <em>Movement</em> and Battle. <em>Movement</em> has the player travel through the city using the D-pad and a map located on the bottom of the screen with the objective being to destroy certain objectives such as enemy humans and buildings as well as pick up power-ups. There is an animation in the screen above the map that shows the results of their movements and attacks.</p><p><em>Battle</em> mode kicks in when the player locates an enemy on the map, like Biollante or Mechagodzilla, and is taken to a side-scrolling cinematic-style battle where the player must use punches, tail whips and the famous fire breath to drain the energy of the opposing monster. However, the <em>Fighting Spirit</em> system is present which is in a sense a morality meter where the player must pick the right attacks at the right time in order to connect certain attacks. Choosing the wrong attacks or failing to connect with them will cause the meter to drop and make Godzilla more vulnerable to attack.</p>"},{"name":"Super High Impact","year":1993,"developer":"Midway Manufacturing Company"},{"name":"Super Ice Hockey","year":1994,"developer":"Opera House Inc."},{"name":"Super International Cricket","year":1995,"developer":"Beam Software Pty., Ltd."},{"name":"Super Kick Off","year":1992,"developer":"Enigma Variations Ltd."},{"name":"Super Loopz","year":1994,"developer":"Audiogenic Software Ltd."},{"name":"Super Mahjong Taikai","year":1992,"developer":"Chat Noir Co., Ltd."},{"name":"Super Mario All-Stars","year":1993,"developer":"Nintendo Co., Ltd.","url":"5#S/Super%20Mario%20All-Stars%20%28NA%29.sfc","filesize":2097152,"score":8.7,"genres":"Action > Compilation > Side view > 2D scrolling > Platform > Direct control","desc":"<p><em>Super Mario All-Stars</em> is a collection of previously released Super Mario NES platform games. Each title is presented with its original gameplay and level design but has been given a makeover in the graphics and sound department. A save option has been added allowing players to store the session data.</p><p>Included in <em>Super Mario All-Stars</em> are the following games:</p><ul><li>Super Mario Bros.: Mario and Luigi must rescue the Princess and the Mushroom Retainers from the evil King Bowser.</li><li>Super Mario Bros.: The Lost Levels: known as <em>Super Mario Bros. 2</em> in Japan, this game features the same style of gameplay as the original <em>Super Mario Bros</em>. The game contains poison mushrooms, which will shrink or kill Mario, and new and old enemies, such as Flying Bloopers.</li><li>Super Mario Bros. 2: also known as <em>Super Mario USA</em> in Japan, Mario and friends discover a mysterious land, called Subcon, that is being destroyed by Wart and his minions. They must rescue this strange land from the tyrant.</li><li>Super Mario Bros. 3: Bowser, with the help of his Koopalings, takes over the Mushroom Kingdom's 7 lands and turns their kings into creatures. It's now up to Mario and Luigi to save the Mushroom Kingdom</li></ul>"},{"name":"Super Mario All-Stars + Super Mario World","year":1994,"developer":"Nintendo Co., Ltd.","url":"6#Super%20Mario%20All-Stars%20%2B%20Super%20Mario%20World%20%28USA%29.sfc","filesize":2621440,"score":8.5,"genres":"Compilation","desc":"<p>Put quite simply, this is the amalgamation of the previously released Super Mario All-Stars compilation with Super Mario World added. While games already in the All-Stars bundle have major graphical and audio improvements, the only change made to <em>Super Mario World</em> is a slight tweak of Luigi's graphic sprites, making him slightly thinner and taller (rather than being the same height and stature of Mario) which does not affect gameplay.</p><p>Altogether the following games are included:</p><ul><li>Super Mario Bros.</li><li>Super Mario Bros.: The Lost Levels</li><li>Super Mario Bros. 2</li><li>Super Mario Bros. 3</li><li>Super Mario World</li></ul><p><em>Super Mario All-Stars + Super Mario World</em> could only be found in \"Mario Set\" bundled edition of the Super Nintendo console.</p>"},{"name":"Super Mario Kart","year":1992,"developer":"Nintendo EAD","url":"6#Super%20Mario%20Kart%20%28USA%29.sfc","filesize":524288,"score":8.3,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Track racing > Fantasy > Regional differences","desc":"<p>A collection of Super Mario characters, including Mario, Luigi, Yoshi, Peach, Bowser and Donkey Kong Jr., are out to win the Super Mario Kart championship. Using Mode 7 scaling, the first true kart game on the SNES has you collecting coins to boost your speed while using shells and bananas to stop others on the track. </p><p>There are 4 cups in all to race for, Mushroom Cup, Flower Cup, Star Cup and Special Cup, each with a selection of tracks to race on (based in Bowser's Castle, Super Mario World and more). Plus, a 2 player battle mode is on offer, where the first to pop the three balloons wins.</p>"},{"name":"Super Mario RPG: Legend of the Seven Stars","year":1996,"developer":"Square Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Super%20Mario%20RPG%20-%20Legend%20of%20the%20Seven%20Stars%20%28USA%29.zip","filesize":1,"score":8.4,"genres":"Action > Role-playing (RPG) > Diagonal-down > Isometric > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Regional differences","desc":"<p><em>Super Mario RPG</em> is a console RPG starring none other than Nintendo's popular character Mario. This game starts off like almost every other Mario game, with Bowser kidnapping Princess Toadstool. However, when Mario goes to Bowser's Keep to save her, a giant sword made by the evil Smithy crashes into the castle and sends Mario, the Princess, and Bowser flying to separate parts of the world.</p><p>The game plays much like a traditional RPG: Mario and the members of his party gain experience points by defeating enemies. These experience points can increase the team's maximum number of hit points and flower points (magic points). The battles are also turn-based, but this time there are timed attacks and defenses. Timed attacks allow you to inflict more harm than normal to an enemy. Timed defenses, on the other hand, allow an enemy to inflict less harm than normal. You are only allowed to have three out of five team members on your party at a time. Mario is always in your party, regardless. Your team members can also purchase more weapons and abilities, along with better armor.</p>"},{"name":"Super Mario World","year":1990,"developer":"Nintendo Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Super%20Mario%20World%20%28USA%29.zip","filesize":1,"score":8.6,"genres":"Action > Side view > 2D scrolling > Platform > Direct control > Regional differences","desc":"<p>Mario is having a vacation in Dinosaur Land when he learns that Princess Peach Toadstool has been kidnapped by the evil King Koopa Bowser. When Mario starts searching for her he finds a giant egg with a dinosaur named Yoshi hatching out of it. Yoshi tells Mario that his fellow dinosaurs have been imprisoned in eggs by Bowser's underlings. The intrepid plumber has to travel to their castles, rescue the dinosaurs, and eventually face King Koopa himself, forcing him to release the princess.</p><p><em>Super Mario World</em> is a jump-and-run platformer and a follow-up to Super Mario Bros. 3. The gameplay is similar to previous installments and includes fast-paced platforming in (mostly) side-view stages populated by various enemies and traps, which must be completed within time limits. Mario has access to his traditional power-ups — the Super Mushroom that makes him bigger, the Fire Flower that allows him to throw little fireballs at enemies, and others. A new power-up is the Cape Feather: when wearing the cape, Mario can spin to hurt enemies, and fly as long as the player is able to sustain his balance in the air. Another new feature is the possibility to ride the dinosaur Yoshi, who can eat enemies and gain special attacks from some of them. In order to unlock certain areas, it is sometimes necessary to physically pick up and carry items (e.g. keys) and use them in appropriate places.</p><p>The game's world is divided into several large areas, each containing a number of stages. Outdoor scenarios prevail, but there are also many underground and underwater levels. Each large area has at least one ghost house, typically containing more elaborate traps and ghostly non-destructible enemies. In order to venture to the next area, the player usually has to visit a castle (a more difficult stage with harder enemies and dangerous traps) and defeat the boss enemy guarding it. </p><p>Many stages have secret exits, which lead to optional areas, such as fortresses with recurrent boss enemies, interconnected stages of the Star World, and Switch Palaces, which allow the player to materialize specifically colored bricks in all the stages, gaining access to power-ups and other secrets. Secret areas may also open access to other dinosaur types, with different abilities such as breathing fire or flying.</p>"},{"name":"Super Mario World 2: Yoshi's Island","year":1995,"developer":"Nintendo Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Super%20Mario%20World%202%20-%20Yoshi%27s%20Island%20%28USA%29%20%28Rev%201%29.zip","filesize":1,"score":8.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform","desc":"<p>The events of <em>Yoshi's Island</em> take place in the past. Mario was one of two twin brothers whom the evil Magikoopa Kamek tried to kidnap. Kamek kidnapped one of the brothers, but the second, Mario, fell down on Yoshi's Island, where Yoshis live. The Yoshis decided to carry baby Mario and to bring him to his parents. But Kamek has sent troops and hordes of monsters to stop the Yoshis and to kidnap Mario.</p><p>In the game, players control the differently colored Yoshis most of the time. Mario is a helpless baby unless a star that makes him invincible is collected. As a Yoshi, players can swallow enemies to make eggs; these eggs are used for attacking other enemies and activating switches. Yoshi can do a flutter jump to clear large gaps that a regular jump can't. Players can also pound the ground for attacks and also flipping certain switches. Additionally, Yoshis can transform into vehicles, such as a helicopter, submarine, or train. If Mario is dismounted from a Yoshi, a countdown will start, and Yoshi must catch the baby before Kamek's servants kidnap it. When Mario is invincible, he doesn't ride on Yoshi and is immune to attack. While invincible, Mario can run up certain walls.</p>"},{"name":"Super Metroid","year":1994,"developer":"Intelligent Systems Co., Ltd.","url":"7#Super%20Metroid%20%28Europe%29%20%5BEn%2CFr%2CDe%5D.sfc","filesize":3145728,"score":8.7,"genres":"Action > Side view > 2D scrolling > Metroidvania > Platform > Shooter > Sci-fi / futuristic","desc":"<p>After having defeated Mother Brain, the leader of the Space Pirates who wanted to use alien creatures known as Metroids to dominate the world, the bounty hunter Samus Aran took the fight to the Metroids' homeland and eradicated them. Only a single Metroid larva remained. Samus took it to a galactic research station, and scientists assured her that the powers of the larva can be harnessed to help people. However, everything goes wrong when a dragon kills the scientists, takes away the larva, and destroys the research facility. Samus follows the dragon to the planet of Zebes, where she fought Mother Brain before. She must explore the dangerous planet, stay alive, and figure out a way to retrieve the larva.</p><p><em>Super Metroid</em> is a platform game and a follow-up to Metroid II. Like the previous games in the series, it is not divided into separate levels; the planet Zebes is an open world which Samus traverses back and forth. This world is divided into rooms separated by doors which must be shot to be opened. Shooting is also used to open up secret passages, some of which contain nifty bonuses, but finding most of them is required to proceed in the game. </p><p>There are many items to find on the way, and each new item usually makes heretofore inaccessible areas available to Samus. The items include both weaponry (such as missiles, super missiles, or upgrades to Samus's standard laser gun), energy tanks that increase Samus' max health, and other gadgets (like a grappling hook that allows Samus to stick to the ceiling). </p><p>There are various enemies - alien fauna - lurking around planet Zebes. The enemies all respawn after re-entering a room, though Samus' increasing capabilities mean that they become easier to defeat as the player makes progress. After killing them, the enemies typically leave behind some health or ammo.</p>"},{"name":"Super Momotarō Dentetsu II","year":1992,"developer":"Hudson Soft Company, Ltd."},{"name":"Super Momotarō Dentetsu III","year":1994,"developer":"Make Software, Inc."},{"name":"Super Nazo Puyo: Rulue no Roux","year":1995,"developer":"Compile"},{"name":"Super Nazo Puyo: Rulue no Tetsuwan Hanjōki","year":1996,"developer":"Compile"},{"name":"Super NES Super Scope 6","year":1992,"developer":"Intelligent Systems Co., Ltd.","url":"7#Nintendo%20Scope%206%20%28Europe%29.sfc","filesize":1048576,"score":5.9,"genres":"Action > 1st-person > Arcade > Falling block puzzle > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Super Scope 6</em> is the pack-in game for the Super Scope peripheral, which is required to play this game. The emphasis of <em>Super Scope 6</em>'s gameplay is on first person shooting, using the required Super Scope accessory to aim. It features a total of six game modes, categorized as either <em>Blastris</em> or <em>LaserBlazer</em>.</p><p><em>Blastris Mode</em> features a variety of unrelated games.</p><ul><li><strong>Blastris A</strong> is a falling block game based on Tetris and plays very similar. Blocks appear on the left side of the screen and move towards the right side of the screen, where they will fit into play. The goal is to have the blocks on any column line up and destroy themselves. Each level requires five of these to happen. Unlike <em>Tetris</em>, the player cannot move or even rotate blocks. Instead each section of the block can be destroyed by shooting it. Higher difficulty levels increase the speed of gameplay</li><li><strong>Blastris B</strong> is a falling block game based on Columns and Puyo Puyo. On each screen are a number of \"jelly blocks\" which must be destroyed to complete the stage. New blocks appear at the top of the screen and move towards the bottom where they fit into play. Blocks can be destroyed by lining up a row of 4 blocks of the same colour. The player is unable to move the falling blocks but may cycle their colour by shooting at them.</li><li><strong>Mole Patrol</strong> is combination of Whack-a-Mole and a shooting gallery. A number of moles appear on the screen with a flag indicating the amount that need to be destroyed that level, before jumping into a pipe. From there the moles will climb out of any one of 12 holes on the screen and the player must shoot them as fast as possible. Along with regular moles are pink moles that will temporarily speed up gameplay, making shots more difficult.</li></ul><p><em>LazerBlazer Mode</em> feature a group of games set in a military atmosphere.</p><ul><li><strong>Type A: Intercept</strong> is a first person shooting game where the player shoots down incoming missiles and airplanes. These missiles/planes appear on the right side of the screen and move towards the left side. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level.</li><li><strong>Type B: Engage</strong> is a first person shooting game where the player shoots down incoming missiles and airplanes, which will cautiously open fire on the player. These missiles/planes appear in front of the player, in the distance and move towards the player. The player has limited energy which is decreased when hit by an enemy. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level.</li><li><strong>Type C: Confront</strong> is a first person shooting game where the player shoots down incoming spacecraft, which will actively open fire on the player. These UFOs can appear anywhere on the screen and the player must shoot them down before they open fire on the player. Each hit by an enemy decreases the player's shield energy. A radar is also given to the player to keep track of overall positions of these objects on the screen. Ammunition is limited and the player must shoot down a certain amount each level.</li></ul>"},{"name":"Super Ninja Boy","year":1991,"developer":"Culture Brain Inc.","url":"9#Super%20Ninja%20Boy%20%28USA%29.zip","filesize":1,"score":"","genres":"Role-playing (RPG) > Diagonal-down > Side view > 2D scrolling > Real-time > Turn-based > Action RPG > Direct control > Menu structures > Sci-fi / futuristic > Martial arts","desc":"<p>One day a spaceship came down from the heavens and into the skies of Chinaland. It began broadcasting an image of peace. Soon Emperor Chin was holding a peace conference with the space ship's leader, Rub-A-Doc. Rub-A-Doc visited with some of the other places in the world before departing to the heavens and leaving the world. All seemed peaceful however there seems to be trouble starting up, strange monsters have been seen throughout Chinaland. Could the increase in monsters be somehow related to the recent visit from Rub-A-Doc? The ninja masters of Mount Edin, Jack and Ryu are sent to investigate...</p><p><em>Super Ninja Boy</em> is an action RPG for one or two players. In a two player game, each player controls either Jack or Ryu. In a one player game, only Jack appears. A second player may join at any time by visiting a convenience store.</p><p>The game contains familiar role-playing elements such as equipping differing kinds of weapons, equipment and gaining levels. The Ninja Boys are treated as a single entity and so these statistics are shared between Jack and Ryu with equal values. Battles with the enemy, either through random encounters or visible on the map is where the action starts. The characters enter a side-scrolling 'battle mode' where they may jump, fight, use their special techniques, items and spells, as well as activate various bonuses on the battlefield by breaking open the bonus boxes. A battle is over and experience points awarded when a pre-determined number of enemies are defeated or the Ninja Boys are defeated.</p><p>When bosses are encountered, the gameplay changes to a turn-based system. Each turn, commands are given to Jack and Ryu, which include usage of special items and skills acquired during the game, who then perform actions based on those commands. The enemy's turn takes place the same way. The battle ends when one side of the conflict runs out of hitpoints.</p>"},{"name":"Super Ninja-kun","year":1994,"developer":"Jaleco Ltd."},{"name":"Super Nintendo Entertainment System: Super Set (included game)","year":1992,"developer":""},{"name":"Super Noah's Ark 3-D","year":1994,"developer":"Wisdom Tree, Inc."},{"name":"Super Nova","year":1993,"developer":"Taito Corporation","url":"6#Super%20Nova%20%28USA%29.sfc","filesize":1048576,"score":6.7,"genres":"Action > Side view > Top-down > 2D scrolling","desc":"<p>The intergalactic menace Belser has been long-defeated. However, he is rising again and is ready to cause trouble. Only a group of well-trained starpilots can defeat him. You take to the stars in this horizontal and sometimes vertical scrolling shooter. There are several power-ups to be obtained in your mission to defeat the evil Belser. </p><p>There are three ships to choose from, each having different weapons for attack. There are eight attack levels for each, increasing with each Red Orb collected. The Blue Orb gives a limited defense shield.</p>"},{"name":"Super Off Road: The Baja","year":1993,"developer":"Leland Interactive Media","url":"5#S/Super%20Off%20Road%20-%20The%20Baja%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Off-roading > Track racing","desc":"<p><em>Super Off Road: The Baja</em> is a sequel of Super Off Road. Unlike its predecessor which uses an isometric top-down view of a single-screen track, this arcade racing game is made specifically for the SNES and uses its Mode 7 hardware for a 3D racing experience with a 3rd person perspective.</p><p>The game has three different tournaments, the Mexico 250, Ensenada 500 and Baja 1000. Instead of having to drive many consecutive rounds on a small circuit the circuits are big and more akin to rally racing with a finish at a different location than the start. The game is still held with many opponents as well as non participating traffic and wildlife that can hinder the player or be ruthlessly run over. Along the bumpy off-road tracks the player can collect bags of money, just like in its predecessor. Money can be spend on improvements of various of the car's parts, such as: brakes, tires, shocks, lights, engine and nitros.</p>"},{"name":"Super Pinball II: The Amazing Odyssey","year":1995,"developer":"KAZe Co., Ltd."},{"name":"Super Pinball: Behind the Mask","year":1993,"developer":"KAZe Co., Ltd.","url":"5#S/Super%20Pinball%20-%20Behind%20the%20Mask%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > 1st-person > Pinball","desc":"<p><em>Behind the Mask</em> is a pinball simulator for the SNES featuring three completely unique tables: the clown-themed \"Jolly Joker\", the pirate themed \"Blackbeard and Ironmen\", and the fantasy-themed \"Wizard\".</p><p>All tables are shown in a tilted 3D view, which fits the entire table on the screen without the need for scrolling, with marquee messages and bonuses displayed as giant overlays on the screen. Features single player and up to four-player hotseat multiplayer gameplay in either Competition (free tournament mode) or Conquest (progress through each table and clear them by surpassing 100 million points) modes. Also features directional nudging using all the buttons in the pad.</p>"},{"name":"Super Play Action Football","year":1992,"developer":"Tose Co., Ltd.","url":"5#S/Super%20Play%20Action%20Football%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Top-down > Isometric > Football (American) > Licensed","desc":"<p>The 16-bit sequel to NES Play Action Football.  Graphics are from the same three-quarters perspective as the original.  There are now three levels of play to choose from: high school, college, or professional.  All 28 real NFL teams are included, but Nintendo did not secure the NFLPA or NCAA licenses, so there are no real player names or real universities.  College play features weekly poll rankings, conference schedules, and bowl games.  NFL play includes both the regular season and playoffs.</p>"},{"name":"Super Punch-Out!!","year":1994,"developer":"Nintendo R&D3","url":"6#Super%20Punch-Out%21%21%20%28USA%29.sfc","filesize":2097152,"score":7.9,"genres":"Sports > Behind view > Direct control > Boxing","desc":"<p>Your dreams are finally going to come true! All the years of training...all for that day where you'd finally step into the ring, amidst the roar of the excited crowd, to square off against the best of the best...you tighten your fist and hear your gloves tighten with them...you take a step foward...the door opens before you...and the boxing ring beckons your name!</p><p>16 world champs are here, with the same dream as you: to win the WVBA Championship! Welcome to the world of boxing, kid! Give 'em an uppercut or two for your fans!</p>"},{"name":"Super R-Type","year":1991,"developer":"Irem Corp.","url":"5#S/Super%20R-Type%20%28NA%20-%20SA-1%20Patch%2C%20Rev%201.2%29.sfc","filesize":1048576,"score":7.2,"genres":"Action > Side view > 2D scrolling > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>In this SNES sequel to the arcade R-Type shooters, you are the R-9, Earth's most advanced form of defense against the evil BYDO Empire. There are seven stages you must go through, picking up power-up items to defeat the stage bosses which have returned from the arcade versions of R-Type and R-Type II. Your R-9 ship can also be united with FORCE, which are invincible units that surround your ship to protect you and can also power up and attack.</p>"},{"name":"Super R.B.I. Baseball","year":1995,"developer":"Tengen Inc.","url":"5#S/Super%20R.B.I.%20Baseball%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > 3rd-person (Other) > Top-down > Baseball > Licensed","desc":"<p><em>Super R.B.I. Baseball</em> is the first appearance of the R.B.I. series on the Super Nintendo. It features 700 major MLBPA players and has all 28 teams along with the complete 1994 roster, but doesn't feature an MLB license, instead the teams nicknames are omitted and team colors are altered.</p><p>There are six modes to choose from: <em>Exhibition</em>, <em>Home Run Derby</em>, <em>Defense Practice</em>, <em>Playoffs</em>, <em>League</em>, that has the player compete against each team in the game in succession and <em>Game Breaker</em> which lets the player choose from 17 scenarios to win the game under certain conditions. They can also choose different Division Champion line-ups that range from 1989-1993 or All-Star Lineups from 1989-1994.</p><p>The graphics of the game are presented in a cartoonish-way and the stadiums are \"authentic\", but altered to distinguish themselves from the actual MLB stadiums. The game doesn't feature a battery back-up like many other baseball games, but Series championships can be saved using passwords. Jack Buck also lends his voice talent to the game calling play-by-play commentary.</p>"},{"name":"Super Real Mahjong PIV","year":1994,"developer":"SETA Corporation"},{"name":"Super Real Mahjong PV Paradise: All-Star 4-nin Uchi","year":1995,"developer":"SETA Corporation"},{"name":"Super Robot Taisen EX","year":1994,"developer":"Winky Soft Co., Ltd.","url":"5#S/Super%20Robot%20Taisen%20EX%20%28English%20Translated%2C%20Rev%201%20With%20Music%20Persistence%20Patch%29.sfc","filesize":2097152,"score":"","genres":"Role-playing (RPG) > Strategy > Top-down > Turn-based > Mecha / giant robot > Fantasy > Sci-fi / futuristic > Licensed","desc":"<p><em>Super Robot Taisen EX</em> is a spin-off entry in the <em>Super Robot Taisen</em> series. It stars characters original to the series that were introduced in previous games, instead of the anime TV heroes that the main line games focus on. The game is set after the third Super Robot War and sees protagonist Masaki return to his homeland of La Gias, located on the inner surface of the hollow Earth. He finds the land engulfed in a civil war, and quickly decides to join the fight to restore peace. He soon learns that people from La Gias have opened gates to the surface, summoning robot pilots to join the war against their will, thus introducing both allies and enemies from the past wars into this new conflict. Among those summoned is Ryune, who, upon learning of the situation, decides to seek other summoned friends and help them before trying to return home. Unlike the straight science fiction scenario of the earlier games, <em>EX</em> goes for more of a fantasy flavor, with a medieval setting and a world of faeries, spirits, demons and magically-powered robots crossing with the hi-tech robots from the surface.</p><p>The game consists of three separate campaigns plus a short training scenario: one for Masaki (easy difficulty), one for Ryune (medium difficulty) and one for a mysterious third character who was believed killed in the previous game (hard difficulty). Masaki's and Ryune's campaigns can be selected from the beginning, while the third one only unlocks upon completion of the earlier ones. All in all, the game includes more than 60 scenarios. While there are some branches in the mission tree, they are not as extensive as in the previous game. It is possible to import the results of one campaign into the beginning of another, leading to slightly different events.</p><p>Gameplay is only slightly changed from the direct predecessor. Players control their units via context-sensitive menu commands on a top-down view of the area, with battles being fought via animated scenes. Changes include the ability to set counterattack strategy per enemy turn instead of globally, the introduction of ranged attacks that can be fired in the same turn after moving, dead zones for ranged attacks, and area attacks. Besides leveling up pilots and upgrading robots, individual weapons can now also be upgraded. The power statistic of pilots is gone, and special robot attacks now require high enough stats in both willpower and piloting skill. Control and UI improvements include the display of to hit chance before an attack, quick switching between units, the display of active spirit powers on pilots, several shortcuts, and diagonal cursor movement.</p><p>Besides the usual assortment of Gundam, Mazinger and Getter Robo mechs, the game includes robots and characters from the series <em>Goshogun</em> and <em>Dunbine</em>, as well as a host of originals native to the La Gias scenario.</p>"},{"name":"Super Robot Taisen Gaiden: Masou Kishin - The Lord of Elemental","year":1996,"developer":"Winky Soft Co., Ltd."},{"name":"Super Slam Dunk","year":1993,"developer":"Park Place Productions","url":"5#S/Super%20Slam%20Dunk%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Basketball","desc":"<p>A basketball game featuring 28 teams. Even though the game doesn't carry an NBA license, 27 of the teams are based on the cities of their real professional counterparts of that era. The other team is an all star team.</p><p>The game has an exhibition and playoff mode. Exhibition is the usual team vs team game, while the playoff mode has 8 teams competing to win the championship. Players can choose to turn fouls on or off and also choose how many minutes each quarter will be.</p><p>The game features a vertical basketball court, with only half of the court shown at any one time. When a player takes the ball from one side of the court to the other, the screen rotates and then the other half of the court is shown.</p><p>Earvin \"Magic\" Johnson gives commentary before a game, while broadcaster Chick Hearn gives the play by play during the game.</p>"},{"name":"Super Slap Shot","year":1993,"developer":"Ringler Studios","url":"5#S/Super%20Slap%20Shot%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Sports > Diagonal-down > Side view > 2D scrolling > Hockey > Licensed","desc":"<p>A generic 5-on-5 hockey game endorsed by 'Mr. Hockey' Gordie Howe. There are 32 international teams to choose from in exhibition and tournament. The gameplay features realistic hockey action with penalties and up close fights. There are 10 or more pages of hockey stats available during games.</p>"},{"name":"Super Smash T.V.","year":1992,"developer":"Williams Electronics Games, Inc.","url":"6#Super%20Smash%20T.V.%20%28USA%29.sfc","filesize":524288,"score":7.3,"genres":"Action > Top-down > Fixed / flip-screen > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>The year is 1999. The world's most popular television show is Smash T.V., an ultra-violent contest between two armed-to-the-teeth combatants, set loose in a series of deadly arenas that are filled to bursting with hordes of mindless beasts and killer robots. The aim of the game is to blast everything in sight and try to grab more cash and prizes than the other guy. Toaster ovens, VCRs, fancy cars and luxury holidays are there for the taking... for anyone who can survive long enough to enjoy them.</p><p><em>Smash T.V.</em> is an insane shoot-em-up from the brain of Eugene Jarvis, creator of Robotron: 2084. It retains that game's frantic style of play and two-joystick control method, but adds plenty of gore, violence, a hint of satire and that all-important two player mode.</p>"},{"name":"Super Soccer","year":1991,"developer":"Human Entertainment, Inc.","url":"5#S/Super%20Soccer%20%28NA%29.sfc","filesize":524288,"score":7.8,"genres":"Sports > Top-down > Football (European) / Soccer","desc":"<p>Let's play soccer - the world's favorite sport!</p><p>In <em>Super Soccer</em> you can choose between an Exhibition mode and a Tournament mode. While the first mode lasts a single game only the Tournament mode challenges you with 16 consecutive games, facing the Nintendo Allstar Team in the final round.</p><p>The field is shown in a top-down perspective. Scrolling is done by Mode 7 chip. Difficulty varies with the opponent team, ranging from easy to hard in later games in the tournament.</p><p>After winning a match in the tournament mode, you will be rewarded witch a code in order to pick up the game in the same round of the tournament later on.</p>"},{"name":"Super Soccer Champ","year":1992,"developer":"Taito Corporation","url":"5#S/Super%20Soccer%20Champ%20%28NA%29.sfc","filesize":524288,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (European) / Soccer","desc":"<p>A soccer game that scrolls horizontally at a slight angle, and uses a close-up zoom effect after a player scores. Only a small area of the pitch is on screen at a time, but there is a scanner to show the whole pitch.</p><p>Although the game has a referee, he often loses attention, and these moments give you a chance to foul, punch or side-swipe opposition players. One and two player options are included.</p><p>Depending on the version of the game some of teams change. The international teams included are:  </p><p>Argentina, Brazil, England, Germany, Italy, Netherlands, France. and Spain. (Football Champ / Euro Football Champ - Arcade)  </p><p>Argentina, Brazil, England, Germany, Italy, Netherlands, USA, and Japan.(Hat Trick Hero - Arcade)  </p><p>Argentina, Brazil, England, Germany, Italy, Netherlands, France, and USA (Super Soccer Champ / Euro Football Champ - SNES)  </p><p>Argentina, Brazil, England, Germany, Italy, Netherlands, Japan, and USA (Hat Trick Hero - SNES)</p><p>A version of the game was released to coincide with the 1992 European Championships titled Euro Champ '92. While the game is mainly the same, it focused only on European teams (additional ones were added to the ones that appear in this game) and also changes the way a super shot is performed.</p>"},{"name":"Super Solitaire","year":1994,"developer":"Beam Software Pty., Ltd.","url":"5#S/Super%20Solitaire%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Puzzle > Top-down > Fixed / flip-screen > Turn-based > Cards / tiles > Point and select > Regional differences","desc":"<p><em>Super Solitaire</em> is a SNES version of the classic solitaire card game with 12 varieties of play (Klondike, Free Cell, Golf, Cruel, Pyramid, Stonewall, Doesn't Matter, Aces Up, Florentine, Poker, Canfield and Scorpion). It features classic artwork for backgrounds along with optional cartoony graphics. Very soft music is included on the track. The game also sports options where you can choose to skip to the next card when stuck or get a hint on what to do.</p>"},{"name":"Super Star Wars","year":1992,"developer":"Sculptured Software, Inc.","url":"7#Super%20Star%20Wars%20%28Europe%29.sfc","filesize":1048576,"score":7.6,"genres":"Action > 1st-person > Behind view > Side view > 2D scrolling > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>The story of this game is based on <em>Episode IV: A New Hope</em>, the first of the original  Star Wars movie trilogy. The player initially controls the movie's main hero, Luke Skywalker, but two more controllable characters join later: the careless captain Han Solo and his Wookie side-kick, Chewbacca. The game generally follows the movie plot, allowing the player to experience some of the most important sequences, such as the search for Obi-Wan Kenobi, rescuing princess Leia, and the final confrontation against Death Star and its TIE Fighters, led by the mysterious Darth Vader.</p><p>Most of the game levels follow traditional platform gameplay style. As Luke, Han, or Chewbacca, the player makes his way through the linear levels, fighting enemies, jumping over obstacles, and collecting power-ups. The power-ups include standard health-restoring items, upgrades for the blaster gun (up to five different upgrade levels), as well as special items that can be used for massive destruction of the enemies. Luke uses a weak blaster gun, but later gains access to a lightsaber, being able to fight enemies melee-style. Han and Chewbacca use stronger flame guns, but cannot upgrade to better weapons.</p><p>Some of the levels are dedicated to familiar Star Wars vehicles (such as a land speeder). Controlling the vehicle from a third-person view, the player has to navigate it through the pseudo-3D environments, avoiding obstacles and shooting at enemies on the way.</p><p>The PlayStation ports of the SNES version have updated controller and display options, leaderboards, new save options, and Trophies.</p>"},{"name":"Super Star Wars: Return of the Jedi","year":1994,"developer":"Sculptured Software, Inc.","url":"7#Super%20Star%20Wars%3B%20Return%20of%20the%20Jedi%20%28Europe%29.sfc","filesize":2097152,"score":7.8,"genres":"Action > 1st-person > Behind view > Side view > 2D scrolling > Arcade > Platform > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>You select your character from the movie (Luke Skywalker, Han Solo, Princess Leia, or Chewbacca) before each level, as each one has different abilities, and go try to beat levels based on the movie's scenes brandishing lightsabers, blasters or crossbows, etc. depending on your choice of character.</p><p>Gameplay consists of standard platform action spiced up with some slightly different (gameplay-wise) sequences. Race to Jabba the Hutt's palace in a speeder, fight your way through Jabba the Hutt's minions before killing Jabba himself, control speeder bikes and the Millennium Falcon, and much more.</p>"},{"name":"Super Star Wars: The Empire Strikes Back","year":1993,"developer":"Sculptured Software, Inc.","url":"7#Super%20Star%20Wars%3B%20The%20Empire%20Strikes%20Back%20%28Europe%29.sfc","filesize":1572864,"score":7.7,"genres":"Action > 1st-person > Behind view > Side view > 2D scrolling > Platform > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>The sequel to  Super Star Wars is, as the name implies, based on <em>Episode V: The Empire Strikes Back</em>, the second of the original  Star Wars movie trilogy. The game features familiar locations and events from the film, such as the ice planet Hoth, the search for Yoda on the jungle planet Dagobah, and the fight against Darth Vader. Several locations are expanded, adding places and boss enemies that did not exist in the movie, and certain key events in the story are omitted or changed. </p><p>As in the previous game, the player is able to control three characters: Luke Skywalker, Han Solo, and Chewbacca. Unlike the first, each character has been given a distinct special move. Chewie spins a path of destruction through enemies, Han has grenades and a powerful slide, and Luke can switch to his lightsaber and block oncoming fire. Gameplay is very similar to the first game, mostly focusing on platforming elements. As before, there are Mode-7 vehicle levels, during which the player is able to pilot a snowspeeder against encroaching Imperial walkers, pilot the Millennium Falcon through the asteroid field, and break through Cloud City's defenses in Luke's X-Wing fighter. </p><p>The game's other major addition is the inclusion of a suite of Force powers for Luke. They are learned by collecting hidden orbs on the Dagobah level, and add a second special bar that depletes with each usage of a Force power. Power-ups include health items, weapon upgrades, screen-clearing detonators, and orbs that restore Luke's Force power. Passwords have also been added, and are given upon completion of each of the game's 25 stages.</p>"},{"name":"Super Street Fighter II","year":1994,"developer":"Capcom Co., Ltd.","url":"6#Super%20Street%20Fighter%20II%20%28USA%29.sfc","filesize":4194304,"score":7.9,"genres":"Action > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p><em>Super Street Fighter II</em> is a sequel to Street Fighter II Turbo and Street Fighter II Champion Edition. The game features four new characters and stages, making a total of sixteen playable. It also features many multiplayer modes in addition to the single-player mode. Among those is the returning elimination group battle, where players compete for the title of the champion, and Point Battle, where the person with the most points wins. Newer modes include an eight-man double-elimination tournament and a Challenge mode, where players attempt to get the most points on a CPU opponent or beat them as fast as possible, trying to surpass records.</p>"},{"name":"Super Strike Eagle","year":1993,"developer":"MicroProse Software, Inc.","url":"5#S/Super%20Strike%20Eagle%20%28NA%29.sfc","filesize":1048576,"score":7.3,"genres":"Simulation > 1st-person > 3rd-person (Other) > Top-down > Flight / aviation > Vehicular combat","desc":"<p>Microprose's F-15 Strike Eagle series returns with an edition for the Super Nintendo. Super Strike Eagle puts you in the cockpit of an F-15 as you attempt to force various governments back into the United Nations.</p><p>To accomplish this, players must bomb targets, shoot down enemy fighters, and sink ships. Gameplay takes place in both the first-person and third-person perspectives.</p>"},{"name":"Super Tekkyū Fight!","year":1995,"developer":"Metro Corporation"},{"name":"Super Tennis","year":1991,"developer":"Tokyo Shoseki Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Super%20Tennis%20%28USA%29.zip","filesize":1,"score":7.5,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>The world circuit of tennis awaits you. Select from 20 male and female players, each with their own style of game play (strengths and weaknesses) and play singles, doubles either against or with a human opponent or a CPU controlled player(s) on all the major surfaces (clay, grass &amp; hardcourt).</p><p>The circuit mode is the meat of the game. Here, using a password save system, you play a selection of tournaments all around the world. The more games you play and win, the more points you receive. These points go towards your rank in the world tour rankings. There are 4 major tournaments (as in real life) and many minor tournaments to play.</p>"},{"name":"Super Tetris 2 + Bombliss","year":1992,"developer":"Bullet-Proof Software, Inc."},{"name":"Super Tetris 2 + Bombliss (Genteiban)","year":1994,"developer":"Tose Co., Ltd."},{"name":"Super Tetris 3","year":1994,"developer":"Tose Co., Ltd."},{"name":"Super Troll Islands","year":1994,"developer":"Millennium Interactive Ltd.","url":"5#S/Super%20Troll%20Islands%20%28NA%29.sfc","filesize":524288,"score":6.6,"genres":"Action > Side view > Platform > Licensed","desc":"<p>Arcade platform game, based on the license of those bright-haired cute naked chaps. Each scrolling level was initially shrouded in an animated \"mist\". Large rectangles of mist could be cleared by running around platforms and ladders in the correct order. As the mist cleared, a brightly-coloured background was revealed. All the usual platform enemies and pickups abounded.</p>"},{"name":"Super Turrican","year":1993,"developer":"Factor 5 GmbH","url":"8#Nintendo%20-%20SNES.zip/Super%20Turrican%20%28USA%29.zip","filesize":1,"score":7.7,"genres":"Action > Side view > 2D scrolling > Platform > Shooter > Sci-fi / futuristic","desc":"<p>Super Turrican is the next generation installment of the famous Turrican Series. Once again it is up to the U.S.S. Freedom Forces to get into their Turrican Assault Suits and drive back the forces of \"The Machine\".</p><p>Similar to it's predecessors, Super Turican features large levels that are crammed with secrets and can be explored freely and in any direction. To get rid of the numerous enemies, Turrican can use three upgradeable shots: A spreadshot, a powerful laser and a rebound that bounces off of walls. Additionally, there is a Freeze-Beam that can be used to temporarily freeze enemies. It is fully rotatable, and therefor also a great help in discovering secret capsules. These capsules contain powerups and can often be used to reach secret areas. Last but not least, Turrican has the ability to transform into an energy wheel (as long as he has enough special energy), which enables him to lay mines and even makes him invincible.</p>"},{"name":"Super Turrican 2","year":1995,"developer":"Factor 5 GmbH","url":"8#Nintendo%20-%20SNES.zip/Super%20Turrican%202%20%28USA%29.zip","filesize":1,"score":8,"genres":"Action > Behind view > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>Super Turrican is back, and once again the USS Freedom Forces have to prevent the evil Machine from harming innocent civilizations. This requires the player to jump and shoot his way through large levels filled with lots of enemies. To get rid of all the enemies, several different weapons can be used, most of which are already familiar to players from previous installments of the series: a Laser, a Spread-shot, and a(improved) Rebound. There is also the option to gointo \"wheel-mode\" for a limited time to become invincible, lay mines and shoot rockets. The Flamethrower is new to the series as well as the Rope, which can be used to climb walls, cling to platforms or pick up out-of-reach items. Much like in side-scrolling shooters, you can now pick up homing missiles as secondary weapons. The biggest difference to previous Turrican-games however, is the fact that in Super Turrican 2 almost half of the levels are strictly linear and don't feature any large secret areas that have become somewhat of a trademark of the series.</p>"},{"name":"Super Valis IV","year":1992,"developer":"Shin-Nihon Laser Soft Co., Ltd.","url":"5#S/Super%20Valis%20IV%20%28NA%29.sfc","filesize":1048576,"score":6.3,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Fantasy","desc":"<p>Once upon a time, there was a prince named Gallagher. He was entrusted with a magical ring that granted him great powers. But he was too weak to control the power of the ring, and became possessed by it. The mad prince was sealed into a crystal, but many years later managed to break out, planning to wreak havoc on the Dream World and conquer it. Yuko, the heroine of the three previous Valis games, is no longer a sacred Valis warrior - she has become a goddess. Lena, a young girl who wants to become a Valis warrior, must prove to Yuko she is worthy to wield the sword of Valis, that will eventually stop the evil plans of Gallagher.</p><p><em>Super Valis IV</em> is a version of Valis IV. The biggest difference in this release is the omission of the two protagonists Amu and Asfal, both from the story and the gameplay. The player controls only Lena, and all references to the other two pivotal characters are removed. This version also has less stages and less cutscenes than the PCE (TurboGrafx) CD release.</p><p>There are also significant differences in the gameplay system. Lena cannot slide, but can run faster in this version. Magic bar as well as HP- and MP-increasing items have been completely removed. Lena can, however, equip special items that enhance her default Valis sword attack.</p>"},{"name":"Super Wagan Land","year":1991,"developer":"Nova Co., Ltd."},{"name":"Super Widget","year":1993,"developer":"Atlus Co., Ltd.","url":"6#Super%20Widget%20%28USA%29.sfc","filesize":1048576,"score":"","genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>Planet Earth is in danger from assorted villains who want to destroy the environment for their own nefarious purposes! Far off in the Horsehead Nebula, a group of shapeshifting aliens known as World Watchers assign planets for their Watchers to protect. A purple alien, Widget, is an apprentice assigned with the job of protecting Earth. Along for the ride is his intelligent sidekick, Mega Brain.</p><p><em>Super Widget</em> is a platform game for the Super Nintendo, based on the cartoon show, <em>Widget</em>. It shares some similarities to the game Felix the Cat in how the main character upgrades their weapon as they collect more power-ups.</p><p>Widget navigates through various worlds as he travels to Earth, picking up 'W' coins - 100 earns him an extra life. There are also special power ups in different categories - these allow Widget to transform into a variety of different creatures, each with their own different ranged attack. As the player collects more power-ups of the same type (up to three), they change into more powerful creatures. If the player gets hit while transformed, they change back to the previous creature. If they get hit while as normal Widget, they lose a life.</p><p>At the end of each world is a boss character. These are larger enemies that require learning their basic pattern, avoiding their attacks, and then firing back with your own. After defeating the boss, the player is graded based on how long it took to complete the level and their combat skills. They are then awarded 'Watcher Experience' based on these grades.</p>"},{"name":"Super Wrestle Angels","year":1994,"developer":"Communication Group Plum"},{"name":"Sutte Hakkun","year":1998,"developer":"Nintendo R&D2"},{"name":"Suzuka 8 Hours","year":1993,"developer":"Arc System Works Co., Ltd.","url":"5#S/Suzuka%208%20Hours%20%28NA%29.sfc","filesize":1048576,"score":6.7,"genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Track racing > Licensed","desc":"<p>This recreation of one of the classic motorbike races uses Super FX technology for the rotating graphics. Five different variations of the circuit are featured, each one progressively more difficult. 250cc, 400cc and 750cc bikes are featured, each one available to be best for top speed, acceleration or handling. The bikes have two steering methods - leaning into the corner or tilting in with the bike upright -the options allow you to set which of these is controlled on the pad and which use the L and R buttons. Races can be set to last for between 15 minutes and the full 8 hours. Your ultimate aim is to win every type of race, across all bikes and circuit layouts.</p>"},{"name":"SWAT Kats: The Radical Squadron","year":1995,"developer":"AIM","url":"5#S/SWAT%20Kats%20-%20The%20Radical%20Squadron%20%28NA%29.sfc","filesize":2097152,"score":6.4,"genres":"Action > Behind view > Side view > 2D scrolling > Platform > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic > Licensed","desc":"<p>S.W.A.T Kats is a game based on the short lived cartoon series S.W.A.T Kats: Radical Squadron. The series would only last for 2 seasons but built a sort of cult following afterwards.</p><p>The Swat Kats are a duo of mechanics by day, but secretly also a group of superheroes defending their home, MegaKat city, from creatures and evil villians. Swat Kats is essentially a side-scrolling action game. You start off using T-Bone and Razor and guide them through 5 different worlds of action packed excitement. Game levels are based on different episodes of the show. As you progress through the game you can increase your weapon levels and gain new weapons. Mode 7 graphics are featured in some parts of the game. A unique feature to the game is the ability to start on different levels.</p>"},{"name":"Sword World SFC","year":1993,"developer":"T&E Soft, Inc."},{"name":"Sydney Hunter and the Caverns of Death","year":2018,"developer":"CollectorVision Games Inc."},{"name":"Syndicate","year":1994,"developer":"Bullfrog Productions, Ltd.","url":"7#Syndicate%20%28Europe%29%20%5BEn%2CFr%2CDe%5D%20%28Beta%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Strategy > Diagonal-down > Isometric > Real-time > Cyberpunk / dark sci-fi","desc":"<p><em>Syndicate</em> for Nintendo and Sega systems adapts the computer original for the capabilities of the consoles. While it follows the same gameplay template, it is redesigned in a much more cartoony style, has multiple differences in gameplay and controls and features completely new levels.</p><p>Taking the role of an executive of a criminal syndicate in a dark cyberpunk future, the player controls teams of cyborg agents on missions: assassinating politicians, opinion leaders or executives from rival syndicates, retrieving important objects, kidnapping scientists or taking out enemy agents. The world map consists of 50 regions, each containing one level (two training levels are also available). The stages are presented in isometric view, and one to four agents are controlled. Unlike the indirect cursor control in the computer versions, on the consoles the agents are controlled directly, with potential targets being selected automatically. Unlike the multi-layered versions of the computer game, all levels consist of one layer only.</p><p>Between missions, taxes from conquered territories can be spent on researching new weapons and cybernetic upgrades for the agents. These are all the same as on the computer versions, with the exception of the flame thrower, which has been replaced with the less gruesome 'chiller'. Indirect control of the agents with drugs influencing adrenaline, perception and intelligence also remains the same. The policemen and guards from the original are gone, their place being taken by robotic drones.</p>"},{"name":"Syvalion","year":1992,"developer":"Taito Corporation"}]