[{"name":"T2: The Arcade Game","year":1993,"developer":"B.I.T.S., Ltd.","url":"5#T/T2%20-%20The%20Arcade%20Game%20%28NA%29.sfc","filesize":1048576,"score":5.9,"genres":"Action > Side view > Top-down > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>One of the several games based on the eponymous movie. The player controls the T-800 terminator, a cyborg from the future, who travels to the year 1995 to protect John Connor, the future leader of the human resistance against machines, from being killed by another terminator, the highly advanced model T-1000. </p><p>This adaptation of the movie is essentially a side-scrolling action game, with both melee combat and shooting; there are also driving sequences between the side-scrolling levels, which mainly consists of avoiding pursuers and safely arriving to the next destination. T-800's default weapon is a pistol, but he can later acquire other weapons such as a shotgun, a mini-gun, etc. The \"good terminator\" can also use kicks and punches to dispose of the enemies. As in the movie, T-1000 appears frequently and must be fought and incapacitated, but can not be permanently killed until the ending part.</p><p>Another objective the player must complete is collecting various robotic parts that could lead to a construction of a new terminator. These parts must be sought out and destroyed, to make this new technique impossible.</p>"},{"name":"Tactical Soccer","year":1995,"developer":"Electronic Arts Victor"},{"name":"Tactics Ogre","year":1995,"developer":"Riverhill Soft Inc."},{"name":"Taekwon-Do (Japan)","year":1994,"developer":"Human Entertainment, Inc.","url":"5#T/Taekwon-Do%20%28JP%29.sfc","filesize":1048576,"score":"","genres":"Sports > 3rd-person (Other) > Side view > Fighting > Martial arts","desc":"<p><em>Taekwon-Do</em> is based on the real life martial art taekwondo, using its real attacks and tournament rules. Each character (there are 19) has his own specialties and the player can create their own personalized fighter (selecting their abilities, aspect, precedence, etc...). </p><p>Controlling a fighter is done by inputting controls for attacks, with the different attacks being toggled just by pressing a direction on the controller and a button (forward + B for example). There are four game modes: Tournament, V.S, Tag battle by turns, and Practice. This game offers a language selection for either Japanese or Korean.</p>"},{"name":"Taikō Risshiden","year":1993,"developer":"KOEI Co., Ltd."},{"name":"Tales of Phantasia","year":1995,"developer":"Production I.G, Inc.","url":"5#T/Tales%20of%20Phantasia%20%28English%20Translated%2C%20Rev%201.2%20With%20Modern%20ROM%20Format%20Patch%2C%20Rev%201%29.sfc","filesize":6291456,"score":7.3,"genres":"Action > Role-playing (RPG) > Side view > Top-down > Anime / Manga > Fantasy","desc":"<p>In <em>Tales of Phantasia</em> the player controls a young boy named Cless, who lives together with his parents in a quiet village. It was a day like all the others when Cless decided to go hunting with his best friend Chester. Chasing a wild boar, Cless discovered a strange talking tree in the forest who was pleading him for help. But as soon as it stopped speaking, the two friends heard the sound of an alarm. They returned to the village and found it burnt down, and all its inhabitants murdered. Before Cless' mother died in his arms, she told him this terrible massacre had something to do with the pendant she and her husband gave Cless for his birthday... what connection could there be? Cless decides to visit his uncle who lives in another town, but he doesn't realize his journey will take him to much more remote places than that.</p><p><em>Tales of Phantasia</em> is a Japanese-style role-playing game with an unusual combat system: the battles are action-based and are fought on separate side-scrolling screens. The player directly controls one character, while other party members are controlled by AI. It is possible to pause the game at any time and use magic, items, or choose an overall strategy for the allies.</p>"},{"name":"Taz-Mania","year":1992,"developer":"Visual Concepts, Ltd.","url":"5#T/Taz-Mania%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":6.8,"genres":"Action > Behind view > Arcade > Direct control > Oceania > Licensed","desc":"<p>This version of Taz-Mania is different from the side-scrolling versions by Sega, in this version the player controls Taz from a third-person perspective.  The goal of the game is to travel down the road, collecting Kiwi's before the timer runs out, avoiding obstacles along the way.  The Kiwi's will get harder to catch as the game goes on, jumping over Taz and actually outrunning him at times.</p><p>Some obstacles Taz faces are trees, telephone poles, tour buses, even pterodactyls who will bring Taz back at the beginning of the level, but also have to avoid characters such as Axl &amp; Bull, a pair of gators who try to capture Taz for the zoo, The She-Devil who is in love with Taz and if the player is caught by her, the game is instantly over and Wendal T. Wolf, who will jump on Taz's back and cover the screen with his hands making it hard to see.</p><p>You can avoid some obstacles by using Taz's tornado spin, but using the spin will cause Taz's health meter to drop, but it can be refilled by eating Kiwi's along with blue and red birds, bushrats and items thrown to Taz by Didgeri Dingo, but beware, he can also throw obstacles at Taz as well including T.N.T.  There is also a bonus stages after completing three levels in which you collect as many items you can in the allotted time to raise the score.</p>"},{"name":"Tecmo Super Baseball","year":1994,"developer":"Sculptured Software, Inc.","url":"5#T/Tecmo%20Super%20Baseball%20%28NA%29.sfc","filesize":1572864,"score":7.1,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>This is Tecmo's attempt at baseball after their Tecmo Bowl series. It has 700 authentic MLBPA players including Ken Griffey Jr., Tony Gwynn and Barry Bonds to name a few. However, it does not feature an MLB license, so the cities nicknames and logos have been omitted, but all 28 teams with 1993 stats are still included.</p><p>The standard modes apply including <em>Exhibition</em>, <em>All-Star</em> and <em>Season</em> in which the player can choose either to play a full or reduced season. The player can also choose to simulate games and watch them unfold or they also have the option to manage their team and watch the outcome of their decisions. It also features a battery backup to allow saving of stats and games as well as two-player capabilities to allow friends to compete head-to-head.</p>"},{"name":"Tecmo Super Bowl","year":1993,"developer":"Tecmo, Ltd.","url":"6#Tecmo%20Super%20Bowl%20%28USA%29.sfc","filesize":1572864,"score":7.3,"genres":"Sports > Side view > Football (American) > Licensed","desc":"<p>Tecmo returns to the gridiron with this new version of Tecmo Super Bowl for 16-bit console systems. Play with real National Football League players and teams in this 2D, side-scrolling arcade game.  All of the features from the 8-bit game remain intact, with brand new ones added for even more electronic football fun!  </p><p>Additions include updated player rosters, options for weather effects (rain, snow), multiple season play (three regular season schedules available in all), adjustable game time length, and an offensive playbook that can be edited even during a game.</p>"},{"name":"Tecmo Super Bowl II: Special Edition","year":1994,"developer":"Tecmo, Ltd.","url":"5#T/Tecmo%20Super%20Bowl%20II%20-%20Special%20Edition%20%28NA%29.sfc","filesize":2097152,"score":7.2,"genres":"Sports > Side view > Football (American) > Licensed","desc":"<p>The follow up to the first 16-bit version of Tecmo Super Bowl. Includes the real NFL teams and players and the same basic gameplay as previous installments in the series.  There are also variety of new features and minor enhancements, such as slightly angled play perspective, larger player graphics, new movement animations, expanded playbooks, fake kicks/punts, audibles, and auto-scheduling based on your won-loss record from the previous year.</p>"},{"name":"Tecmo Super Bowl III: Final Edition","year":1995,"developer":"Tecmo, Ltd.","url":"5#T/Tecmo%20Super%20Bowl%20III%20-%20Final%20Edition%20%28NA%29.sfc","filesize":2097152,"score":7.2,"genres":"Sports > Diagonal-down > 2D scrolling > Football (American)","desc":"<p>A late entry in what was once the premiere football simulation, TSB III has updated rosters and teams for the 1994-1995 season and is licensed by both the NFL and the Players group.  Features real NFLP players and photos, the real NFL schedule, and weekly standings.  You can change defensive and offensive formations, create your own Pro Bowl, fake punts and field goals, go for the two point conversion, and call audibles.  Updates to the game itself include new cinema screens, superstar mode, free agency system, improved graphics, larger field simulation, passing modes, and improved speech and music.  Horizontal scrolling.  Also features battery back-up.</p>"},{"name":"Tecmo Super NBA Basketball","year":1992,"developer":"Sculptured Software, Inc.","url":"5#T/Tecmo%20Super%20NBA%20Basketball%20%28NA%29.sfc","filesize":1048576,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Tecmo Super NBA features real teams (all 27 contemporary teams) and a roster of real players (over 320).  One or two players can compete in regular, reduced, or short seasons, or play an exhibition game.   Though primarily horizontal scrolling, digitized speech and cinemas, along with a free throw point of view, add drama to the proceedings.  Besides the expected elements of basketball (substitutions, penalties, steals and blocks, time-outs, overtime), Super NBA gives you the chance to call offensive plays and to program win/loss records.  Has a battery to back-up season play.</p>"},{"name":"Teenage Mutant Ninja Turtles: Tournament Fighters","year":1993,"developer":"Konami Co., Ltd.","url":"5#T/Teenage%20Mutant%20Ninja%20Turtles%20-%20Tournament%20Fighters%20%28NA%29.sfc","filesize":2097152,"score":7.9,"genres":"Action > Side view > Arcade > Fighting > Martial arts > Licensed","desc":"<p>The game features the original 4 turtles from the previous games in the series, as well as other fighters.</p><p>The game is very much in the tradition of the Mortal Kombat or Street Fighter series, pitting you against opponents one at a time. Some fighters (besides the turtles) will be familiar, such as the Rat King, or even Shredder (now called \"Cyber-Shredder\" here).</p><p>Though even people familiar with the turtles will see differences in them. They can now, for example, do moves involving projectiles, such as \"fireballs\".</p><p>The game's modes include a story mode, where you can only pick one of the turtles and go on fighting opponents in order to rescue April and Splinter, and a tournament mode, where you fight only for the fame and money.</p>"},{"name":"Teenage Mutant Ninja Turtles: Turtles in Time","year":1992,"developer":"Konami Co., Ltd.","url":"6#Teenage%20Mutant%20Ninja%20Turtles%20IV%20-%20Turtles%20in%20Time%20%28USA%29.sfc","filesize":1048576,"score":8,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Martial arts > Licensed","desc":"<p>Doesn't this Shredder dude ever take a break? Now he's gone and \"kidnapped\" the Statue of Liberty itself, and just as the Ninja Turtles were about to kick his butt, he tore open some kinda time portal thingy and flung them back into the past!</p><p>Now Leonardo, Raphael, Donatello, and Michaelangelo have to fight their way through time and tons of Foot Soldiers, mutant wackos, and more in order to bring liberty back and slam Shredder's butt all the way to Dimension X! Go, Turtles! Kick some shell and save us!</p>"},{"name":"Tenchi Muyō! Game-hen","year":1995,"developer":"TamTam Co., Ltd."},{"name":"Tengai Makyō Zero","year":1995,"developer":"Red Company Corporation"},{"name":"Tenshi no Uta: Shiroki Tsubasa no Inori","year":1994,"developer":"Telenet Japan Co., Ltd."},{"name":"Terminator 2: Judgment Day","year":1993,"developer":"Midway Manufacturing Company","url":"7#Terminator%202%3B%20Judgment%20Day%20%28Europe%29.sfc","filesize":1048576,"score":6.7,"genres":"Action > 1st-person > Arcade > Rail shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>This is an arcade rail-shooter based on the film <em>Terminator 2: Judgment Day</em>. Up to two players shoot through future and present levels as robotic killers reprogrammed to serve the human resistance. </p><p>Both players wield a machine gun with infinite ammo that lowers its firing rate (overheats) as it is continuously fired. A secondary weapon (missile launchers in the future, shotguns in the present) has limited ammo but deals heavy damage. Powerups inside the game world include secondary weapon ammo and coolant for the machine guns, and are shot to be collected.</p><p><em>Terminator 2: Judgment Day</em>, renamed <em>T2: The Arcade Game</em> for home conversions, features seven levels based on specific scenes or general concepts in the film. The first four levels act as a prelude, as the player guns down waves of metal Terminators across a post-apocalyptic Battlefield, a besieged Human Hideout, and through the security checkpoints of the enemy supercomputer SkyNet. After destroying the computer, players travel back in time to protect John and Sarah Connor, while also destroying every scrap of SkyNet research at the headquarters of its manufacturer. From there, players must fend off the indestructible T-1000 until the final showdown in the Steel Mill.</p><p>Assets from the movie are used when possible, such as voice clips from Arnold Schwarzenegger, and close-up digital stills of Robert Patrick for the final battle against the T-1000. The Genesis and SNES versions also support lightguns (the Menacer and Super Scope, respectively).</p>"},{"name":"Terminator, The","year":1993,"developer":"Gray Matter Inc.","url":"5#T/The%20Terminator%20%28NA%29.sfc","filesize":1048576,"score":6.4,"genres":"Action > Racing / Driving > Behind view > Side view > 2D scrolling > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>The SNES game based on James Cameron's classic 1984 film is an action game where the player takes the role of Kyle Reese, sent from the future to protect Sarah Connor from the Terminator.</p><p>The game has two kinds of levels: in several scrolling platform levels, Reese runs and jumps, shooting at Terminators (in the future war level that begins the game), street punks or policemen.</p><p>The film's chase scenes are recreated in two driving sequences. Viewed from behind, Reese and Sarah must escape the Terminator's pursuit in their car, dodging incoming traffic and avoiding the Terminator's fire.</p>"},{"name":"Terranigma","year":1995,"developer":"Quintet Co., Ltd.","url":"5#T/Terranigma%20%28NTSC%20Conversion%2C%20Rev%201%20With%208x16%20Font%20Patch%2C%20Rev%201%29.sfc","filesize":4194304,"score":8.1,"genres":"Role-playing (RPG) > Diagonal-down > Action RPG > Sci-fi / futuristic","desc":"<p>The planet known to its inhabitants as Earth is composed out of two realms - the surface, or Lightside, and the underground world, or Darkside. Two cosmic forces, called God and Devil by the humans, were fighting each other fiercely until their final battle in Antarctica led to a catastrophe: the continents of the surface world submerged into the ocean, presumably eradicating all life on the Lightside.</p><p>Meanwhile, the isolated underworld, consisting of frozen crystal mountains and lava rivers, continues to exist. A young boy named Ark grew up in Crysta, the only remaining village on the Darkside. One day, he and some other boys hear mysterious voices coming from beyond a door the village elder forbade them to open. Unable to resist their curiosity, the boys open the door, and Ark finds a box with a strange creature inside. By opening the box, Ark inadvertently causes all the villagers to be turned into stones. In order to bring them back to life, Ark has to find five towers within the dangerous Darkside and eventually restore life on the surface of the planet.</p><p><em>Terranigma</em> is an action role-playing game. Ark levels up after having completed an important quest or cleared out an area. He can attack enemies with various weapons, using different techniques: pierce, leap, dash, etc., resulting from the combination of three basic actions - attacking, running, and jumping. Special objects called Magirocks can be collected and converted into rings, which act as one-use items capable of casting magic spells.</p><p>The game is closely connected to and often regarded as the final part of a trilogy, the first two games being Soul Blazer and Illusion of Gaia.</p>"},{"name":"Tetris & Dr. Mario","year":1994,"developer":"Nintendo Co., Ltd.","url":"8#Nintendo%20-%20SNES.zip/Tetris%20%26%20Dr.%20Mario%20%28USA%29.zip","filesize":1,"score":7.9,"genres":"Action > Compilation > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle > Direct control > Healthcare","desc":"<p>Two of the most popular puzzle games return, but now together in an exclusive compilation for SNES. The games have a slight graphical update when compared with the original Game Boy and NES games, but the gameplay remains totally faithful to the games released for both platforms.</p><p>In Tetris, the main objective is to pile blocks that will fall down continuously, in order to create a row or \"line\" without spaces. For this collection, the game comes with two bonus options: 2 PLAYER GAME (absent in the NES version) and VS. COM (absent in both versions), with 3 CPU opponents available, each one representing a difficulty level (EASY, MEDIUM, and HARD, respectively).</p><p>In Dr. Mario, the objective is to eliminate all the viruses contained in a big bottle. Dr. Mario (situated in the upper-right side of the screen) will throw capsules with 6 different color combinations (Red-Red, Red-Blue, Yellow-Yellow, Red-Yellow, Blue-Blue and Blue-Yellow) in order to line up at least four viruses or capsules of the same color horizontally or vertically and to make them disappear. In this compilation, the game comes with a bonus option: VS. COM, where you'll face the CPU players: Blue Virus (EASY), Yellow Virus (MEDIUM), and Red Virus (HARD).</p><p>For competitive players in both games, there is Mixed Match, where you and a friend can play Tetris and Dr. Mario like a tournament! Adjust the handicap levels, play time, music, and other settings to balance your different skills. The game order is: TETRIS B-TYPE (clear a certain amount of lines), DR. MARIO (disinfect a predetermined number of viruses) and TETRIS A-TYPE (clear lines until the time expires). At the end of the time limit, the player with the highest score is the winner.</p>"},{"name":"Tetris 2","year":1994,"developer":"Nintendo R&D1","url":"5#T/Tetris%202%20%28NA%2C%20Rev%201%29.sfc","filesize":1048576,"score":7.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>Unlike the original <em>Tetris</em>, <em>Tetris 2</em> has you clearing the field of blocks in a different way. Each play field starts with different colored dots (in this case black, gray and white), with one of each color flashing. The blocks are made up of the same three colors, and by matching blocks of the same color over the top or to the side of the dot will clear the dot and those blocks from the screen. If you clear a flashing dot, all the corresponding dots of the same color will be cleared. To complete the round just clear the dots, not the blocks themselves.</p>"},{"name":"Tetris Attack","year":1996,"developer":"Nintendo Co., Ltd.","url":"6#Tetris%20Attack%20%28USA%29%20%28En%2CJa%29.sfc","filesize":1048576,"score":8.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle","desc":"<p>All is not well on Yoshi's Island! The devious king Bowser has cast a spell on the island's inhabitants, turning them into his mindless slaves. Only Yoshi has escaped its effects, and so he must set off to free his friends, and to defeat Bowser and break the spell.</p><p><em>Tetris Attack</em> is a fact-paced action puzzler featuring the colorful cast of characters from Yoshi's Island. A stack of blocks continually rises from the bottom of the screen, and the player controls a cursor which can swap any two blocks horizontally. Make a row or column of three or more and they'll clear, potentially creating combos from new blocks falling to take their place. Combos will send large garbage blocks to your opponent, which must be eliminated by clearing a piece that is touching it, turning it into normal blocks.</p><p>The game offers a story mode against the computer, as well as a 2-player versus mode, an endless mode, a timed mode where a certain number of blocks must be cleared, and a puzzle mode where a set arrangement of blocks must be cleared in a specific number of moves. The game is based on the Japan-only title Panel de Pon.</p>"},{"name":"Tetris Battle Gaiden","year":1993,"developer":"Bullet-Proof Software, Inc.","url":"5#T/Tetris%20Battle%20Gaiden%20%28English%20Translated%2C%20Rev%201%20With%20Boss%20Selection%20Patch%2C%20Rev%201.1%29.sfc","filesize":2097152,"score":"","genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control > Fantasy","desc":"<p><em>Tetris Battle Gaiden</em> is a competitive head-to-head action puzzle game that is meant to be played against the computer or a friend.</p><p>There are 8 available and 2 hidden characters to play as. Each one has its own set of 4 special abilities. In order to use them the player must collect the yellow orbs.</p><p>The blocks in the queue are shared between both players. Such game mechanic makes it possible to intercept the most interesting ones.</p><p>A single-player Story Mode consists of 9 levels each with its own opponent to fight against.</p>"},{"name":"Theme Park","year":1995,"developer":"Bullfrog Productions, Ltd."},{"name":"Thomas the Tank Engine & Friends","year":1993,"developer":"Software Creations Ltd."},{"name":"Thunder Spirits","year":1991,"developer":"Technosoft Co., Ltd.","url":"5#T/Thunder%20Spirits%20%28NA%29.sfc","filesize":1048576,"score":7.1,"genres":"Action > Side view > 2D scrolling > Shooter > Sci-fi / futuristic","desc":"<p><em>Thunder Spirits</em> is a modified version of Thunder Force III made specifically for the arcades with reworked graphics - although still very close to what the Genesis was able to offer. <em>Thunder Spirits</em> puts you behind the cockpit of a lone starfighter out to destroy all the enemy forces of the Orn empire by clearing 8 enemy-infested stages set in various outer space locations. Most of the game levels are taken directly from the Genesis version with a few minor changes, though levels 4 and 5 are totally different - both in graphics and level design.</p><p>The game gives you a health-bar and the ability to swap collected weapons on the fly, which can be obtained by catching power-ups and activating them whenever you want.</p>"},{"name":"Tick, The","year":1994,"developer":"Software Creations Ltd."},{"name":"Time Slip","year":1993,"developer":"The Sales Curve Ltd.","url":"5#T/Timeslip%20%28NA%29.sfc","filesize":1048576,"score":6.2,"genres":"Action > Side view > Arcade > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>On the reptilian planet of Tirmat, scientists have discovered a rift in space and plan to use it to transport the planet's inhabitants before the planet is extinguished by sending their elite army through the rift and invade their closest neighbor...Earth. However, to ensure their success they send their army into Earth's past in hopes of avoiding any modern weapons and increase their chances of saving their planet. However, Earth has learned of their evil plot and has developed a experimental time portal and has sent their own one man army to stop them.</p><p>The player takes control of Dr. Vincent Gilgamesh who has acquired a massive arsenal including pistols, machine guns, rocket launchers and many more heavy weapons and must travel through various time periods including Medieval times, prehistoric times, Ancient Rome and Egypt and even the distant future. The gameplay is similar to Contra where the player advances through the stages, shooting at various enemies and collecting power-ups and must also avoid various traps and pitfalls scattered throughout the levels. There are also the standard bosses at the end of each stage.</p>"},{"name":"Time Trax","year":1994,"developer":"Malibu Interactive","url":"7#Time%20Trax%20%28Europe%29.sfc","filesize":1048576,"score":6.8,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter > Sci-fi / futuristic > Licensed","desc":"<p><em>Time Trax</em> is based off of the 1993-94 sci-fi action series starring Dale Midkiff; you take the role of Darien Lambert, captain of the Fugitive Retrieval Section of Washington D.C. It is the year 2193 and your once high arrest record has started to decline sharply as routine trackdowns end in mysterious disappearances. It is discovered that noted MIT scientist Dr. Mordecai 'Mo' Sahmbi has been sending criminals back in time to 1993 using his invention the TRAX time machine, and has gone back himself. TRAX is captured by the police, and three guesses as to who is tasked with capturing the criminals and sending them back to 2193.</p><p>As Lambert, your primary targets in this game are neo-Nazi racist Sepp Dietrich and Sahmbi himself. You do have some equipment to help you: your supercomputer S.E.L.M.A. (Specified Encapsulated Limitless Memory Archive), disguised as an AT&amp;T Mastercard and whose holographic persona resembles a British nanny, and the PPT (Pellet Projection Tube), a weapon capable of stunning a human from periods of a couple of minutes to a few hours and can fire pellets that render humans transportable to the future, disguised a keyless car alarm remote. Also, you have the ability to \"time stall\" (this slows the speed of images reaching your brain, allowing you to react quickly) and your Mosh-Ti (an Occidental improvement of martial arts) skills to rely on if the situation gets dire.</p><p>You'll run through the alleys of the future, through the Smithsonian (circa 1993), ride a motorcycle and jet-ski, battle criminals atop a construction site, and do so much more until you've finally captured the two fugitives.</p>"},{"name":"Timecop","year":1995,"developer":"Cryo Interactive Entertainment","url":"7#Timecop%20%28Europe%29.sfc","filesize":2097152,"score":4.8,"genres":"Action > Platform > Sci-fi / futuristic > Martial arts > Licensed","desc":"<p>Based off of the Jean Claude Van Damme film Timecop, this game acts as a sequel of sorts. We learned well from the film that the power time travel affords corrupts all men weaker than the Muscles from Brussels, and this has extended to the original inventor of time travel. He proclaims himself dictator of the universe, captures Van Damme as he arrives from fixing all the wrongs in the film, and challenges him to a \"duel across time.\" Platforming action follows across multiple periods of history.</p><p>The primary feature of this game is its digitized characters, uncommon for console games of that era. Actors were taped in front of a bluescreen and stills were taken from the video to create all characters and their animations. The effect is impressive for the SNES, though it does result in robotic enemies who do not respond well to being punched or kicked. The \"timing,\", both in terms of controlling your character and fighting with enemy characters seems off through the entire game.</p><p>There are 15 levels in total, most of which are standard fighting platform levels. Three basic fighting moves are available to the character, not including jumping and crouching kicks, and not including the use of a gun with extremely limited ammo. Some vehicle levels are mixed in, and the game culminates in a jetpack duel over Los Angeles with the villainous time travel creator fellow.</p><p>The game also featured some rare use of digital voice, primarily in the \"FBI... Get on it!\" background theme in the first few levels.</p>"},{"name":"Tin Star","year":1994,"developer":"Software Creations Ltd.","url":"5#T/Tin%20Star%20%28NA%29.sfc","filesize":2097152,"score":7.2,"genres":"Action > 1st-person > Side view > 2D scrolling > Fixed / flip-screen > Arcade > Rail shooter > Direct control > Western","desc":"<p><em>Tin Star</em> is a robot Sheriff in the Ol' West. He has vowed to rid the town of the Bad Oil gang and their leader, Black Bart, within a week. Along with his sidekick Mo Crash and even more importantly his six-gun he will try to accomplish this task.</p><p>The game takes place over a week with each day being a different stage. Stages are broken down into 4 parts. The first part is a training section where players can practice shooting. The next two parts are action scenes. In the action scenes, gameplay consists of moving a cross-hair over various enemies and shooting them. The final part ends the day with a showdown. The showdown involves a one on one duel in which a draw icon will randomly pop up anywhere on the screen which must be shot then immediately afterwards the enemy the player is facing then must also be shot. This continues on until either the player's or the enemy's life bar is drained.</p><p>If a player doesn't shoot an energy canteen during a level a bonus screen will appear. The bonus screen shows a woman spinning around on a round board with stars next to her body. Shooting the stars without missing and without accidentally shooting the woman will help players pick up large amounts of money.</p><p>At the end of a level the amount of money made is tallied up. For every bullet wasted and damage taken the player loses money. The player gains money equal to the their accuracy and the amount of energy they had left at the end of the stage.</p>"},{"name":"TinHead","year":2019,"developer":"MicroProse Ltd."},{"name":"Tintin in Tibet","year":1995,"developer":"Infogrames Europe SA"},{"name":"Tiny Toon Adventures: Buster Busts Loose!","year":1992,"developer":"Konami Co., Ltd.","url":"5#T/Tiny%20Toon%20Adventures%20-%20Buster%20Busts%20Loose%21%20%28NA%29.sfc","filesize":1048576,"score":8.1,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>You play Buster Bunny, in a series of levels, featuring characters from the Tiny Toon Adventures cartoon.</p><p>Most of the six levels are platform levels, where Buster has a number of attacks to defeat the enemies he faces.  These include kicks and jumps, and a dash ability that lets you slide into enemies to defeat them, and also climb walls.</p><p>The fourth level is an exception, and consists of a game of (American) football, played with a simplified version of the rules.  The idea is simply to get a touchdown, while as usual progressing at least ten yards in four downs.  There are two plays: a running play, where you simply run as far as possible while avoiding the opposing team; and a passing play that starts with a pass that can gain you extra yards, but must be caught.</p><p>Between levels there are bonus games.  You spin a wheel to determine what game you play out of five available.</p>"},{"name":"Tiny Toon Adventures: Wacky Sports Challenge","year":1994,"developer":"Konami Co., Ltd.","url":"5#T/Tiny%20Toon%20Adventures%20-%20Wacky%20Sports%20Challenge%20%28NA%29.sfc","filesize":1048576,"score":6.8,"genres":"Sports > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Arcade > Olympiad / mixed sports > Licensed","desc":"<p><em>Tiny Toon Adventures: Wacky Sports Challenge</em> has the player take control of either Buster Bunny, Babs Bunny, Dizzy Devil, or Plucky Duck in a variety of Olympic-type events: ice cream throw, weightlifting, saucer throw, obstacle course, a flying contest called the birdman contest among more. There are four difficulty settings to choose from (Easy, Normal, Hard and Super) each unlockable through passwords which are represented by Tiny Toons characters.</p><p>Players can utilize the multitap, which allows four human opponents to face off against each other. The game also features graphics and animations from the TV show, but does not feature any voice overs from the characters.</p>"},{"name":"TKO Super Championship Boxing","year":1992,"developer":"Sting, Inc.","url":"5#T/TKO%20Super%20Championship%20Boxing%20%28NA%29.sfc","filesize":524288,"score":"","genres":"Sports > 3rd-person (Other) > Side view > 2D scrolling > Real-time > Direct control > Boxing","desc":"<p>A boxing game featuring a Championship mode and a 1 or 2 player exhibition match mode.</p><p>In the Championship mode, players choose from 1 of the 8 available boxers, and then compete against the other 7 boxers on the road to try becoming the World Champ. Players go toe to toe with their opponents in the boxing ring in 3 minute rounds. The boxers can throw hooks and jabs at each other with the sole intention to knock their opponent down to the canvas by draining all their energy by landing those punches. Each punch thrown costs the boxer some stamina which is indicated by boxing glove icons. If all the boxers stamina is drained, they can no longer throw punches for a little while until they gain some of their stamina back. After each fight is over, players go to the gym to train in various different exercises like skipping rope and bench pressing weights. These exercises increase the players boxer in various areas like speed and power.</p><p>Options include setting the number of rounds (from 1 to 10) and setting the difficulty level (novice, advanced, and expert).</p><p>The original Japanese version is slightly different featuring a \"glorious mode\" (story mode) in which the player controls an unique boxer. The characters are also different, among few other minor differences.</p>"},{"name":"TNN Bass Tournament of Champions","year":1994,"developer":"GAPS Inc.","url":"5#T/TNN%20Bass%20Tournament%20of%20Champions%20%28NA%29.sfc","filesize":1572864,"score":"","genres":"Simulation > Sports > Behind view > Fishing > Licensed","desc":"<p><em>TNN Bass Tournament of Champions</em> is a standard fishing game in the vein of Super Black Bass where the player competes in a series of tournaments on six different lakes with a set of rules and regulations in an attempt to become fishing world champion.</p><p>Like many other fishing games, the player can choose from a variety of lures and search for a fishing spot through a top-down view utilizing a fish finder. Once the player finds a suitable spot, they then can cast their lure and attempt to catch as many fish as possible, but also avoid snagging their lines or make them to tight and snap from the tension.</p><p>Players must also contend with changing weather conditions that can either help or hinder their time out on the lake and fish will react true to their real-life counterparts. It also features a license from TNN (The Nashville Network).</p>"},{"name":"Todd McFarlane's Spawn: The Video Game","year":1995,"developer":"Ukiyotei Company, Ltd."},{"name":"Tokimeki Memorial: Densetsu no Ki no Shita de","year":1996,"developer":"Konami Co., Ltd."},{"name":"Tom and Jerry","year":1993,"developer":"Riedel Software Productions, Inc."},{"name":"Tommy Moe's Winter Extreme: Skiing & Snowboarding","year":1994,"developer":"Loriciel SA","url":"5#T/Tommy%20Moe%27s%20Winter%20Extreme%20-%20Skiing%20and%20Snowboarding%20%28NA%29.sfc","filesize":1048576,"score":6.5,"genres":"Simulation > Sports > 3rd-person (Other) > Snowboarding / skiing > Licensed","desc":"<p>In <em>Winter Extreme</em>, the player can partake in a series of skiing and snowboarding events including the <em>Downhill</em> where the player speeds down a course in order to finish the course as fast as possible in an allotted time by speeding through checkpoints. The <em>Slalom</em> has the same set-up where the player has to finish the course in an allotted time by passing through gates, but also has to contend with twists, turns and various other obstacles in the players path. The <em>Giant Slalom</em> is similar except for more obstacles and a longer path.</p><p>Along with the three challenge modes, there is also a <em>Freeride</em> mode where the player can ski at their leisure while avoiding various obstacles such as trees, rocks and fellow skiers and snowboarders. The game also is endorsed by skiing location, Val-d'Isère, which hosted the 1992 Winter Olympics along with skier, Tommy Moe.</p>"},{"name":"Tony Meola's Sidekicks Soccer","year":1993,"developer":"Sculptured Software, Inc.","url":"5#T/Tony%20Meola%27s%20Sidekicks%20Soccer%20%28NA%29.sfc","filesize":1048576,"score":6.6,"genres":"Sports > Behind view > Football (European) / Soccer > Licensed","desc":"<p><em>Tony Meola's Sidekicks Soccer</em> is a standard soccer game with the standard modes such as <em>Exhibition</em> and <em>Season</em> mode with 64 different soccer teams including World teams and localized teams, each with their own strengths and weaknesses. It also features realistic moves such as headers and bicycle kicks, with a behind the player's perspective and Mode 7 graphics. It doesn't feature any official soccer license, but is personally endorsed by American goalie, Tony Meola.</p>"},{"name":"Top Gear","year":1992,"developer":"Gremlin Graphics Software Limited","url":"6#Top%20Gear%20%28USA%29.sfc","filesize":524288,"score":7.8,"genres":"Action > Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>In the first of three released games for Super NES, players can choose among 4 different cars, each one with different attributes (maximum speed, fuel consumption, boost power and tire grip) to face 32 challenging courses situated in several places around the world as Brazil, USA, France, Japan etc.</p><p>In more longer tracks, players will find a Pit Stop section, where they can enter to replenish the fuel meter (total or partially). The game has a split-screen display for 1 or 2 players. In 1-Player mode, you'll dispute the races against the computer, that has a slightly bigger speed than yours, helping to give a lot more of competitiveness. A password system was included, being possible to stop a current game and resume it later.</p><p>Through the game, players will find several obstacles scattered by the courses, like rows of iron plates or even lots of stones. In order to qualify for the next circuit, it's required to complete it at least in the 5th position, or else the game is over.</p>"},{"name":"Top Gear 2","year":1993,"developer":"Gremlin Interactive Limited","url":"6#Top%20Gear%202%20%28USA%29.sfc","filesize":1048576,"score":7.7,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > Street racing > Oceania","desc":"<p>This third-person racing game resembles Gremlin's earlier Lotus series, in terms of its general look and feel, right down to the text font used in the game. Your task is to race through 16 countries, each of which features four races, with many real-world circuits recreated in incongruous locations (such as the Monza layout in Ayers Rock, and the old Hockenheim in Vancouver). </p><p>These four-race blocks each represent their own mini-championship, in which you race against 19 cars, needing to finish in the top 10 to continue, and with the top 6 scoring points 10-6-4-3-2-1, and the respective amount of money in thousands. This can be spent on various upgrades, ranging from engine to tires (wet and dry) and from shocks (front, side and rear) to gearboxes. The ideal approach is to buy the more expensive versions ASAP, as you get no saving when upgrading. If you win the four-race championship, you get the next password. </p><p>You get a set amount of nitro boost to use during each race, although bonus nitros, money and instant speed-up token appear on many tracks. Hazards such as puddles, barriers and ramps are also frequent.</p>"},{"name":"Top Gear 3000","year":1994,"developer":"Gremlin Interactive Limited","url":"5#T/Top%20Gear%203000%20%28NA%29.sfc","filesize":1048576,"score":7.3,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing > Sci-fi / futuristic","desc":"<p>The last game of the Top Gear series for the SNES goes into outer space. Face the challenges found in 48 tracks and become the best pilot in the entire galaxy. Just like the previous games, <em>Top Gear 3000</em> comes with a password system that allows the player to continue a game in progress. The upgrade system of <em>Top Gear 2</em> gains new breath and now comes with newly designed parts: ranging from tires to engines up to atomic turbos. As players travel from one planet to another via spacecraft, they race on various planets in different systems, getting progressively harder. The prize money earned in each race increases as does the price of new car parts. Moreover, the game comes with a versus mode which allows up to 4 players to race simultaneously via splitscreen.</p>"},{"name":"Top Management II","year":1994,"developer":"KOEI Co., Ltd."},{"name":"Torneko no Daiboken: Fushigi no Dungeon","year":1993,"developer":"Chunsoft Co., Ltd.","url":"5#T/Torneko%20no%20Daibouken%20-%20Fushigi%20no%20Dungeon%20%28English%20Translated%2C%20Rev%200.99%29.sfc","filesize":2097152,"score":"","genres":"Action > Top-down > Fantasy > Licensed","desc":"<p>Torneko (aka Taloon) from Dragon Quest IV was a merchant and treasure hunter who always dreamed of owning his own shop. Having defeating the evil along with other heroes, he returned to Endor to work peacefully. Some time has passed and after growing successful in this town, Torneko grew anxious. Hearing rumors one day about a \"Mysterious Dungeon\", Torneko meets with the king to ask permission to set up a new shop, closer to this Mysterious Dungeon. By exploring this cavern and returning safely with the prizes, Torneko hopes to become the most successful merchant in the world.</p><p><em>Torneko no Daibōken: Fushigi no Dungeon</em> is a overhead view game similar to Hack, what might be called a \"dungeon crawl\". Torneko must venture into the mysterious dungeon gathering treasure. He may equip any weapons and shields he finds there, as well as gather up items such as spell scrolls, staffs and herbs with a variety of effect. A variety of enemies, familiar to the Dragon Quest series, await him. If Torneko successfully exits the dungeon, he is able to sell any of the items he has collected. This money then goes to improve the quality of his shop and living quarters. As the game progresses, Torneko is able to store special items in the vault, which he is then able to bring with him on subsequent trips to the dungeon.</p>"},{"name":"Total Carnage","year":1993,"developer":"Midway Manufacturing Company","url":"5#T/Total%20Carnage%20%28NA%29.sfc","filesize":1048576,"score":5.7,"genres":"Action > Top-down > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The war of 1999 left the country of Kookistan in shambles. Naturally, a dictator named General Akhboob took control of the beleagured nation and began creating an army of radioactive mutants. With a virtually impenetrable stronghold, a bunch of hostages, and a legion of mutants under his command, the evil despot will stop at nothing but world domination. Only two men have the courage and idealistic naivete to take on Akhboob and his forces: Captain Carnage and Major Mayhem, also known as the Doomsday Squad.</p><p>As Captain Carnage or Major Mayhem, it is up to you or you and a friend (in simultaneous action) to rescue the hostages while shooting hundreds of mutants bent on your destruction. As you walk and run forward, backward, left, right, and diagonally through 20 battlezones of nonstop action, you'll always have your machine gun by your side. Additional weapons which you can find along the way include grenade launchers, rocket launchers, plasma machine guns, flame throwers, spray-fire rifles, defensive blades, and an assortment of bombs.</p>"},{"name":"Toys","year":1993,"developer":"Absolute Entertainment, Inc."},{"name":"Toys - Let the Toy Wars Begin","year":1993,"developer":"Imagineering Inc.","url":"7#Toys%3B%20Let%20the%20Toy%20Wars%20Begin%21%20%28Europe%29.sfc","filesize":1048576,"score":"","genres":"","desc":""},{"name":"Treasure Hunter G","year":1996,"developer":"Sting, Inc.","url":"5#T/Treasure%20Hunter%20G%20%28English%20Translated%2C%20Rev%201.0b2%29.sfc","filesize":4194304,"score":"","genres":"Role-playing (RPG) > Top-down > Anime / Manga > Turn-based > Fantasy","desc":"<p>Brothers Red and Blue G. decide to leave their idyllic village in search of their long lost father, who left the kids years ago to go treasure hunting. Unfortunately, as soon as they begin their quest, they become entangled with a mysterious girl on the run from evil monsters who holds the key to the resurrection of a great demon. Now its up to the brothers to save the world if they ever want to find their father.</p><p>Treasure Hunter G is a top-down RPG in which you control your party of four characters as they explore the fantasy/sci-fi game world in search for quests and grinding their stats while the plot advances. The game is divided in a world-map screen, a top-down \"town\" mode and a turn-based fight mode in which the characters are taken to generic tiled top-down arenas in which they select each character and move or attack depending on their action points.</p><p>Enemies can be seen on the map instead of jumping at you at random intervals, and you can freely decide whether to engage them or simply circle them around. The game uses a combination of hand-drawn sprites and CGI pre-rendered one (mostly for the main characters) with a distinct cute or Super Deformed design (as usual for most console RPGs).</p>"},{"name":"Troddlers","year":1993,"developer":"Atod Design KB","url":"5#T/Troddlers%20%28NA%29.sfc","filesize":524288,"score":7.5,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Fantasy","desc":"<p><em>Troddlers</em> is a puzzle game in the vein of Lemmings. The player takes control of an animal-like wizard who can create and remove blocks; these blocks are useful for both jumping onto and redirecting the path of the little Troddlers that you have to direct towards the exit. The tricky bit is that the Troddlers can climb walls and ceilings, following the edge of the world and the exit is often in the middle of the screen or with an obstacle in the way.</p>"},{"name":"Troy Aikman NFL Football","year":1995,"developer":"Tradewest, Inc.","url":"5#T/Troy%20Aikman%20NFL%20Football%20%28NA%29.sfc","filesize":1572864,"score":6.3,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>You and a friend can become star NFL players or choose to coach a team in this realistic rendition of the game of American football, endorsed by former Dallas Cowboys quarterback and Super Bowl champ, Troy Aikman. Choose to play alone against the system, or play against each other.</p><p>Pick from 3 play modes: Pre-season, Season, or Custom Generated (editable) season. There are also three skill levels: Rookie, Pro and Veteran.  You can design your own plays, customize your team, and save your team's stats. True-to-life playing surfaces have an effect on how your team performs and include grass, mud, dirt, snow, rain and turf. Listen to the roar of the crowd and other authentic stadium sounds as your plays are followed through.</p>"},{"name":"True Golf Classics: Waialae Country Club","year":1991,"developer":"T&E Soft, Inc."},{"name":"True Golf Classics: Wicked 18","year":1993,"developer":"T&E Soft, Inc.","url":"5#T/True%20Golf%20Classics%20-%20Wicked%2018%20%28NA%29.sfc","filesize":1048576,"score":7.2,"genres":"Sports > Behind view > Golf","desc":"<p><em>Valora Valley Golf</em> is an exaggerated approach to the world of golf. While it does feature traditional golf course hazards like water hazards and bunkers, lava pits and greens on top of a mountain are also present.</p><p>The courses range from basic-looking golf courses with long fairways where the player can drive the ball 450 yards in one shot and giant water hazards to ancient ruins and a course inside of a volcano.</p><p>The controls are simplistic, click one time to bring up a meter, click again to set the angle, and once more for how much power to drive the ball with special shots are obtained at the end of the meter. It doesn't feature any real-life golfers or courses.</p>"},{"name":"True Lies","year":1994,"developer":"Beam Software Pty., Ltd.","url":"7#True%20Lies%20%28Europe%29.sfc","filesize":2097152,"score":7.2,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Licensed","desc":"<p>Take charge of gun toting Arnie in this top down omni-scrolling action shooter. Arnie takes on the terrorists using a variety of weapons in all the locations from the movie of the same name.In each location you have a mission such as retrieve data or capture a terrorist.This usually involves searching around for your goal while dispatching enemies and trying to minimise civilian casualties. The emphasis is on action and weapons, in particular Arnold's favourites: flame thrower and the uzi. He also has a diving roll to help him dodge the enemies bullets and come back guns blazing..</p>"},{"name":"Turbo Toons","year":1994,"developer":"Empire Interactive Europe Ltd."},{"name":"Turn and Burn: No-Fly Zone","year":1994,"developer":"Absolute Entertainment, Inc."},{"name":"Twisted Tales of Spike McFang, The","year":1993,"developer":"Red Company Corporation","url":"5#T/The%20Twisted%20Tales%20of%20Spike%20McFang%20%28NA%29.sfc","filesize":1048576,"score":7.2,"genres":"Action > Role-playing (RPG) > Top-down","desc":"<p><em>The Twisted Tales of Spike McFang</em> is an action-rpg starring the titular hero, a young vampire prince who must rescue his parents and save the inhabitants of the Vladamasco Islands from the evil Von Hesler. But is it really his handiwork, or is there someone else controlling him? Unravel the mystery while traveling to various locales, fighting Von Hesler's henchmen and picking up (CPU-controlled) companions along the way.</p><p>Spike McFang has three main methods of attack: by striking out with his cape, throwing his hat like a boomerang, or using a magic card. Cards can also heal his health or give his companions extra strength. Spike can also devour the still-beating hearts of his vanquished foes (or the dropped tomatoes of his vanquished foes if you're playing the sanitized North American version) to regain health. There are a total of four different hats that Spike can purchase as upgrades in his battle against animated garlic bulbs, bomb-throwing cats, head-spinning plants and a plethora of other dangerous enemies.</p>"}]