[{"name":"U.N. Squadron","year":1991,"developer":"Capcom Co., Ltd.","url":"7#U.N.%20Squadron%20%28Europe%29.sfc","filesize":1048576,"score":7.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Shooter > Flight / aviation > Sci-fi / futuristic","desc":"<p>Side-scrolling shoot-em-up, in a similar style to such games as Gradius, R-Type and Scramble. The aim is to wipe out the enemy, which has gathered around the allied airspace of 'Area 88', in a series of military aircraft-based scenarios. You choose one of three unique pilots; Shin Kazama, Micky Schymon or Greg Gates, each with varying abilities at damage repair, weapon handling and flying skill, and engage the enemy over a series of challenging missions. The player starts out with the weakest plane, the F8E Crusader, which can only be armed with a very basic range weapons. But, through completing various missions, enough cash can be raised to purchase higher-quality aircraft. These superior planes are more agile, have improved resilience to damage and have a greater range of fire. Furthermore, the more advanced fighters can be armed with superior special weapons, such as napalm. The missions include attacks on sand bases, the nuclear submarine 'Seavet' and enemy supply camps, as well as seeing off groups of airborne 'bandits' who swarm-in on Area 88. The enemy is plentiful, and the pace is frantic. Shoot at everything on the screen that moves, and the allied forces might just come out on top......</p>"},{"name":"Uchū no Kishi: Tekkaman Blade","year":1993,"developer":"BEC Co., Ltd."},{"name":"Ultima: Kyōryū Teikoku","year":1995,"developer":"ORIGIN Systems, Inc."},{"name":"Ultima: Runes of Virtue II","year":1994,"developer":"ORIGIN Systems, Inc.","url":"5#U/Ultima%20-%20Runes%20of%20Virtue%20II%20%28NA%29.sfc","filesize":1048576,"score":"","genres":"Action > Top-down > Puzzle elements > Fantasy","desc":"<p><em>Ultima: Runes of Virtue II</em> is the sequel to Runes of Virtue. It maintains the action-RPG gameplay of the original. In this game, the Black Knight kidnaps Lord Tholden, simply out of boredom. Lord British sends you, the Avatar, out to recover Tholden and return peace to Britannia.</p><p>As in the first game you have the choice of selecting one of four characters. And again, there are three modes of difficulty.</p>"},{"name":"Ultima: The Black Gate","year":1994,"developer":"ORIGIN Systems, Inc.","url":"5#U/Ultima%20-%20The%20Black%20Gate%20%28NA%29.sfc","filesize":1048576,"score":5.5,"genres":"Action > Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Puzzle elements > Fantasy","desc":"<p>The Avatar is once again summoned to the land of Britannia, and this time he has to investigate ritual murders that have occurred in the town of Trinsic. Meanwhile, a new philosophical/social doctrine is spreading through Britannia, promoted by the mysterious Fellowship...</p><p>The story of this version of <em>Ultima VII</em> is essentially the same as in the original PC version. However, the dialogues have been greatly reduced and/or simplified. This applies also to the size of the game's cities and other locations, the amount of items to pick up, interior details, etc.</p><p>Combat also underwent significant changes. The battles in this version are action-based; the player has to click on the enemy repeatedly to win. Unlike the PC version with its party management, the Avatar is traveling and fighting solo in this release.</p>"},{"name":"Ultima: The False Prophet","year":1992,"developer":"ORIGIN Systems, Inc.","url":"5#U/Ultima%20-%20The%20False%20Prophet%20%28NA%29.sfc","filesize":1048576,"score":7.9,"genres":"Role-playing (RPG) > Top-down > 2D scrolling > Turn-based > Puzzle elements > Fantasy","desc":"<p>Several years after having restored Lord British to his rightful position as the monarch of Britannia, the Avatar is captured by demon-like creatures and placed on a sacrificial altar. His friends Iolo, Shamino and Dupre appear just in time to save him. In the Britannia castle, the Avatar learns that his abductors were gargoyles, a race of enigmatic creatures who have recently invaded Britannia and occupied the shrines of Virtue. As the Avatar embarks on a quest to liberate Britannia, he begins to gain insight into the gargoyles' true motives, and realizes that it is his duty to achieve peace and understanding between the two races.</p><p><em>Ultima VI</em> is notable for having a fully continuous world. There is no \"world map\" in the game; all the locations are seamlessly connected to each other, turning the game world into an open environment. Compared to the previous installments in the series, the game focuses more on quests and exploration rather than on combat. The latter no longer involves separate screens; battles occur during exploration, without any transitions. The turn-based system from the previous games has been preserved. </p><p>The interface has been re-designed, the original key-bound commands co-existing with selectable command icons and mouse-based interaction. The game world is more detailed than in the previous games, with a large number of various objects that can be manipulated or added to the inventory. Conversations are more extended, with a wider selection of topics, including many personal ones unique to specific characters. The player is also able to conduct extensive conversations with the Avatar's companions, as well as split the party and control the characters separately. Some important topics may be highlighted during text display, to facilitate further dialogue, which requires the player to type the desired conversation topics.</p><p>Like in the predecessors, the player is free to explore the game world from the beginning of the game, and visit locations in any order. Following the main quest and obtaining specific items and information is necessary to complete the story; however, the player can also opt to bypass a large part of it by using previous knowledge of the game or outside help. The FM Towns version has full voice acting for all the conversations, in English and in Japanese.</p>"},{"name":"Ultimate Fighter","year":1992,"developer":"Culture Brain Inc."},{"name":"Ultimate Mortal Kombat 3","year":1996,"developer":"Midway Manufacturing Company","url":"5#U/Ultimate%20Mortal%20Kombat%203%20%28NA%29.sfc","filesize":4194304,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Ultimate Mortal Kombat 3</em> combines the best of all the Mortal Kombats into a single cartridge. 23 playable characters are immediately available, such as Reptile, Cyrax, Scorpion, Sub-Zero, Jax, Katana, Sonya, and more. There are two bosses that are unlockable, as well as additional characters.</p><p>There is a variety of new levels, some of which are interactive. Characters can uppercut someone, causing them to hit the ground hard and crash through to the bottom floor, or they can knocked someone off a bridge, landing in a pit of spikes.</p><p>Players can go against the computer one-on-one, two-on-two, or take part in the 8-fighter tournament.</p><p>The DS version has a wireless one-one-one multiplayer mode and includes the Puzzle Kombat mini-game from Mortal Kombat: Deception.</p>"},{"name":"Ultra Seven","year":1993,"developer":"BEC Co., Ltd."},{"name":"Ultraman","year":1991,"developer":"BEC Co., Ltd.","url":"5#U/Ultraman%20%28NA%29.sfc","filesize":524288,"score":5,"genres":"Action > Side view > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>In the future, Earth must protect itself from alien invaders, a task handled by the Science Special Search Party. However, they are not alone in this endeavor. After crashing his ship on Earth while in pursuit of the evil alien Bemular, the super-being Ultraman is here to help whenever the attacking aliens prove too much for humanity alone to handle. Standing hundreds of feet tall with incredible strength and amazing abilities, he can only remain on Earth for a few minutes, and so must defeat his foes before his power drains completely.</p><p>Based on the popular television show from 1967, <em>Ultraman</em> directly follows the story of its source material. Cast in the role of the titular Ultraman, the player must defeat many of the same monsters that appeared in the original series. Taking the appearance of a 1-on-1 fighting game, Ultraman can punch, kick, and grapple his opponent, as well as use a variety of various special moves that must be charged. However, in order to actually defeat his opponent, Ultraman must deplete their continually-recharging life bar, and at that moment hit with his most powerful special attack: the Specium Beam. As the game continues, different enemies may even find ways to avoid this most formidable attack, and Ultraman must adapt... Each stage has a time limit of only three minutes, and there are three lives and no continues.</p>"},{"name":"Umihara Kawase","year":1994,"developer":"Studio Saizensen Ltd."},{"name":"Uncharted Waters","year":1992,"developer":"KOEI Co., Ltd.","url":"5#U/Uncharted%20Waters%20%28NA%29.sfc","filesize":1048576,"score":7.4,"genres":"Simulation > Strategy > Top-down > Naval / watercraft","desc":"<p>The Franco family used to be one of the influential houses of Portugal. That is until the head of the family sailed out of a disastrous voyage to find the kingdom of Prester John. The disarray that followed brought about an end to the nobility of the Franco name. 100 years have passed and Portugal has prospered through it's sailing and trading empires. Young Leon Fanco wishes to restore his family's good name and make a name for himself as a sailor. At the heart of his ambition is the fair lady, Christiana, who is desired by the likely heir to the kingdom. Towards that end, Leon has been working hard to secure finances for his first ship. With the first step of his dream complete, Franco sails out with his father's good friend as first mate, you're off to find fame, adventure and fortunes out on the sea and in uncharted waters.</p><p><em>Uncharted Waters</em> is a sailing and trading simulation. Your goal is initially to sail between ports and trade goods between them to make a profit. Along the way, you may be called upon by merchants and royalty to do specific tasks. Several different nations as well as pirates roam the sea and not all have good relations with one another. You can take as long as you want and explore as much of the world as possible to complete your ultimate task of marrying Christiana, which will require your fame rating to be quite high anyway. Available at most ports is a trader for cargo, a supply station for your crew's food and water as well as repairs, a shipbuilder, an item store and finally a pub for gaining information, crew and gambling.</p><p>All of the game progresses on an overhead-view, by sea you navigate your fleet by direction and can issue additional orders including landing on any piece of land to search for supplies. A variety of hazards live at sea including storms, other ships, seaweed and simply bad winds and currents.</p>"},{"name":"UNDAKE 30: Same Game Daisakusen - Mario Version","year":1995,"developer":"Hudson Soft Company, Ltd."},{"name":"Undercover Cops","year":1995,"developer":"Irem Corp."},{"name":"Unholy Night: The Darkness Hunter","year":2017,"developer":"Foxbat"},{"name":"Uniracers","year":1994,"developer":"DMA Design Limited","url":"6#Uniracers%20%28USA%29.sfc","filesize":2097152,"score":7.6,"genres":"Racing / Driving > Side view > 2D scrolling","desc":"<p>What do you get if you cross Sonic the Hedgehog with Tony Hawk's Pro Skater?</p><p>It might seem an odd combination, but it describes <em>Uniracers</em> perfectly. One of the more successful releases of the Super Nintendo's twilight era, Uniracers mixes platform-based high-speed racing, with crazy stunts and tricks.</p><p>The basic idea in most levels of the game is simple. Get your unicycle from A to B as quickly as possible, and finish ahead of your opponent. It's like Sonic, but with none of those pesky enemies, pointless power-ups and frustrating obstructions. In fact it doesn't sound like much of a game at all...</p><p>Here's the key, though. Tricks performed and landed during the race increase your speed. The better the trick, the greater your increase in speed will be.</p><p>Also, some levels are set in areas designed solely for stunts. Such levels require you to earn as many style points as possible, by doing tricks. These levels are against the clock, and a set points score, rather than an opponent.</p><p>Unicycles are stupid and difficult, and yet fun, once you get the hang of them. Much the same could be said about Uniracers...</p>"},{"name":"Untouchables, The","year":1994,"developer":"Ocean Software Ltd.","url":"7#The%20Untouchables%20%28USA%29.sfc","filesize":1048576,"score":6.2,"genres":"Action > 1st-person > Behind view > Side view > Top-down > 2D scrolling > Arcade > Platform > Shooter > Interwar > Licensed","desc":"<p>This version of the <em>The Untouchables</em> is different from the other versions. While the other versions are based on the Brian De Palma film starring Kevin Costner, this version is based on the 1993 remake of the original 1960's series that starred Robert Stack.</p><p>There are five different assignments (missions) to choose from, each with their own set time limit. The first mission is set in the over the shoulder, third-person perspective in an alleyway using a shotgun to take down mobsters hiding in buildings. The second mission is a 2D side-scroller set in a warehouse where the player must defend against gangsters and pick up counterfeiting plates scattered throughout a warehouse. The third mission is a side-scrolling shooter, located on a dock, where the player uses a tommy gun to take out various bad guys scattered throughout the stage. The fourth mission is a top-down shooter located at the top of a courthouse where the player must rescue hostages while defending against various bad guys. The fifth and final mission is a first-person shooter located on the rooftops of Chicago against Al Capone himself. </p><p>The story is told between missions through old-time looking newspapers that report on the success or the failure of the player's mission.</p>"},{"name":"Urban Strike","year":1995,"developer":"Foley Hi-Tech Systems","url":"7#Urban%20Strike%20%28Europe%29.sfc","filesize":2097152,"score":7.5,"genres":"Action > Diagonal-down > Isometric > Shooter > Helicopter","desc":"<p><em>Urban Strike</em> is the third in EA's long running series of helicopter action games. An evil genius named H. R. Malone has started a cult and managed to gather millions of followers. Malone is using his influence and wealth to build a super weapon with which he will overthrow the government. You will once again suit up and take control of various types of helicopters to stop Malone's evil scheme.</p><p>Urban Strike is the first, and only, game in the Strike series to feature non-vehicular combat. In some levels you will leave your helicopter and proceed on foot.</p>"},{"name":"Utopia: The Creation of a Nation","year":1993,"developer":"Celestial Software","url":"5#U/Utopia%20-%20The%20Creation%20of%20a%20Nation%20%28NA%29.sfc","filesize":524288,"score":8,"genres":"Strategy > Isometric > Real-time > Managerial / business simulation > Sci-fi / futuristic","desc":"<p><em>Utopia</em> takes the Sim City gameplay concept and adds a military element to it. The game is set in the distant future, where your job is nothing less than Colony Administrator for a new settlement on some far-flung planet. Your aim is to provide the highest Quality of Life rating for the colonists. </p><p>You do so by ensuring that there is enough life support, power, housing, employment, police and entertainment to keep the citizens of your colony happy. Hindering your goal are random events such as solar eclipses (which can render your solar panels inactive) and also a different, hostile alien race that inhabits the planets in the many scenarios at offer. </p><p>Not only do you have to be a good mayor but you also have to be a good general. Resources must not only be attributed to civilian research but into weapons research, intelligence and the building of tanks and spaceships, if you wish to survive long enough to see your colony flourish into a metropolis. As a rule, you will have built a strong colony before the aliens come, but the final push towards a QOL of 80% or higher can only be achieved once there is no outside threat.</p>"},{"name":"Uwol: Quest for Money","year":2013,"developer":"The Mojon Twins"}]