[{"name":"Vegas Stakes","year":1993,"developer":"Dice Co., Ltd.","url":":Vegas Stakes (USA)","filesize":761631,"score":6.5,"genres":"Gambling > 1st-person > Top-down > Fixed / flip-screen > Cards / tiles > Menu structures > Licensed","desc":"<p>In this Casino simulator, you have decided to be a high roller. Followed by four friends, their main objective is to risk the Lady Luck and become a high roller in Las Vegas, place of luxurious and refined gambling houses.</p><p>With only $1000 in your pocket, feel free to explore five different casinos (The Hideaway, Golden Paradise, Buffalo Head, The 2020 and later, the Laurel Palace), making the possible and impossible to increase its banking account and reach the goal of <strong>$ 10 million.</strong></p><p>To be successful in this millionaire-journey, you'll have different options of how to earn lots of money: Blackjack, Slots, Roulette, Craps or Seven-Card Stud Poker.</p><p>Randomly, some people will chat with you, asking for some borrowed money, selling value objects and many other goodies: depending of the chatting, you'll be able to gain benefits (money increased) or damages (have half of its money stolen).</p><p>During this tough \"mission\", a friend (chosen by you in the Casino room) will help you, explaining in details the rules of the current game or offering some wager advices.</p>"},{"name":"Venom - Spider-Man: Separation Anxiety","year":1995,"developer":"Software Creations Ltd."},{"name":"Virtual Bart","year":1994,"developer":"Sculptured Software, Inc."},{"name":"Virtual Soccer","year":1994,"developer":"Probe Software Ltd."},{"name":"Vortex","year":1994,"developer":"Argonaut Software Ltd.","url":":Vortex (USA)","filesize":330150,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Vortex</em> was one of the few games designed to use the SNES Super FX 1 chip, a custom-made graphics accelerator RISC processor. The game is a 3D shooter similar to Star Fox by the same development studio, but with some subtle differences. Players can morph their vehicle at any time from the standard walker to a sonic jet, a land burner and a defensive hard shell, each with their own weapons, strengths and weaknesses.</p><p>The player is cast as a soldier fighting the Aki-Do Forces, an evil empire bent on taking over the entire universe. To stop them, the player has access to an experimental mech, the Vortex, to travel the seven worlds of the Aki-Do system and destroy the bases.</p>"}]