[{"name":"WakuWaku Ski Wonder Spur","year":1995,"developer":"Human Entertainment, Inc."},{"name":"War 2410","year":1995,"developer":"Advanced Productions, Inc.","url":":War 2410 (USA)","filesize":877115,"score":"","genres":"Strategy > Top-down > Turn-based > Mecha / giant robot > Tank > Sci-fi / futuristic","desc":"<p>In the year 2003 geneticists tried to create the perfect soldier. Something went wrong however, and three new life forms turned against their creators: Brutally savage Orcs, cybernetic androids called Cromes and genetically enhanced human soldiers code named M.A.R.S. Players take control of a secretly assembled force and must try to restore order.</p><p><em>War 2410</em> is a turn-based strategy game similar to Famicom Wars. Players move various units, such as mechs, tanks, troops or planes over a grid-map. Units differ in movement and attacking range. Some ground units cannot attack air units and vice versa. Terrain also affects combat as some types of terrain, like trees or buildings improve a units defense. Attacked units always counterattack as long as the attacker is within range. The goal of most missions is to destroy all enemy units, while it is sometimes necessary to capture the enemies' bases. Units cannot not be improved or modified and every mission starts with all units already in place.</p>"},{"name":"War 3010: The Revolution","year":1996,"developer":"Advanced Productions, Inc.","url":":War 3010 - The Revolution (USA)","filesize":455750,"score":"","genres":"Strategy > 1st-person > Top-down > Sci-fi / futuristic","desc":"<p>An alien race named Kyllen has enslaved humanity. On the planet Joyec, rebels managed to take the Kyllen by surprise and seize one of their battle fleets. The player must now guide their efforts in trying to throw over the Kyllen. </p><p><em>War 3010</em> is a turn-based strategy game in which players move spaceships over a grid-map. There are different types of ships, such as Fighters, Marauders or Destroyers, that differ in movement range and weapon power. Weapon power is also divided into long and short range, i.e. a ship that is very good at long range combat may have poor close ranged weapons etc. During combat, the following actions can be chosen from a menu: Movement, Attacking, terrain information, unit information, a map of the battlefield, overview of all units, including those of the enemy; and an option to scout planets for technology. When an attacking unit is within range of an attacked unit, the attacked unit will always counter-attack (if it isn't destroyed first). In later missions it becomes possible to scout planets for technology and upgrade ships, as well as take control of space stations to build new ships. Ships cannot be taken into the next mission however.</p>"},{"name":"Wario's Woods","year":1994,"developer":"Intelligent Systems Co., Ltd.","url":":Wario's Woods (USA)","filesize":606523,"score":7.5,"genres":"Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Tile matching puzzle > Direct control > Fantasy","desc":"<p><em>Wario's Woods</em> is a puzzle game similar to Tetris or Columns, but with a twist. Instead of directly controlling the monsters and bombs that are falling down, the player controls Toad who has to carry around stacks of monsters and bombs and to combine them in the right way. One bomb plus at least two monsters of the same color have to be combined to make them disappear. If five or more objects are cleared at the same time, a diamond will appear. Destroying the diamond will clear all monsters of the diamond's color.</p><p>There are four different ways to pick up objects. The A button lets Toad pick up the whole stack that is in front of him, the B button lets him only pick up one object, even if it's in the middle of a stack, the Y button lets him kick a monster or bomb that's in front of him and the X button places him on top of the stack that he is carrying. He can also run up walls and stacks to catch falling objects out of the air or to pick up certain parts of a stack.</p><p>There are 5 different modes of play: a \"Round Game\" in which Toad has to clear numerous levels, a match versus a computer controlled opponent, a two player mode, a \"Time Race\" mode, and finally, an extensive training mode.</p><p>There are some differences between the SNES and NES versions. Due to a lack of buttons, controls are a little different in the NES version (although all the moves from the SNES version are present). Also, there is no vs. mode against the computer, but the \"Round Game\" mode features two modes of play: one that includes boss-fights on every level ending with a 9.</p>"},{"name":"Warlock","year":1994,"developer":"Realtime Associates, Inc.","url":":Warlock (USA)","filesize":1350402,"score":6.3,"genres":"Action > Side view > 2D scrolling > Platform > Puzzle elements > Horror > Licensed","desc":"<p><em>Warlock</em> is based on the 1989 movie of the same name.When the sun aligns with the moon once every millennium, druid guardians summon their magic of their runestones to prevent the rebirth of the Warlock. The runestones are scattered through time and across the continents and you must find them before the Warlock does.</p><p>The gameplay is simple. You go through different stages fighting off creatures and then finding the runestones. You fight off enemies by simply blasting them with this energy, using this orb you have with you, or you can use a spell to kill them. There are some puzzles in the game too. Some of the battles with the tougher enemies require some strategy to defeat them.</p>"},{"name":"WarpSpeed","year":1992,"developer":"Accolade, Inc.","url":":WarpSpeed (Europe)","filesize":461881,"score":5.3,"genres":"Action > 1st-person > Shooter > Direct control > Space flight > Sci-fi / futuristic","desc":"<p>The player takes control of a starpilot with a mission to defend star bases from a fleet of invading alien warships. The game takes place from a cockpit perspective from one of four starfighters; the Stinger, Striker, Stalker,or Slasher. The game has 7 battle scenarios and a 4 scenario campaign mode. </p><p>The starfighter ships come equipped with a computer, engine, shield, weapons, and missiles which can be damaged from enemy combatants or space debris like asteroids. The ship also comes with a Long Range Scanner, which shows the locations of enemies on the map. The map itself is made up of 64 square sections. Finally, the ship also has a Hyperwave Reciever, that lets the player communicate with both the aliens and the player's base.</p>"},{"name":"Waterworld","year":1995,"developer":"Ocean Software Ltd."},{"name":"Wayne Gretzky and the NHLPA All-Stars","year":1995,"developer":"Semi Logic Entertainments, Inc.","url":":Wayne Gretzky and the NHLPA All-Stars (USA)","filesize":1159253,"score":6.4,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>One of the many hockey games released, this version not only let the player control Gretzky, but other major players of the time as well such as Mario Lemieux, Eric Lindros, Mark Messier among many others, 600 total. It also features the 26 NHL teams at the time as well as 6 International teams to choose from.</p><p>The gameplay is similar to many other hockey games with the standard modes such as <em>Exhibition</em>, <em>Season</em>, <em>Playoffs</em> or even a \"Just Play\" option that instantly took the player to a random game. There is also a \"Simulation Mode\" that gives the game an authentic feel complete with penalties or an \"Arcade Mode\" that was more action oriented and with less rules. A battery back-up keeps extensive track of stats and has a two-player option as well.</p>"},{"name":"Wayne's World","year":1993,"developer":"Gray Matter Inc.","url":":Wayne's World (USA)","filesize":781958,"score":4.6,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Licensed","desc":"<p>\"Wayne's World, Wayne's World! Party time! Excellent! Woo, woo, woo!\"</p><p>It's Friday, it's 10:30 and like usual, Wayne and Garth are presenting their TV show. First they start off by reading a top-10 list of the worst games they recently played at the arcade. Then Wayne accounts on how he and Garth were suddenly sucked into a video game, and Garth was kidnapped by the mysterious Zantar. \"Weeuuu, weeuuu, weeuuu!\" FLASHBACK, and now you're suddenly in control of Wayne as he must embark upon a quest to save his good pal Garth.</p><p>Not to be confused with the DOS license, this Wayne's World is a platform- style game. You must jump, fight and rock your way through 4 different levels which include Kramer's Music Store, Stan Mikita's Donut Store, Gas Works and Surburbia. Using Wayne's guitar as your sonic weapon, it's most excellent noise will bring death to various enemies. Will you save Garth from the evil purple clutches of Zantar? SCHWING!</p>"},{"name":"WCW SuperBrawl Wrestling","year":1994,"developer":"Beam Software Pty., Ltd.","url":":WCW Super Brawl Wrestling (USA)","filesize":1076616,"score":"","genres":"Sports > Top-down > Wrestling > Licensed","desc":"<p><em>SuperBrawl</em> is one of the earliest wrestling titles with the WCW (World Championship Wrestling) license. It has 12 different professional wrestlers to choose from including Sting, Ric Flair, Big Van Vader, The Steiner Brothers (Rick &amp; Scott) to name a few. The standard moves are present including punches, kicks, pile drivers and power slams including special unique finishers for each wrestler.</p><p>The modes include Single and Tag Team matches that support a two-player option with the ability to customize options including time limits and rules. Passwords are also present so that players can pick up and play at their leisure. The view is a 3/4 overhead view with the ring catty-cornered on the screen similar to Fire Pro Wrestling. Tony Schiavone also lends his voice to the game for in-game commentary.</p>"},{"name":"We're Back!: A Dinosaur's Story","year":1993,"developer":"Visual Concepts, Ltd.","url":":We're Back! - A Dinosaur's Story (USA)","filesize":615605,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>We're Back!: A Dinosaur's Story</em> is different from its Genesis counterpart. This version features characters from the movie, but does not follow the storyline of the movie. In this version, Professor Screw Eyes has kidnapped Louie and Cecilia. Hearing of this, Captain Neweyes and the dinosaurs launch into action to save their friends by traveling through various time periods.</p><p>The gameplay is a side-scroller that has the player take control of Rex, traveling throughout the levels avoiding traps and defeating various enemies scattered throughout the stages (five in all). Rex can also receive help from his dinosaur pals, Elsa, Woog, Vorb, and Dweeb from time to time. There are also power-ups that increase and replenish Rex's health.</p>"},{"name":"WeaponLord","year":1995,"developer":"Visual Concepts Entertainment, Inc.","url":":WeaponLord (USA)","filesize":2222072,"score":7.4,"genres":"Action > Side view > Arcade > Fighting > Fantasy","desc":"<p>A barbarian battleground. Seven different warriors, eached armed with a unique weapon set forth on a fighting game quest where they will clash and conflict with one another in this fighting game from Namco. Their ultimate foe is the mysterious Demonlord. An early relative of the popular Soul Calibur series, the main claim to fame of this game is the weapon play. Blocking and combos are present along with special \"frenzies\" of increased attack and death combos. The backgrounds are all hand drawn and meticulously detailed. Each character carries their own storyline with them between arenas, jungles and firey mountains on a quest to oppose the Demonlord.</p>"},{"name":"Wheel of Fortune","year":1992,"developer":"Imagitec Design Inc.","url":":Wheel of Fortune (USA)","filesize":316402,"score":5.7,"genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune</em> is based on the television game show of the same name. The game features 4,500 different word puzzles for the player to solve with Vanna White turning the tiles on the board.</p><p>The game is played between 3 contestants (either controlled by human or computer players). The game contains six contestant pictures to select from to represent the contestants who will be playing. As in the show, players can spin the wheel, buy a vowel, or solve the puzzle. The game consists of three rounds of word puzzles with the goal being to make the most money by the end of all of these rounds in order to be chosen to play for one of the grand prizes in the bonus round.</p><p>Both platforms feature minor graphical differences from each other. Other differences include the Genesis version of the game also has an options screen where players can select the difficulty level of the computer opponents, how fast the timer is, listen to sounds from a sound test, and select which control pad player 2 and 3 will use. The Super Nintendo version lets the player select a different puzzle category if they don't like the current one.</p><p>This is the 16-bit version of Wheel of Fortune: Featuring Vanna White that now features more puzzles, digitized photography that came from the actual set of the gameshow, and contains digitized speech clips of Vanna White.</p>"},{"name":"Wheel of Fortune: Deluxe Edition","year":1994,"developer":"Imagitec Design Inc.","url":":Wheel of Fortune - Deluxe Edition (USA)","filesize":353792,"score":"","genres":"Puzzle > Side view > Fixed / flip-screen > Game show / trivia / quiz > Word construction > Licensed","desc":"<p><em>Wheel of Fortune: Deluxe Edition</em> is an updated sequel to its predecessor that features 4,000 different puzzles and the standard features of Wheel of Fortune such as the bonus round. It also has a digitized likeness of Vanna White along with her voice. There are also digitized photos of people that can be chosen to represent the player. Players can go up against friends or compete against the computer A.I.</p>"},{"name":"Where in the World is Carmen Sandiego? (Enhanced)","year":1993,"developer":"Brøderbund Software, Inc."},{"name":"Where in Time Is Carmen Sandiego?","year":1992,"developer":"Brøderbund Software, Inc.","url":":Where in Time is Carmen Sandiego (USA)","filesize":773892,"score":6.5,"genres":"Educational > Puzzle > Menu structures > Geography > History > Detective / mystery","desc":"<p>Carmen Sandiego and her gang are loose once again, and it is the players job to capture her! This time round the player not only has to find where she is, but also when she is. Traveling to various locations, they need to assemble clues by questioning witnesses and searching locations to close in and capture Carmen Sandiego. Included with the game is The New America Desk Encyclopedia to help make clues more meaningful (and act as a form of copy protection!).</p>"},{"name":"Whirlo","year":1992,"developer":"Nova Co., Ltd."},{"name":"Whizz","year":1996,"developer":"Flair Software Ltd.","url":":Whizz (USA)","filesize":572035,"score":6.4,"genres":"Action > Isometric > Platform","desc":"<p><em>Whizz</em> is one of the few 3D platformers to use an isometric viewpoint. The controls reflect this, with moving the controller to the right actually moving the character down and right, moving it down and right moving the character down directly, and so on. Each level is played out against a time limit, and the paths through the level aren’t always clear-cut. There are four different types of doors, each of which needs a particular icon to pass (the icons represent the door type, such as ice or bricks, rather than hot water or a key, or anything you’d logically expect to clear the path). You can avoid the baddies, which may be the best option, as killing them costs you some energy –this reduces the significance of the points system.</p>"},{"name":"Wild Guns","year":1994,"developer":"Natsume Co., Ltd.","url":":Wild Guns (Europe)","filesize":709251,"score":8,"genres":"Action > Behind view > Arcade > Rail shooter > Sci-fi / futuristic > Steampunk > Western","desc":"<p><strong>KABOOM!</strong>  </p><p>Annie &amp; Clint, two gunslingers, arrive at Carson City and get caught up in a gunfight. It's raining bullets and there are explosions everywhere. After an intense battle they enter the saloon where they dispose of every cowboy in sight while redecorating the interior. Our heroes flee the scene by climbing on the roof, but what's that sound? ... it's a <em>HUGE</em> robot!</p><p><em>Wild Guns</em> is a shooter with a western &amp; Sci Fi theme. Gameplay is somewhat similar to the Time Crisis &amp; House of the Dead games, with the exception that the game isn't played from a first-person perspective but from a third-person perspective. You control your on-screen character as well as the aiming crosshair (at the same time). Select either Clint (yes, inspired by Mr. Eastwood) or Annie and shoot down tons of enemies while dodging bullets and jumping over incoming rockets.</p><p>After the Carson City level, the action continues in Desolation Canyon, an ammunition depot, a gold mine and a armored train (you can play these levels in any order). Finally there's a showdown with the big bad guy. Each of the 6 levels is divided into 3 sublevels. The 3rd one is always a boss-battle. During the game your standard weapon can be temporarily upgraded by collecting power-ups. If you want to create some serious mayhem you can detonate one of your bombs. Almost any object in the background can be destroyed.</p><p><em>Wild Guns</em> has a two-player co-op mode. There's also a shooting gallery mode in which you can't die; this one is all about scoring as many points as possible.</p>"},{"name":"WildSnake","year":1994,"developer":"Realtime Associates, Inc.","url":":Wild Snake (USA)","filesize":410461,"score":7.3,"genres":"Puzzle > 3rd-person (Other) > Side view > Real-time > Falling block puzzle","desc":"<p><em>WildSnake</em> is a puzzle game in which the player must manage falling snakes in a confined space and keep the snakes from reaching the top of the space. Snakes fall and slither until they reach a resting spot on the floor of the space. A snake will destroy any other snakes of the same color and pattern that it touches with its head on the way down, which often has the chain effect of loosening the pile of snakes so that all the snakes slither into new positions, possibly eliminating even more snakes.</p><p>The game is played against a selection of backgrounds including desert, forest, water, or grass. Further, there are 7 game grids including the standard grid (a tall rectangle), X, plus, flask, Diabolo (an hourglass pattern), T-square, and obstacle (with a number of intermediate blocks).</p><p>The player starts out as a nestling and earns higher and higher distinctions taken from the snake realm (garter snake, water snake, boa, mambo, python, king cobra, etc.) as more snakes are cleared. Also, as the level increases. more types of snake patterns must be handled. Sometimes, there is a flashing red snake that eliminates the first snake it touches. Further, there is occasionally an unstoppable snake that barrels down to the bottom of the space, eliminating all snakes in its path.</p><p>The game can be played with 1 or 2 players in either easy, normal or hard mode. In the single player mode, the player can choose whether the preview showing the next snake will be shown. In 2-player mode, there is always a preview window. In fact, there is a queue of 3 snakes between the 2 player spaces from which the next snake is drawn. As a bonus during competition, multiple snake eliminations by one player result in obstacles appearing in the space of the opposing player.</p>"},{"name":"Williams Arcade Classics","year":1996,"developer":"Digital Eclipse Software, Inc.","url":":Williams Arcade's Greatest Hits (USA)","filesize":275772,"score":6.9,"genres":"Action > Compilation > Side view > Top-down > Arcade > Shooter","desc":"<p><em>Williams Arcade Classics</em> is a compilation that includes the following games:</p><ul><li>Defender</li><li>Defender II</li><li>Joust</li><li>Robotron: 2084</li><li>Sinistar</li></ul><p>The PC, PlayStation, and Dreamcast versions also contain Bubbles. The PC and Playstation versions contain FMV supplements, including interviews with the original programmers.</p>"},{"name":"Wing Commander","year":1992,"developer":"ORIGIN Systems, Inc.","url":":Wing Commander (Europe)","filesize":817351,"score":7.9,"genres":"Action > Simulation > 1st-person > Space flight > Vehicular combat > Sci-fi / futuristic","desc":"<p>The Confederation have been at war with the Kilrathi for the past 20 years, and you're just now joining the Vega campaign. You're a 2nd Lieutenant just out of the Academy, with some good work under your belt. You're posted to Tiger's Claw, the flagship of the Confederation Fleet. Will you help the Confederation to victory, or go down in infamy? </p><p><em>Wing Commander</em> is a space combat simulator interspersed with shipboard dialogs. Onboard the ship, you can save/load game, visit the bar to get the latest gossip, or go on to the next mission briefing, and the 3D space combat part. </p><p>The 3D space combat has you sitting in the cockpit, where you control the craft like roll, turn, up/down, afterburner, as well as fire guns and launch missiles. There are four different crafts on the Confed side, each with different flight characteristics and armament. You will have a wingman on each mission, and you should keep the wingman alive as the wingman will help you if you issue the right orders. You can also taunt the enemy. You'll be fighting several different types of enemy fighters and capital ships, and even combat a few Kilrathi aces. </p><p>When the mission is complete, land back onboard the ship and get ready for the next one. The campaign tree has both winning and losing paths.</p>"},{"name":"Wing Commander: The Secret Missions","year":1993,"developer":"ORIGIN Systems, Inc.","url":":Wing Commander; The Secret Missions (Europe)","filesize":814754,"score":7.4,"genres":"DLC / Add-on > Story / mission","desc":"<p>In the first Secret Missions add-on to Wing Commander, the TCS Tiger's Claw responds to a distress call from the Terran colony in the Goddard System. Once they arrive, they find that the colony has been completely destroyed by a new Kilrathi secret weapon, with no survivors. The Tiger's Claw is then ordered to pursue the Kilrathi fleet into their own space and destroy this new weapon - without reinforcements or the ability to resupply...</p><p>The Secret Missions campaign adds 16 new missions to fly. Unlike the main game, there is no branching mission tree - progress is linear. There are also several new ships: a Confederation corvette, Kilrathi and Confederation freighters and of course the Kilrathi dreadnought with the secret weapon itself.</p><p>Characters from the main game can be transferred into the add-on, which also includes a \"Mission Selector\" to fly any of the missions from the original game.</p>"},{"name":"Wings 2: Aces High","year":1992,"developer":"Acme Interactive, Inc.","url":":Wings 2 - Aces High (USA)","filesize":292266,"score":6.8,"genres":"Action > Simulation > Behind view > Top-down > Direct control > Flight / aviation > Vehicular combat > World War I > War","desc":"<p>The game takes place during World War 1. Choose one of the five allied fighter pilots to do battle against the Central Powers. The game consists of 20 missions with the final one culminating with a battle between the player and \"The Red Baron\".</p><p>Missions are basically the same as in its' predecessor Wings. There are bombing missions where you have to take out targets that were circled in an aerial photograph, strafing runs where you get to blast anything that you fancy blasting with an unlimited supply of ammo, and of course the main part: dogfights in the sky.</p><p>If a mission is completed successfully, the player can power up the successful pilot in four skill categories: flying, shooting, mechanics, and stamina. A failed mission can lead to either a dishonorable discharge or death for the pilot.</p>"},{"name":"Winning Post","year":1993,"developer":"KOEI Co., Ltd."},{"name":"Winter Gold","year":1996,"developer":"Funcom Oslo A/S"},{"name":"Winter Olympics: Lillehammer '94","year":1994,"developer":"U.S. Gold Ltd."},{"name":"Wizard of Oz, The","year":1993,"developer":"Manley & Associates, Inc."},{"name":"Wizardry I-II-III: Story of Llylgamyn","year":1999,"developer":"Sir-tech Software, Inc."},{"name":"Wizardry V: Heart of the Maelstrom","year":1992,"developer":"Sir-tech Software, Inc."},{"name":"Wizardry: Bane of the Cosmic Forge","year":1995,"developer":"Sir-tech Software, Inc."},{"name":"Wolfchild","year":1993,"developer":"Core Design Ltd.","url":":Wolfchild (USA)","filesize":443418,"score":6.8,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p>Dr. Kal Morrow, expert in genetic research and creation of human-animal hybrids, has been kidnapped and his family brutally murdered by the terrorist organization CHIMERA. His surviving son Saul takes it upon himself to avenge his family. Using his father's research, he turns into a man-wolf and sets out to find CHIMERA's base and defeat their leader Karl Draxx.</p><p>As Saul, it is your job to traverse five different areas on your way to Draxx. When Saul collects enough power-ups, he turns into his wolf form and gains a special psychic shot attack, which can be improved by collecting further power-ups. However, if Saul loses health, he turns back into his human form and only has his fists to fight the numerous enemies.</p>"},{"name":"Wolfenstein 3D","year":1994,"developer":"id Software, Inc.","url":":Wolfenstein 3D (Europe)","filesize":561343,"score":7.4,"genres":"Action > 1st-person > Shooter > World War II","desc":"<p>This adaptation of the first-person shooter Wolfenstein 3D is not a straight port, but a remix with substantial changes as well as new additions.</p><p>While the basic gameplay of exploring levels, shooting enemies, collecting treasures, keys and power-ups remain the same, only half of the original game's 60 levels have been retained. Each of those 30 levels (grouped into six missions, with two levels being secret ones) is a simplified version of an original level. The end bosses for the missions are taken from both <em>Wolfenstein 3D</em> and its prequel, Spear of Destiny.</p><p>Other changes from the original include new power-ups: an ammo box (taken from <em>Spear of Destiny</em>) and backpack that increases the maximum amount of ammo that can be carried.</p><p>The original's weapons (knife, pistol, machine gun, chaingun) all return, but there are also two completely new tools of destruction: a flame thrower and a rocket launcher.</p>"},{"name":"Wolverine: Adamantium Rage","year":1994,"developer":"Bits Corporation","url":":Wolverine - Adamantium Rage (USA)","filesize":1215275,"score":6,"genres":"Action > Side view > Beat 'em up / brawler > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>Wolverine: Adamantium Rage</em> is a side-scrolling platform beat-em-up. Wolverine, aka Logan, searches desperately for clues about his past and his identify. Using the computers of the X-Men mansion, Wolverine soon receives coordinates to somewhere in Canada and is told to come alone. As the missions and levels progress he finds clues which lead him inevitably on to the next level.</p><p>The main character has a very large selection of combat moves, and also has great agility and the ability to climb walls using his wrist-spikes. Bonus pickups are provided in the level maps. Many of them are hidden very thoroughly which invites the player to use Wolverine's agility and climbing abilities to explore every corner. The levels include a secret lab, a ninja training camp, a hallucinogenic world, and others.</p>"},{"name":"Wonder Project J","year":1994,"developer":"Almanic Corp.","url":":Wonder Project J - Kikai no Shonen Pino (Rev 1.04)","filesize":1976919,"score":"","genres":"Role-playing (RPG) > Simulation > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>There was once a great scientist and inventor named Gepetto, who lived on an island farm together with his creations, his robotic helper, the pixie Tinker, and his pet animals. His greatest creation was an artificial boy named Pino. No, he was not carved from wood, but looked just like a real boy - only he could turn his head 360 degrees. But Gepetto was arrested for an unknown reason. The boy Pino looks like a real boy, but he was completed just a few moments ago, and he knows absolutely nothing. All he can do is wander aimlessly, poking objects and turning his head. It is up to the player to make Pino a real man!</p><p><em>Wonder Project J: Kikai no Shōnen Pino</em> is a simulation game with role-playing elements. The player must use the robotic pixie Tinker to educate Pino. It is possible to move Tinker around, examining objects and collecting them in an adventure-like fashion. Pino will automatically follow her to the direction she is facing, but will continue walking until the player stops him. He will also pick objects and make his own \"experiments\" with them. The goal is to train Pino in various disciplines. His stats can be raised in a RPG style: reading books increases his intelligence, throwing a ball increases his dexterity, and so on. By praising or scolding Pino, the player will gradually make him understand what should be done and what shouldn't.</p>"},{"name":"Wordtris","year":1992,"developer":"Spectrum Holobyte, Inc.","url":":Wordtris (USA)","filesize":400852,"score":6.7,"genres":"Action > Puzzle > Fixed / flip-screen > Falling block puzzle > Word construction > Direct control","desc":"<p>In the spirit of Tetris comes <em>Wordtris</em>. Falling letters must be placed in order to form words in order to clear them away. Occasionally bombs will fall which you may use to clear away a single letter or an entire stack of them, depending on the type of bomb. The larger the words you form, the higher points you receive. If you clear enough words without filling up the screen, you move on to the next level.</p>"},{"name":"World Class Rugby","year":1993,"developer":"Denton Designs"},{"name":"World Cup USA 94","year":1994,"developer":"Tiertex Design Studios"},{"name":"World Heroes","year":1993,"developer":"Alpha Denshi Kōgyō Co., Ltd.","url":":World Heroes (USA)","filesize":1380838,"score":6.8,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control","desc":"<p>An alien entity known as Geegus threatens the Earth in the year 3091. As all of Earth's forces have been defeated, a scientist uses his recently-built time machine to find the greatest fighters of different eras to compete against Geegus.</p><p><em>World Heroes</em> is a versus fighting game. It features a cast of characters from different countries and time periods, ranging from ninjas to a cybernetic super-soldier. The characters are based on real historical figures, but are endowed with supernatural powers. The player selects a character who then fights his way through standard one-on-one matches or takes on an opponent in a Deathmatch, where spiked walls and landmines add to the danger.</p>"},{"name":"World Heroes 2","year":1994,"developer":"ADK Corporation","url":":World Heroes 2 (USA)","filesize":2095201,"score":7.4,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting","desc":"<p>The time-traveling tournament fighters are back! The original eight characters from the previous game return, along with six new characters hand-picked from several different eras and locations all through time. Who or what is behind this new tournament? In order to find that out, the strongest fighter must defeat all the opponents, win the title, and face the one who has all the answers.</p><p>The second <em>World Heroes</em> game features new stages and music, as well as improved animation and graphics. Fighters can now reflect projectile moves at their opponents, and reverse normal throws if the player's timing is right. The original game's Death Match mode is also back, but with a new feature - the life bar will increase or decrease as the fighter inflicts or receives damage. If the player manages to get his fighter's life bar to 100%, the enemy will lose.</p>"},{"name":"World Masters Golf","year":1995,"developer":"Arc Developments"},{"name":"Worms","year":1996,"developer":"Team17 Software Limited","url":":Worms (Europe)","filesize":640146,"score":7.6,"genres":"Strategy > Side view > 2D scrolling > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms</em> is a turn-based strategy game. It features up to 4 teams of 4 worms, aiming to destroy the others on a generated terrain. Each worm has 100 hitpoints and dies when his hit points fall to 0. Upon death, a worm explodes, causing damage to everyone around.</p><p>Gameplay is turn-based. Each turn, the player can control one specific worm from his team. The worm can crawl left and right or jump. However, there is a time limit to make a move; also, if the worm falls from a great height, it loses health and the turn ends immediately; and if a worm falls into water or offscreen, it dies. Each turn, a worm can also make a single attack: the player can aim up and down, choose a weapon and then fire it. After attacking, the turn ends. </p><p>There are a lot of weapons available - the standard ones as bazookas (which are affected by the (random) wind settings and gravity) and grenades. The others include a Fire Punch, dynamite, airstrikes, and utilities such as ropes and girders.</p><p>There are 10 styles of terrain, ranging from forests and deserts to Candy land and the moon (complete with affected gravity). Shots leave craters in the ground, and complex tunnels can be formed.</p>"},{"name":"Wrecking Crew '98","year":1998,"developer":"Pax Softnica"},{"name":"WWF Raw","year":1994,"developer":"Sculptured Software, Inc.","url":":WWF Raw (USA)","filesize":2482670,"score":6.8,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>WWF Raw</em> is a professional wrestling game featuring up to twelve superstars (ten in the GameGear, eight in the GameBoy version) from the World Wrestling Federation: Bret \"Hit Man\" Hart, Bam Bam Bigelow, 1-2-3 Kid, Diesel, Doink, Lex Luger, Luna Vachon, Owen Hart, Razor Ramon, Shawn Michaels, Undertaker, and Yokozuna.</p><p>In this game, player-controlled wrestlers attempt to pin the opponents to the mat by reducing their power meter until they can fight no more. There is a large number of moves to perform, including turnbuckle maneuvers and \"illegal\" acts such as hitting the opponent with a metal folding chair.</p><p>This game supports up to four simultaneous players, and has the following modes: One-on-One, Tag Team, Bedlam, Survivor Series, Royal Rumble, Raw Endurance Match, and Rematch.</p>"},{"name":"WWF Royal Rumble","year":1993,"developer":"Sculptured Software, Inc.","url":":WWF Royal Rumble (USA)","filesize":1660642,"score":7.2,"genres":"Sports > Diagonal-down > Wrestling","desc":"<p>Control one of twelve World Wrestling Federation stars in a \"no holds barred brawl\" -- in other words, do whatever moves you want, from choke holds, piledrivers, and even chair slams, until your opponent is knocked out. You can even go outside the ring if you like. Several modes of play are available, including one-on-one, tag team (two-on-two), and three-on-three tag team. You can play as the following WWF wresters: Bret Hart, Razor Ramon, Randy Savage, Shawn Michaels, The Undertaker, Tatanka, Mr. Perfect, Crush, Ric Flair, Yokozuna, Ted Dibiase, and Lex Luger.</p>"},{"name":"WWF Super WrestleMania","year":1992,"developer":"Sculptured Software, Inc.","url":":WWF Super WrestleMania (USA)","filesize":761626,"score":7,"genres":"Sports > Diagonal-down > Wrestling > Licensed","desc":"<p><em>WWF Super WrestleMania</em> is a wrestling game that uses rules and wrestlers from the World Wrestling Federation (WWF). The game introduces a characteristic \"tug of war\" gameplay style, which involves two wrestlers grappling each other until one of them has the upper hand. The player has to repeatedly tap a button to execute this move. All the wrestlers share the same set of typical WWF moves such as scoop slams, suplexes, hip tosses, dropkicks, clotheslines, and elbow drops. The Genesis (MegaDrive) version adds signature moves unique to each characters.</p><p>The game's modes are one-on-one, tag team, and Survivor Series matches (four-on-four). The Genesis version also has a WWF Championship mode, which allows the player to select one wrestler and slowly move his way up by defeating other wrestlers in a tournament consisting of one-on-one matches.</p>"},{"name":"WWF WrestleMania","year":1995,"developer":"Midway Manufacturing Company","url":":WWF WrestleMania - The Arcade Game (USA)","filesize":2528867,"score":7.4,"genres":"Action > Sports > Side view > 2D scrolling > Arcade > Wrestling > Licensed","desc":"<p><em>WWF WrestleMania: The Arcade Game</em> merges the personalities and action of the WWF TV show characters with a Mortal Kombat-style fighting game. This title features digitized graphics of 8 WWF superstars: Doink, Razor Ramon, Bret \"Hit Man\" Hart, Shawn Michaels, The Undertaker, Yokozuna, Bam Bam Bigelow, and Lex Luger.</p><p>Although presented as a wrestling title, this game is structured like a one-on-one fighter, features over-the-top special moves characteristic of WWF. Each match is divided into a series of rounds, much like a fighting game. Instead of each round ending in a KO, it simply ends when the player forces the other wrestler(s) to fall by reducing their energy meter. Game modes include single player arcade mode, tournament mode, and versus mode for one-on-one multiplayer.</p>"}]