[{"name":"X-Kaliber 2097","year":1994,"developer":"Winds Co., Ltd.","url":"5#X/X-Kaliber%202097%20%28NA%29.sfc","filesize":1048576,"score":6.5,"genres":"Action > Side view > 2D scrolling > Fighting > Platform > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p><em>X-Kaliber 2097</em> takes place in the year 2097 A.D. in NEO N.Y. The city is run down and controlled by a warlord named Raptor. Raptor has unleashed an army of ruthless, mutating Morphs upon the city to enforce his brand of order. Only two special forces agents, Slash and Alix do not submit to Raptor's will. Raptor decides to hatch a plan to kidnap Alix, so Slash, and more importantly his magic X-Kaliber sword, will come to him in an attempt to try and rescue her.</p><p>The game consists of two modes. The first modes gameplay consists of side-scrolling action. The player can jump and swing a sword at enemies. The player can also deflect projectiles with the sword. The game also features one on one boss fights that are set up similar to a fighting game. The second mode is a two player duel that is set up like the one on one boss fights but is between two human controlled players.</p>"},{"name":"X-Men: Mutant Apocalypse","year":1994,"developer":"Capcom Co., Ltd.","url":"6#X-Men%20-%20Mutant%20Apocalypse%20%28USA%29.sfc","filesize":2097152,"score":7.5,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>A rise of anti-mutant activity in Genosha prompts Professor Xavier uses Cerebro to scan the island nation and discovers Apocalypse's presence there. Genosha's government is apparently using Apocalypse to bring their mutant population under control. However, Xavier suspects Apocalypse to follow his own plans and sends five X-Men, Cyclops, Wolverine, Psylocke, Beast and Gambit, to investigate.</p><p><em>X-Men: Mutant Apocalypse</em> combines the gameplay of a side-scrolling brawler like Final Fight with elements of a platformer, that is, players have to fight various enemies and survive the occasional jumping-puzzle. Most levels also feature mid- and end-bosses in form of robots, monsters or known Super-Villains.</p><p>Each character has unique abilities and special moves: Cyclops uses his Optic Blast to attack enemies from a distance, Wolverine can climb walls, Psylocke is very agile and the best jumper of the team, Beast can cling to the ceiling while Gambit throws explosive cards at his enemies. Special moves are quite similar to those found in Street Fighter II (Wolverine has a Dragon-Punch-style attack and Gambit's Double Kick is virtually identical to M. Bison's Scissors Kick) and require similar button combinations.</p><p>While most stages are unique for each character, some can be played with any of the X-Men. Progress is saved via password.</p>"},{"name":"X-Zone","year":1992,"developer":"Kotobuki System Co., Ltd.","url":"5#X/X%20Zone%20%28NA%29.sfc","filesize":524288,"score":6.8,"genres":"Action > 1st-person > Arcade > Rail shooter > Sci-fi / futuristic","desc":"<p>Compond X's powerful bio-computer has begun to malfunction and \"X-Tra\", aka the external threat recognition assault system, is firing on anything that moves. In fact, the computer has accessed the nation's nuclear weapon countdown systems for a retaliatory strike. Since nuclear war might X-tinguish life on the planet, the player must enter the X-Termination zone of the compound and fight on through defenses to the central computer.</p><p><em>X-Zone</em> is a first-person light gun game. The player must shoot the robotic enemies on the screen and the projectiles that they launch at the player. Most levels are ended with a battle against a boss, which follows specific patterns and whose systems/weapons must be shot at and destroyed individually.</p>"},{"name":"Xak: The Art of Visual Stage","year":1993,"developer":"Micro Cabin Corp."},{"name":"Xardion","year":1992,"developer":"Jorudan Co., Ltd.","url":"5#X/Xardion%20%28NA%29.sfc","filesize":1048576,"score":5.9,"genres":"Action > Side view > 2D scrolling > Platform > Sci-fi / futuristic","desc":"<p><em>Xardion</em> tells the tale of three warring planets that are home to three distinct alien races. Their fighting is interrupted by the threat of invasion from a much more potent alien race. The three planets find that they are able to set aside their differences long enough to battle their shared menace.</p><p>Each planet sends a warrior to deal with the threat. There is a robot named Triton, a cat-like quadruped named Panthera, and a giant red bipedal insect alien name Alcedes. The single player of the game controls one of these characters at a time and can switch at any time. If the current character loses all of his health, the player is sent back to the start of the level and that one character receives a health refill.</p><p>Each character has special attributes that help the team. For example, Panthera's relatively small size allows him to squeeze into spots where the other two characters can not travel. The characters can gather a number of unique power-ups and weapons to help them on their mission.</p>"}]