[{"name":"Yoshi no Cookie: Kuruppon Oven de Cookie","year":1994,"developer":"Tose Co., Ltd."},{"name":"Yoshi's Cookie","year":1993,"developer":"Tose Co., Ltd.","url":"5#Y/Yoshi%27s%20Cookie%20%28NA%29.sfc","filesize":524288,"score":7.2,"genres":"Puzzle > Fixed / flip-screen > Real-time > Turn-based > Falling block puzzle > Tile matching puzzle > Point and select","desc":"<p><em>Yoshi's Cookie</em> is a fast-paced puzzle game. The player moves randomly placed cookies into rows and columns of cookies with similar patterns. When a row or column of the same cookies is successfully assembled, the line will disappear, and the player can begin to work on a new row or column. The \"Yoshi\" cookie is very special in both the 1-player and the 2-player game. Since this cookie is the key to both games, it should be used wisely.</p><p>The SNES version has an additional puzzle mode where players have to clear the game board in a limited number of moves. There are 100 unique puzzles in this mode.</p>"},{"name":"Yoshi's Safari","year":1993,"developer":"Tose Co., Ltd.","url":"6#Yoshi%27s%20Safari%20%28USA%29.sfc","filesize":1048576,"score":7,"genres":"Action > 1st-person > Rail shooter","desc":"<p>In <em>Yoshi's Safari</em>, Bowser, King of the Koopas, and his evil offspring have invaded Jewelry Land. The Koopalings have seized the Kingdom's precious jewels. It's up to Mario, armed with his trusty Super Scope, to ride Yoshi to track down Bowser and put a stop to his evil plans.</p><p>Unusual for the Mario games, <em>Yoshi's Safari</em> uses a first-person perspective. Gameplay consists of shooting enemies before they attack. Hidden areas and other secrets can be unlocked by shooting at large gates. There are bosses along the way that must be destroyed before players can move on to the next area. Game supports single or multi-player game modes.</p>"},{"name":"Young Merlin","year":1993,"developer":"Westwood Studios, Inc.","url":"5#Y/Young%20Merlin%20%28NA%29.sfc","filesize":2097152,"score":7.7,"genres":"Action > Isometric > Puzzle elements > Fantasy","desc":"<p>After trying to rescue a drowning young woman, a young magician named Merlin is drawn into a fantasy world which is threatened by the evil Shadow King. Naturally, it is his job to save this world and also to rescue the aforementioned woman, who has been kidnapped by the Shadow King.</p><p><em>Young Merlin</em> is an action game with puzzle-solving elements. The hero has to fight enemies using spells that are gathered during the progress of the game, as well as solve puzzles, interact with the game's inhabitants, and use several objects. What sets this title apart from similar games is the fact that there is no text in the entire game; instead, icons are used to represent conversations. Furthermore, the game uses passwords instead of a battery to record the player's progress.</p>"},{"name":"Ys III: Wanderers from Ys","year":1991,"developer":"Nihon Falcom Corp.","url":"5#Y/Ys%20III%20-%20Wanderers%20from%20Ys%20%28NA%29.sfc","filesize":1048576,"score":7.7,"genres":"Role-playing (RPG) > Side view > 2D scrolling > Action RPG > Metroidvania > Platform > Fantasy","desc":"<p>Adol Christin's long-time friend, Dogi, wishes to return to his home town of Redmont after hearing about strange disturbances that are happening there. Always looking for an adventure, Adol joins him and soon finds out the cause of this new evil.</p><p><em>Ys III: Wanderers from Ys</em> breaks away from the \"bumping into enemies\" battle system of the first two games, allowing Adol to control his sword in a variety of directions. Beside changing the battle system, the game's perspective switches to a side-scrolling view, as opposed to the top-down one of the previous games. Adol also has the ability to jump now. New to the series is the use of magical rings, which give Adol different powering-up abilities such as healing and shielding. The game also uses various key items found along the way to solve minor puzzles and progress the story.</p>"},{"name":"Ys IV: Mask of the Sun","year":1993,"developer":"Tonkinhouse","url":"5#Y/Ys%20IV%20-%20Mask%20of%20the%20Sun%20%28English%20Translated%2C%20Rev%202.1%29.sfc","filesize":1572864,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Fantasy","desc":"<p>After having defeated the ultimate evil in his previous adventure in the magical land of Ys, the red-haired swordsman Adol Christin returned to the town of Minea. Suddenly, Adol notices a bottle, thrown onto the shore. It contains a letter, written in a foreign language, in which an unknown person asks Adol to come to the land of Celceta and save it from a mysterious evil. Adol decides to accept the offer, and thus his new adventure begins.</p><p><em>Ys IV: Mask of the Sun</em> is one of the two games bearing the fourth number in the series, the other one being The Dawn of Ys. Though quite different in general, the two games share the same basic plot and are both sequels to Ys II and prequels to Ys III. Like the first two games in the series, <em>Mask of the Sun</em> is a top-down action role-playing game. Its combat system is similar to that of the earlier games. with slight modifications. An enemy should be rammed from the side in order to inflict damage; if performed incorrectly, the player character will get hurt himself. Magic is learned from equipping various swords with elemental properties.</p>"},{"name":"Ys V: Ushinawareta Suna no Miyako Kefin","year":1995,"developer":"Nihon Falcom Corp.","url":"5#Y/Ys%20V%20-%20Ushinawareta%20Suna%20no%20Miyako%20Kefin%20%28English%20Translated%2C%20Rev%201%29.sfc","filesize":3145728,"score":"","genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Fantasy","desc":"<p>Long, long ago, in the Kefin Desert, on the Continent of Afroka, a strong wind blew throughout the night... There is nothing but desert in Kefin area, but a legend tells a city was once was there -the city of Kefin. There is a rumor a legendary treasure is hidden somewhere amidst the ruins of the city. Who will dare to explore the dangerous region and to uncover the mysteries of the past? There is one who dares - a red-haired swordsman named Adol Christin.</p><p><em>Ys V: Ushinawareta Suna no Miyako Kefin</em> is the fifth installment of the Ys series, and the first one to depart from its trademark \"bumping\" battle system. Combat has been somewhat modified to resemble a more traditional action RPG style, requiring the player to actively press a button to execute an attack rather than simply running into enemies. Adol can fight monsters using melee and magical techniques, and defend himself by pressing a button at the right time. The ability to jump has also been added, though it is rarely used for platforming purposes. Magic can be learned by acquiring and combining elemental orbs in the inventory, creating new spells. Separate experience points are awarded for vanquishing enemies with swords or with magic. </p><p>A few months later after the game's initial release, a tweaked expert version was released. This version included tougher enemies, a time attack mode, as well as a new dungeon to explore.</p>"},{"name":"Yū Yū Hakusho 2: Kakutō no Sho","year":1994,"developer":"Tose Co., Ltd."},{"name":"Yū Yū Hakusho Final: Makai Saikyō Retsuden","year":1995,"developer":"Tose Co., Ltd."},{"name":"Yume Meikyū: Kigurumi Daibōken","year":1994,"developer":"Axes Art Amuse"}]