[{"name":"Zen Nippon Pro Wrestling","year":1993,"developer":"Natsume Co., Ltd."},{"name":"Zen Nippon Pro Wrestling Dash:  Sekai Saikyō Tag","year":1993,"developer":"Natsume Co., Ltd."},{"name":"Zero: The Kamikaze Squirrel","year":1994,"developer":"Iguana Entertainment Incorporated"},{"name":"Zero4 Champ: RR","year":1994,"developer":"Media Rings Corporation"},{"name":"Zero4 Champ: RR-Z","year":1995,"developer":"Media Rings Corporation"},{"name":"Zico Soccer","year":1994,"developer":"Electronic Arts Victor"},{"name":"Zig Zag Cat: Dachō Club mo Oosawagi da","year":1994,"developer":""},{"name":"Zoku: The Legend of Bishin","year":1993,"developer":"WiZ"},{"name":"Zombies Ate My Neighbors","year":1993,"developer":"LucasArts","url":":Zombies Ate My Neighbors (USA)","filesize":606212,"score":7.9,"genres":"Action > Diagonal-down > 2D scrolling > Shooter > Direct control > Horror > Regional differences","desc":"<p>In <em>Zombies Ate My Neighbors</em>, the player takes the role of a male or female protagonist (Zeke or Julia), fighting vampires, mummies, zombies, and other horrifying creatures. The goal is to destroy these monsters, survive the 50+ levels (not including secret ones), and rescue the neighbors that have survived the onslaught.</p><p>There is a defined number of neighbors who can be saved on every level. When they are all rescued, an \"Exit\" door opens, and the player advances to the next level. The levels range from mall and grocery store to beaches and football fields. Using different weapons such as bazooka or water gun, Zeke and Julia have to kill regular enemies and bosses (huge babies, dragons, ants, and others) at the end of the levels. Despite the horror theme, the game's setting contains humorous elements as well. A two-player cooperative mode is available.</p>"},{"name":"Zool: Ninja of the Nth Dimension","year":1993,"developer":"Gremlin Interactive Limited","url":":Zool - Ninja of the 'Nth' Dimension (USA)","filesize":767873,"score":7,"genres":"Action > Side view > 2D scrolling > Arcade > Platform > Shooter","desc":"<p>His name is Zool, and he is a gremlin-like creature from another dimension. He is forced to land on the Earth, but his sole goal is to attain the prestigious ranking of a Ninja. To do that, Zool will have to travel through six worlds, each divided into three stages, defeat his enemies, and prove himself worthy of that title.</p><p><em>Zool</em> is a fast-paced side-scrolling platformer. The protagonist can run, jump, climb walls, and shoot enemies. Power-ups for Zool are scattered across the levels. These include life-spending hearts, smart bombs, shields, a more powerful jump-skill, and a twin Zool. This \"twin\" makes imitates the original's motions a few seconds after he performs them.</p><p>In the options menu, the player can change the difficulty and the game speed (two times), the number of continues, and the background music (rock or funk).</p>"},{"name":"Zoop","year":1996,"developer":"Hookstone Ltd.","url":":Zoop (USA)","filesize":311195,"score":6.9,"genres":"Action > Puzzle > Top-down > Fixed / flip-screen > Tile matching puzzle > Direct control > Licensed","desc":"<p><em>Zoop</em> is a fast-paced puzzle game in which the player eliminates colored shapes that are approaching his alter ego, another colored shape, before they reach the top, somewhat similarly to Tetris.</p><p>In order to eliminate the other shapes, you must point your piece at it and 'fire'. If the shape is the same color as your piece, the shape is eliminated, as well as all of the shapes of the same color behind it, until your piece hits a piece of a different color. If the shape is of a different color, or it is hit when collecting a line of similar shapes, your piece exchanges colors with the shape.</p>"}]