[{"name":"007: Agent Under Fire","year":2002,"developer":"Electronic Arts Canada","url":"microsoft_xbox_numberssymbols/007%20-%20Agent%20Under%20Fire%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5646883687,"score":7.2,"genres":"Action > 1st-person > Shooter > Spy / espionage > Licensed","desc":"<p><em>007: Agent Under Fire</em> is the first James Bond game to appear on the PlayStation 2, GameCube, and Xbox. The game casts the player as the legendary James Bond who must accomplish missions throughout different areas of the world. Bond is sent on a mission rescue Zoe Nightshade, a CIA agent in the hands of Nigel Bloch. Nigel Bloch is the CEO of Identicon, a section of a highly successful industry company known as Malprave industries. Bond is also tasked to retrieve the set of DNA samples that are in Identicon's hands. So James Bond sets off on another adventure...</p><p>The game combines three game modes into one package: first-person-shooter, which is what most of the missions are, a rail-shooter, where the player only controls firing, and a driving game, where the player drives one of the many Bond cars. Numerous weapons have been added to the series, along with some fictional weapons like the Photon cannon and the 5-way grenade launcher. The player can utilize a wide array of gadgets and weapons, like the Q-Claw, Q-Decoder, and Bond's trusty Walther handgun. There is a large variety of missions, and Bond can go through most missions with weapons, or take a stealthy approach. The player is also rated in each level, based on score and difficulty level, and can unlock new features for both single and multiplayer.</p>"},{"name":"007: Everything or Nothing","year":2004,"developer":"Electronic Arts Redwood Shores Studio","url":"microsoft_xbox_numberssymbols/007%20-%20Everything%20or%20Nothing%20%28Europe%29%20%28En%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6222452904,"score":7.9,"genres":"Action > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>A nanobot has been stolen from the work of a world-renowned scientist, Dr. Katya Nadanova, of the Oxford Department of Microtechnology by a man known only as \"the General\", who has kidnapped Dr Nadanova as well. James Bond races to rescue both the scientist and to retake the nanobots, and kills the General along with the nanobot samples. Bond returns Katya to a nearby base, but it turns out the scientist has not been so faithful to Oxford. Katya meets up with Nikolai Diavolo and gives him a hidden vial of the nanobots. Before long Bond is yet again called into action when MI6 loses contact with 003. And so Bond is off to Peru... </p><p><em>Everything or Nothing</em> is the second of the James Bond third-person shooters, after Tomorrow Never Dies for the Playstation. The game features new guns and a new and improved aiming system which allows you to strategically hug walls and fire around or crouch behind cover. New gadgets allow Bond to go invisible, disrupt electronics, or control mechanical spiders which allow him to access new areas. <em>Everything or Nothing</em> is also the first game where Pierce Brosnan actually supplies his voice for the likeness of his character. Many other actors from the Bond film series such as Judi Dench and John Cleese do likewise.</p><p>The game features a campaign with over 30 missions and a brand new co-op game where you take the roles of newly recruited MI6 agents on investigations of their own. EON also includes a same-screen deathmatch that allows for up to four players to play.</p>"},{"name":"007: From Russia with Love","year":2005,"developer":"Electronic Arts Redwood Shores Studio","url":"microsoft_xbox_numberssymbols/007%20-%20From%20Russia%20with%20Love%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6586816263,"score":7.1,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>Building on 007: Everything or Nothing's range of strengths, <em>007: From Russia with Love</em> is based on the 1963 film starring Sean Connery as James Bond. He is sent to Istanbul to acquire the Russian decoder machine known as the Lektor from a (supposedly) defecting Russian agent by the name of Tatiana Romanova. However, the Russians have no knowledge of this plan because it is a trap for James Bond created by the criminal organization known as Octopus. It is up to James Bond to seize the device and confront the dangerous assassin Red Grant and the ruthless Rosa Klebb.</p><p>In most of the 18 missions, the player progresses through linear levels while shooting everything in sight. The player can lock onto an enemy at range and cycle between visible enemies, or focus in closer on a single enemy to make opportunistic targets appear, such as uncovered grenades or gaps in armor. Sometimes Bond can also use stealth or hand-to-hand combat, which are basically quick-time events where the player needs to press a displayed button in a limited time to dispatch a foe. Special tasks can be performed with gadgets, e.g. the laser watch or a small remote-controlled helicopter. This procedure gets spiced up with occasional driving or new jet pack sequences.</p><p>The player gets rewarded for certain actions with bonus points, e.g. succeeding in melee combat or searching containers. There are three different kinds of points that unlock different things: bonus content like making-of videos, bonus levels, and weapon upgrades. Every weapon and gadget can be upgraded in different areas, but only once.</p>"},{"name":"007: Nightfire","year":2002,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_numberssymbols/007%20-%20Nightfire%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6504083616,"score":7.4,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p>You take on the role of James Bond and must save the world. The Phoenix International Corporation is focused on dismantling nuclear warheads throughout the world, but later evidence has been found that the CEO of the corporation, Raphael Drake, is using his company's concept as a means to find and use the warheads for his own purposes. Because his plans are so well hidden, it is up to Bond, with the help of Q and his gadgets, to stop Drake at whatever cost.</p><p>Throughout the game, you will be taken to more than ten exotic areas, reaching all areas of the globe, confronting the beautiful Bond women. In your quest to stop the Phoenix Corporation, you have a variety of weapons available to you, from your trusty Walther to more advanced and prototype machinery.</p><p>There are twelve total missions, all of which combine stealth, combat, and Q's trusty gadgets, such as your laser watch and X-ray eyeglasses.'</p><p>There are five levels that take place in your Aston Martin V12 Vanquish, and other exotic but deadly sports cars. These missions aren't available in the computer version of the game, instead the Windows version has some other bonus missions.</p><p>On the multiplayer side of things, there are over ten multiplayer modes, some of which include characters and settings from previous Bond moves.</p>"},{"name":"100 Bullets","year":2004,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_numberssymbols/100%20Bullets%20%28USA%29%20%28Proto%29.zip","filesize":643963730,"score":"","genres":"Action","desc":"<p>The 100 Bullets video games were adaptations of the comic book series of the same name, which was created by Brian Azzarello. The first cancelled title was to be developed by Acclaim Studios Austin and published by Acclaim Entertainment. It was planned to release for the PlayStation 2 and Xbox in October 2004. It would star two characters: Cole Burns (a character from the comic), and Snow Falls, a character created for the video game and designed by Azzarello. Eduardo Risso (another figure involved in the comic) was responsible for the art direction. Key gameplay mechanics revealed include an auto-aim system that rewards players for patience, a \"rage meter\" that when full allows players to kill all enemies nearby, and the ability to use enemies as human shields. The game was cancelled following Acclaim's financial problems and closure.</p>"},{"name":"187: Ride or Die","year":2005,"developer":"Ubisoft Paris Studios SARL","url":"microsoft_xbox_numberssymbols/187%20-%20Ride%20or%20Die%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6701946398,"score":6,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Vehicular combat","desc":"<p><em>187: Ride Or Die</em> combines fighting and car racing through different game modes, including online play. In all game modes, you have to control both driving and shooting at the same time.</p><p>187 Ride Or Die takes place in the \"gangsta\" universe, where you are \"Buck\", a young thug hired to take out the members of the opposing crew while on the road. The game provides a set of different cars, characters and weapons you can play with. Weapons take a large part in the gameplay: It is quite impossible to win races without using weapons. </p><p>There are alternate mission types such as escort missions, car bomb, police escape (the only mode without weapon), and others. There are also deathmatch modes where the goal is to get the maximum of frags on other cars in arena style maps.</p>"},{"name":"2002 FIFA World Cup","year":2002,"developer":"Software Creations Ltd.","url":"microsoft_xbox_numberssymbols/2002%20FIFA%20World%20Cup%20%28Europe%29.zip","filesize":6642869726,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Asia > Japan (Modern/Futuristic) > Licensed","desc":"<p><em>2002 FIFA World Cup</em> is the official game of the 17th FIFA World Cup, held in Korea and Japan between May 31 and June 30. It is based on the engine of FIFA Soccer 2002, so experienced Fifa players can get used for it quite fast. </p><p>It is based on the 2002 World Cup - Korea and Japan and includes all of the countries who promoted to the World Cup, and a lot more. Small statistics are shown for every country - their last biggest win, appearances at the World Cup, etc.</p><p>The stadium and all players are really detailed. The player's texture's resolution is so high, you can easily recognize most of them. The stadium is big and impressive and full of colored crowd.</p><p>As in <em>FIFA Soccer 2002</em>, the animation was taken from real players, with motion sensors. Thus, some new animation was added - new sliding, falling, and more.</p><p>And the newest feature of <em>2002 FIFA World Cup</em>, is the air ball control model. You can take balls from the air, and have much more control with them - creating great goals from the air.</p>"},{"name":"25 to Life","year":2006,"developer":"Ritual Entertainment","url":"microsoft_xbox_numberssymbols/25%20to%20Life%20%28USA%29.zip","filesize":6565444269,"score":4.6,"genres":"Action > Behind view > Shooter > Stealth > Crime","desc":"<p><em>25 to Life</em> is set in the urban inner city jungle where you can choose to be either a law enforcer or law-breaker. In single-player mode, you follow the storyline of young Freeze who is trying to survive in the hood and protect his family, or that of Shaun Calderon, a gang leader who had to escape to Mexico. On the other side of the law, you can play the cop Lester Williams whose department is swamped by corruption.</p><p>Whatever you choose, the bulk of the game has to walk through the cities, hide behind corners and then bust out and shoot people. As always, you have an arsenal of weapons and moves at your disposal.</p><p>You can also play online with several people, fighting against each other in teams.</p>"},{"name":"4x4 Evo 2","year":2001,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_numberssymbols/4x4%20Evo%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6211942084,"score":6.8,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Automobile > Off-roading > Vehicle simulator > Licensed","desc":"<p><em>4x4 Evo 2</em> is a sequel to the 2000 release 4x4 Evo. This game is very similar to its predecessor, but now it appears on newer platforms and has more trucks, and many more tracks.</p><p>The trucks in this game are licensed likenesses of trucks you may see driving down the streets of suburban America. You can purchase a truck in career mode, and then trick it out with custom parts to turn it into an off-road monster.</p><p>The career mode from 4x4 Evo is again the main focus of 4x4 Evo 2. This time, crazy missions provide for an alternative to the races found in the rest of the game. For example, you may find yourself using your truck to track down lost gold or locate misplaced outhouses.</p><p>The GameCube version features four exclusive tracks and four exclusive trucks.</p>"},{"name":"50 Cent: Bulletproof","year":2005,"developer":"Genuine Games, Inc.","url":"microsoft_xbox_numberssymbols/50%20Cent%20-%20Bulletproof%20%28France%29.zip","filesize":6393085607,"score":5.4,"genres":"Action > Behind view > Shooter > Licensed","desc":"<p>This game lets you step into the footsteps of 50 Cent himself. As he tries to free the kidnapped K-Dog with his crew in the streets of New York City, 50 gets shot nine times (just like his real-life counterpart) and left for dead. After getting stitched up, he sets out to find those who tried to kill him and uncovers a bigger conspiracy.</p><p>The game is a 3rd-person shooter with all the typical features: You have a wide array of weapons (including akimbo shooting), there are over 25 moves to finish people off at close range, you can find money to buy health packs, armor, and other helpful items. You can grab enemies and use them as human shields and use mobile objects (like dumpsters on wheels) as cover. The game uses the havok physics engine for a more dynamic environment.</p><p>In many missions, you'll be rolling with your crew, the G-Unit: Lloyd Banks (as a locksmith), Young Buck (weapons expert), and Tony Yayo (the demolition man). They will provide back-up and perform tasks that are necessary to complete objectives.</p><p>The game comes with lots of additional material too (some of it unlockable), like music videos and 4 CDs worth of music with lots of previously unreleased material. Guest starring are Dr. Dre as Grizz and Eminem as Detective McVicar.</p>"}]