[{"name":"Advent Rising","year":2005,"developer":"GlyphX Games, LLC","url":"microsoft_xbox_a/Advent%20Rising%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6276150621,"score":7.1,"genres":"Action > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>In <em>Advent Rising</em>, you play as Gideon Wyeth, a rookie space pilot. Gideon has a loving fiancée and life smiles. That is, until mysterious aliens appear. Gideon and his brother, a hero space pilot, are invited to the historical greeting party. Though the aliens are friendly, they come with a warning about another, vicious race, known as \"the Seekers\", who have decided to exterminate the human race. Soon after, the Seekers invasion begins, and so does the actual game.</p><p>The game itself is a third person shooter with superpowers and a rudimentary melee fighting system. Alternatively, it's possible to switch to a first person perspective, although some abilities cannot be used in this view. Generally you just go around shooting aliens using a new kind of targeting system called flick-targeting. While on Xbox you select targets by tapping thumbsticks towards the foe you want to shoot, on PC this happens by scrolling the mouse wheel (although you can use the mouse for manual aiming and thus avoid scrolling through long list of enemies). You can also gain psychic powers to aid you in combat, ranging from lifting enemies into the air and slowing down time, to creating shields capable of deflecting attacks and smashing enemies with an electromagnetic pulse. These powers work like character upgrades, each one having five mastery levels. Jumping and melee fighting are also upgradeable. As part of the jumping mastery levels, for example, is dodging in slow motion. Just like weapons, in order to use powers they must first be equipped in at least one hand.</p><p>During gameplay, the HUD shows Gideon's remaining health, the power meter, weapons and powers currently in use, and the number of rounds in the weapon. At first, you must find Nano Aid stations in order to recover health, however once Gideon gains mastery over his health, it simply regenerates if you stay out of harm's way. The power meter decreases every time a power is used, and if it's depleted you must wait for a time before you have access to your powers again.</p><p>While <em>Advent Rising</em> is mainly a third person shooter, Gideon will have the chance to control the Scythe ATV, turrets and various alien ships. The game has four levels of difficulty (easy, normal, hard and ultra), and uses a checkpoint-based saving system.</p>"},{"name":"Aeon Flux","year":2005,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_a/Aeon%20Flux%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":5848973380,"score":6.7,"genres":"Action > Behind view > Arcade > Puzzle elements > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>Aeon Flux</em> is a 3rd person action game inspired by the 2005 movie of the same name. The story takes place 400 years in the future after the majority of Earth's population has been wiped out by industrial disease. Only one city, Bregna, remains. The city is run by the group of scientists who had discovered the vaccine to prevent the disease, but a group of rebels known as the Monicans oppose their rule. </p><p>You control the main character of the story, Aeon Flux. Aeon is a skilled fighter, and can perform light and heavy strikes, combo attacks, and a variety of acrobatic attacks. When an enemy has only a small amount of health left, you also have the ability to perform a takedown attack; when successful this will award you a bonus, such as extra health. Aeon has a health meter and a style meter; when the health meter is depleted, the game is over. The style meter is filled by attacking or killing enemies; when you have earned enough style, you can charge up your combo attacks for extra damage. Aeon is also equipped with a gun called the FUG (Flux Universal Gun) as well as various gadgets. To use the gun you will need ammo which can be picked up at various locations on each level. The various gadgets and gizmos available need to be used to get past certain areas and solve some puzzles; intel capsules provide you with important data, small orbs can be controlled to disable alarms and activate doors, Aeon can hide in rollers to navigate through areas undetected, and more.</p>"},{"name":"AFL Live 2003","year":2002,"developer":"IR Gurus Interactive Pty Ltd.","url":"microsoft_xbox_a/AFL%20Live%202003%20%28Australia%29.zip","filesize":6664391672,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>The aim of the game is simple: Choose your team and take them all the way through the regular season to the Grand Final, in front of thousands of screaming fans at the Melbourne Cricket Ground. Grab high-flying marks, kick the ball over 50 meters down the ground, score the winning goal in the dying seconds. It's all here. Besides the season you can also play an exhibition game or just the finals.</p><p>Every one of the 16 teams and players from the 2002 AFL season is included, along with all of the usual rules that you expect for an AFL game. The game also features six stadiums and different weather (wet/dry) and time (day/night) conditions.</p>"},{"name":"AFL Live 2004","year":2003,"developer":"IR Gurus Interactive Pty Ltd.","url":"microsoft_xbox_a/AFL%20Live%202004%20%28Australia%29.zip","filesize":6659495895,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>As its predecessor AFL Live 2003 this game is a simulation of Australian Football and it's main league, the AFL. Updates include the chance to win player awards throughout the season (including the all important Brownlow Medal for best player of the year). Player Missions will have you attempting to re-create history, or change it, as some of the best and worst moments for each team are there for you to make or break. Plus you can now take your team through the pre-season Wizard Cup competition.</p><p>Updates to team rosters, new replay features, photo realistic player faces, and a new commentary team led by Denis Commeti round out the changes.</p>"},{"name":"AFL Live: Premiership Edition","year":2004,"developer":"IR Gurus Interactive Pty Ltd.","url":"microsoft_xbox_a/AFL%20Live%20Premiership%20Edition%20%28Australia%29.zip","filesize":6487966745,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p>Following on AFL Live 2004, <em>AFL Live: Premiership Edition</em> boasts the latest team lists, added gameplay features, and unlockable content like videos from the 2003 season. Also new is the inclusion of the \"Wizard Home Loan Club\", a pre-season competition with knockout-matches.</p><p>Based on Australian Rules Football, the game attempts to recreate the experience of the real games. Users can set up a single exhibition match, or play through an entire season with their favourite team. Features commentary from experts such as Dennis Cometti and Gerald Healy.</p>"},{"name":"AFL Premiership 2005","year":2005,"developer":"IR Gurus Interactive Pty Ltd.","url":"microsoft_xbox_a/AFL%20Premiership%20%28Australia%29.zip","filesize":6701333119,"score":"","genres":"Sports > Diagonal-down > 2D scrolling > Oceania > Licensed","desc":"<p><em>AFL Premiership 2005</em> is based off the Australian Rules Football game that is quite popular in southern parts of Australia. Based off the official rules and has full licensing from the AFL board. It is a mixture of a few sports, originally developed by a Australian Cricket Coach who wanted to keep his team fit in the off season. It is mainly played throughout the state of Victoria but has now gotten a following in other states. </p><p>The game includes all the 16 teams, 692 AFL players with stats and 8 of the stadiums. The game also includes support for the Cameo Eyetoy (PS2 version) that will allow the player to put his/her head into the game on top of one of the players. Full multiplayer gameplay is supported, using Gamespy for online play, or using the Multi-tap you can have up to 4 players. The PS2 version also comes with a bonus \"100 Years of Australian Football\" DVD.</p><p>The later released Xbox and PC versions do not contain the DVD, but because of the later release changes from the AFL draft have been implemented, even though the overall team score has not been updated.</p>"},{"name":"Aggressive Inline","year":2002,"developer":"Z-Axis, Ltd.","url":"microsoft_xbox_a/Aggressive%20Inline%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6676684312,"score":8.1,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Combine the many tricks and styles of the extreme sport, inline skating, with a Tony Hawk style system, complete with objectives and huge arenas, and you have Aggressive Inline.</p><p>Progress through the career mode, where you must complete objectives (such as grind a certain object(s) to jump over large gaps and gain points) to open up further arenas, which there are 7 in all, and once you are bored with them, you can make your own in the park editor. The game doesn't use a hard time limit but the so-called \"juice meter\": it fills up when performing stunts and if it gets empty, the level ends. During the game, you level up your character in seven stats, e.g. speed and grinds. The game uses a \"learning by doing\" approach to this, meaning that the stat improves if you perform the associated actions often enough. There are also five hidden keys in each level that open up new areas within the level.</p><p>10 pro inline skaters join the fun (Shane Yost, Sam Fogarty, Sven Boekhorst, Eito Yasuko and more), and you can take on a friend in 2 player split screen.</p>"},{"name":"AirForce Delta Storm","year":2001,"developer":"Konami Computer Entertainment Studios, Inc.","url":"microsoft_xbox_a/AirForce%20Delta%20Storm%20%28USA%29.zip","filesize":6361225164,"score":6.4,"genres":"Action > Simulation > 1st-person > Behind view > Flight / aviation > Vehicular combat","desc":"<p><em>AirForce Delta Storm</em> is a combat flight game that lets you choose from over 40 modern warplanes. You are given a mission to destroy one or more air or ground targets. If you accomplish these missions, you earn money which can be used to buy more planes.</p><p>However, if you fail in a mission, you lose the plane you were flying in. The only one you can't lose is the A-7 Corsair II you start with. You must then buy a new plane and make your way back to the mission location.</p><p>Travel across the world map is accomplished by spending movement points, which represent fuel. There are checkpoints with paths between them which are populated by enemies. Once you shoot them down, they stay down until you run out of movement points, at which point moving around becomes more difficult again.</p>"},{"name":"Alfa Romeo Racing Italiano","year":2005,"developer":"Milestone s.r.l."},{"name":"Alias","year":2004,"developer":"Acclaim Studios Cheltenham","url":"microsoft_xbox_a/Alias%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6368549095,"score":6.5,"genres":"Action > 3rd-person (Other) > Stealth > Spy / espionage > Licensed","desc":"<p>Based on the successful television show, <em>Alias</em> lets players take on the role of Sydney Bristow, a stealth operative working for the CIA. The game sets the player against two of Bristow's enemies from the original series in a plot which takes her from Saudi Arabia to Rio de Janeiro as she aims to find out about a mysterious device known only as \"The Machine\". The game was devised in conjunction with the writers from the show and uses official costumes, character shots and voices.</p><p>Players can use a stealth or action approach to get through the levels. With stealth Bristow needs to hug walls and use the correct timing to approach enemies from behind and knock them out. To accomplish this she has a few gadgets to her disposal, e.g. thermal vision or mini cameras. For the more direct method she uses guns found on neutralised enemies or melee combat. The latter knows different fighting styles depending on which weapon Bristow uses, e.g. knifes, unarmed or even a broom. There are also basic puzzles to solve, e.g. opening doors or a hacking mini game. Health regenerates automatically after a certain amount of time.</p>"},{"name":"Alien Hominid","year":2005,"developer":"The Behemoth","url":"microsoft_xbox_a/Alien%20Hominid%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6275828298,"score":7.3,"genres":"Action > Side view > 2D scrolling > Shooter > Fantasy > Sci-fi / futuristic > Regional differences","desc":"<p>You're a little yellow alien. The FBI has shot down your ship while flying over planet Earth. And it, quite literally, lands right on their doorstep. After a series of FBI Agents swipe your ship, what option do you have other than to blow up everything in your path to get it back?</p><p><em>Alien Hominid</em> is a 2D side-scrolling shooter with heavy references to the Metal Slug series of games - from the hand-drawn graphics, huge explosions, right down to the ability to eviscerate FBI Agents when you get up close to them. The graphics are by featured artist Dan Paladin. Your goal, is quite simply, to get to the end of the stage, and die as little as possible. Which is made difficult due to the fact that any bullet is an instant kill.</p><p>To help you out, you can grab a range of power-ups, such as lasers, spread shots, shotguns, and more, as well as hijacking vehicles and using them for protection. Grenades can be lobbed, and you can jump on enemy shoulders and choose to bite their heads off if you like, or pick them up and throw them at other enemies. You can also dive underground for a short period of time to avoid enemies - while underground, you can drag agents into the ground to kill them.</p><p>The GBA version of the game is identical in gameplay, however, with a few bosses removed (such as the robot bee and the FBI big-fisted tank robot). The PlayStation 2, Xbox and Xbox 360 versions of the game include a special \"PDA Game\" with very simple-looking graphics. Your goal in this game is to kill all the agents by hopping on their heads and then reaching the exit. Included with this game is a level editor, allowing you to make your own levels and then send them to friends if you have the Xbox or Xbox 360 version.</p>"},{"name":"Aliens Versus Predator: Extinction","year":2003,"developer":"Zono, Inc.","url":"microsoft_xbox_a/Aliens%20Versus%20Predator%20-%20Extinction%20%28Europe%29.zip","filesize":6627879166,"score":6.3,"genres":"Action > Strategy > Diagonal-down > Real-time > Sci-fi / futuristic > Licensed","desc":"<p>The battle that has split more blood over centuries continues, with the human marines caught in-between the powerful Aliens and the deadly Predators.</p><p>Moving away from the FPS series on PC, Extinction has you controlling one of the three races in a real time strategy mix, building each unit and setting them out into the battlefield to complete a range of tasks.</p><p>Each race has an advantage and disadvantage. The humans have a collection of different units, from heavy weapons experts to medics, and are better known for their long range attacks. Predators are hardcore fighters, taking the battle right up to the enemy, although there are fewer of them available to counter act their superior power. Finally, the Aliens are fast and deadly, and always hunt in large packs.</p><p>Upgrade weapons and use terrain to an advantage in each level to make certain your team (whoever or whatever they may be) survive until the next battle.</p>"},{"name":"All-Star Baseball 2003","year":2002,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_a/All-Star%20Baseball%202003%20featuring%20Derek%20Jeter%20%28Europe%29.zip","filesize":6501166653,"score":7.3,"genres":"Sports > Behind view > Baseball > Licensed","desc":"<p>Four-time World Series Champion Derek Jeter headlines the 2003 edition of <em>All-Star Baseball</em>. Every player from the Major League Baseball 2002-2003 season is here, with hundreds of stats, rules, and options to modify and jazz up your baseball experience. Along with the usual season mode, there's also the playoffs to be won, home run competitions, multiplayer options and all-star modes. New is the franchise mode which simulates 20 seasons.</p>"},{"name":"All-Star Baseball 2004","year":2003,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_a/All-Star%20Baseball%202004%20featuring%20Derek%20Jeter%20%28USA%29.zip","filesize":6235407227,"score":7.6,"genres":"Sports > Baseball > Licensed","desc":"<p>It's back to the ballpark for the 7th time in this addition to the <em>All-Star Baseball</em> series.</p><p>As in earlier versions, all current Major League Baseball teams players are featured, available for play in a number of single-game, season, and playoff modes.</p><p>New in this version is the inclusion of over 100 legendary players from seasons past, including Babe Ruth, Lou Gehrig, and Ty Cobb. The game's interface has also been revamped to be more user-friendly.</p><p>Derek Jeter returns as the cover athlete for the 2004 version and also plays host for the game's live-action stadium tours and other multimedia features.</p>"},{"name":"All-Star Baseball 2005","year":2004,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_a/All-Star%20Baseball%202005%20featuring%20Derek%20Jeter%20%28USA%29.zip","filesize":6428162423,"score":7.5,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>The 2005 update to the <em>All-Star Baseball</em> series includes online features such as head-to-head play and improved online updates to the rosters (both Xbox and PS2). You can now also bat using the analog controller and two new camera angles have been added: the fieldercam and the broadcastcam.</p><p>As for the gameplay, the create-a-player mode has been enhanced, and a franchise mode has been added. Steve Lyons and Thom Brennaman are the commentators, with Spanish play-by-play by Arizona Diamondbacks' commentator Oscar Soria. The game also includes a full gameplay tutorial for those new to the game.</p><p>There is special attention to the 2003 MLB season, as you can replay historic moments in the <em>This Week In Baseball</em> challenge. With an official license, there are about 80 stadiums, authentic uniforms, and a hall of fame that honours MLB legends. Next to the 30 official Major League teams, there are some historic bonus teams such as a wartime and a postwar stars team, and various fantasy teams.</p>"},{"name":"Alter Echo","year":2003,"developer":"Outrage Games","url":"microsoft_xbox_a/Alter%20Echo%20%28Europe%29.zip","filesize":6036400780,"score":6.6,"genres":"Action > 3rd-person (Other) > Fighting > Puzzle elements > Sci-fi / futuristic","desc":"<p><em>Alter Echo</em> is a third-person action game with a focus on close quarters combat. It is set in the 29th century where a substance named Multiplast replaces all known construction materials because it can be formed into anything. But something is wrong on the planet Proteus, the only known source of Multiplast. Now the simple worker Nevin has to investigate and stop the megalomaniac shape shifter Paavo who controls an even more powerful substance.</p><p>Luckily soon after the beginning of the game Nevin gets his hands on a special suit, which allows him to morph into three forms. The sword form is for melee combat, in which combos can be triggered by using the correct button combinations. The cannon form is a big robot which is more suited for gunplay and the stealth form is a futuristic lizard with a long tongue. During combat the player can instantly switch between the forms, which allows for many combinations depending on the former action or movement. This gets rewarded with plasma points which are used to upgrade Nevin's life energy, new moves or better weapons.</p><p>Besides combat, the game features basic switch puzzles and rhythm-based mini games. Most notable is the Time Dilation Mode, which can be activated near enemies - then the mini game begins and, if successfully completed, launches an especially powerful attack.</p>"},{"name":"America's Army: Rise of a Soldier","year":2005,"developer":"Army Game Studio","url":"microsoft_xbox_a/America%27s%20Army%20-%20Rise%20of%20a%20Soldier%20%28Europe%29.zip","filesize":6613577133,"score":6.8,"genres":"Action > 1st-person > Shooter > Tactical shooter","desc":"<p>This is the console version of America's Army: Operations., the U.S. Army's free \"recruitment tool\" for computers. As in the original, the single-player campaign simulates a soldier's true Army career from boot camp all the way to the Special Forces. Most of the game's missions involve real-world situations today, and the game uses authentic Army weapons and equipment. The 35 unconnected missions are divided into five missions for each class.</p><p>Since the game was developed with the professional advice of actual Special Forces soldiers, it is realistic and forces the player to follow authentic Army tactics. If players use a run-'n-gun approach to the gameplay, they can easily get killed on the battlefield. In multiplayer, the player's experience points determine which class he is able to take. </p><p>There are two major changes to this console version. The \"build-a-soldier\" feature allows the player to fully customize a soldier by changing his name, nickname, face, and even his homestate. Experience points, which are earned at the end of each mission for performing well, can be spent improving the soldier's seven abilities. The experience from multiplayer and single player are separate.</p>"},{"name":"America's Army: Rise of a Soldier (Special Edition)","year":2005,"developer":"Army Game Studio"},{"name":"American Chopper","year":2004,"developer":"Creat Studio, LLC","url":"microsoft_xbox_a/American%20Chopper%20%28USA%2C%20Europe%29.zip","filesize":6252505000,"score":5.6,"genres":"Racing / Driving > Behind view > Real-time > Motorcycle > Vehicle simulator > Licensed","desc":"<p>Based on the TV show of the same name, as seen on the Discovery Channel, this game allows you to customize and race motorcycles.</p><p>There are a variety of challenges available, from regular races, to free-roaming city driving (featuring plenty of regular traffic to work around).</p><p>The game has you be the \"new guy\" on the show; the Teutuls (voiced by the actual people from the show) send you on the various missions. Each mission features several goals, some mandatory while others are optional. Completing the goals unlocks new motorcycles and parts.</p>"},{"name":"American Chopper 2: Full Throttle","year":2005,"developer":"Creat Studios, Inc.","url":"microsoft_xbox_a/American%20Chopper%202%20-%20Full%20Throttle%20%28USA%2C%20Australia%29.zip","filesize":6692811163,"score":"","genres":"Racing / Driving > Behind view > Arcade > Motorcycle > Vehicle simulator > Licensed","desc":"<p><em>American Chopper 2: Full Throttle</em> is the sequel to American Chopper and like its predecessor, based on the Discovery Channel show of the same name.</p><p>You pick one of the four main characters from the show, then one of seven customer motorcycles from the show, and are given a series of mostly racing missions where you earn fabrication points with which to upgrade your bike. These missions include things like nitrous boosts for quick bursts of speed and point bonuses for performing tricks.</p><p>Since <em>American Chopper</em> is a show about making custom bikes, this game offers a wide variety of performance and aesthetic upgrades with the ultimate objective of building your perfect custom motorcycle.</p>"},{"name":"American McGee presents Scrapland","year":2005,"developer":"Mercury Steam Entertainment S.L.","url":"microsoft_xbox_a/American%20McGee%20Presents%20Scrapland%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6618981707,"score":7,"genres":"Action > Racing / Driving > Behind view > Direct control > Sci-fi / futuristic","desc":"<p><em>American McGee presents Scrapland</em> is a third-person 3D action game set on an asteroid called Scrapland, a ruined paradise rebuilt by robots, the only inhabitants now. The player controls D-Tritus, a self-constructed young robot that has just arrived in Chimera, the main city. The adventure begins when he accepts a job as journalist and strange things start to happen...</p><p>The game is a mix between free-form outdoor levels and indoor levels with combat and puzzle-solving elements. During said indoor levels, the player can instantly change his form between 14 robots, all with their own advantages and special abilities. Utilizing those robots is important to solve puzzles or mini games, e.g. only a tiny robot can fit into small spaces and only certain robots are allowed into some areas. However, those disguises can be seen through by certain enemy types. Then it is a good idea to change to a robot with fighting abilities - aiming is basically done automatically by the game.</p><p>The outdoor levels can be freely explored, but there is not much more to do than flying to next the mission objective or indoor level. The parts of the spaceship can be upgraded individually; better parts are gained during the game and by solving optional missions. The player can have up to nine different spaceships and switch between them as needed - a heavy one is better suited for fights while a small one is useful for races.</p><p>Additionally, the game features various outdoor areas which can be started outside the campaign and three multiplayer modes.</p>"},{"name":"AMF Bowling 2004","year":2003,"developer":"Black Market Games","url":"microsoft_xbox_a/AMF%20Bowling%202004%20%28USA%29.zip","filesize":6809379289,"score":"","genres":"Sports > Behind view > Direct control > Bowling > Licensed","desc":"<p><em>AMF Bowling 2004</em> is a bowling game which offers some real-life players and seven licensed bowling alleys. The controls use a standard \"three-click\" method in which players mark down accuracy, power and spin. Here it is important to take the athlete's position (can be changed), hand proficiency and the oil lane into account. Available game modes are a standard match, multiplayer, practice, a team match and two tournaments with or without qualifying. </p><p>Player can create their own bowler by customizing their appearance and the bowling ball. Weight, color and texture can be edited for up to two balls (a primary and a spare).</p>"},{"name":"AMF Xtreme Bowling","year":2006,"developer":"Atomic Planet Entertainment Limited","url":"microsoft_xbox_a/AMF%20Xtreme%20Bowling%20%28USA%29.zip","filesize":6810727281,"score":"","genres":"Sports > Direct control > Bowling > Licensed","desc":"<p><em>AMF Xtreme Bowling 2006</em> is a bowling simulation game. It has nine environments, all in regular or \"xtreme\" versions, colorful customizable characters whose stats increase as you play, customizable oil dispersion on the lane and six modes.</p><p>The modes available are practice, single player, which are self-explanatory, tournament and league, which support up to 8 alternating players and match challenge where you must attempt to get strikes with various pin arrangements of increasing difficulty.</p>"},{"name":"Amped 2","year":2003,"developer":"Access Software, Inc.","url":"microsoft_xbox_a/Amped%202%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":6195321063,"score":8.1,"genres":"Sports > Diagonal-down > Snowboarding / skiing","desc":"<p><em>Amped 2</em> is the sequel to Microsoft's first snowboarding game, Amped: Freestyle Snowboarding.The mountains are larger, there are more goals to accomplish, and there is more diversity to the graphics. Many real snowboarding tricks are including, from Indy's and Mute's to Stalefish's and Tailgrabs. Specific to the sequel are kick flips and shove it's, as well as the ability to link tricks together via \"butter\", similar to Tony Hawk's manual.</p><p>The career mode has you starting out as a level 250 nobody. It's your job to rise the ranks and fight your way to number one in the world. Challenges consist of beating a high score, beating media challenges, performing certain tricks in one run, finding and clearing all the gaps, and knocking down eight snowmen, who taunt you and laugh at you. When you're done with the normal goals, and your player is high enough, you can attempt Sponsor Goals and Photo Shoots, to earn new equipment and further unlock the mountain. Some sponsors may like rails, so you'll have to use just rails to impress them. The photo shoot has you performing tricks to get a set score while going through various rings on a set area of the mountain.</p><p>Once you're finished with single player, you can go online via Xbox Live to play with other people. Your stats will be tracked and you can view your ranking, other player rankings, and where you stand at XSNSports.com. Compete in races, stunt events, or just cruise the mountain.</p>"},{"name":"Amped: Freestyle Snowboarding","year":2001,"developer":"Indie Built, Inc.","url":"microsoft_xbox_a/Amped%20-%20Freestyle%20Snowboarding%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6715884214,"score":7.9,"genres":"Sports > Behind view > Snowboarding / skiing","desc":"<p><em>Amped: Freestyle Snowboarding</em> is a snowboarding game with a large variety of gear, from shirts and pants to jackets and goggles. Players can choose between many snowboards, each licensed from a different sponsor of the game. The goal of the career mode is two rack up as many points as possible and rise in the ranking. This also rewards skill points which can be used to improve the player character's abilities.</p><p>The basic idea is that players find themselves on descending (and branching) courses, overall 120 in three areas, with many possibilities to perform stunts. Of course those are needed to progress in the ranking, but the game takes track of two different scores: the overall course record and media stunts in front of the press. Special events are sponsor races, in which the sponsors have to impressed during the whole race, and duels, in which the course progression of another snowboarder has to emulated and the point result surpassed. The game features a soundtrack of 150 songs along with the possibility to incorporate own music tracks.</p>"},{"name":"AND 1 Streetball","year":2006,"developer":"Black Ops Entertainment, LLC","url":"microsoft_xbox_a/AND%201%20Streetball%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6215208344,"score":5.6,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>In this officially licensed AND 1 Street basketball game, players can take it to the streets with playground legends like The Professor, Main Event, Hot Sauce, and Half Man Half Amazing in 5-on-5 down to 1-on-1 matchups. Ballers can play on over a dozen courts all across the world, from Venice Beach on the West Coast, to Rucker Park in the East, and even \"Down Under\" in Australia. Players can also use the Create-a-Baller feature to build their own Streetball persona and enter the story-driven AND 1 Mix Tape Tour to secure a contract with AND 1 and earn a place among legends.</p><p>The game features motion-captured trick moves, spectacular dunks, and full voiceovers and likenesses of the entire AND 1 team. Multiplayer games are supported on both PS2 and Xbox. If you have the EyeToy camera, you can also put your face in the game (PS2 only).</p>"},{"name":"Angelic Concert","year":2003,"developer":"Kogado Studio, Inc."},{"name":"Animaniacs: The Great Edgar Hunt","year":2005,"developer":"Warthog Plc","url":"microsoft_xbox_a/Animaniacs%20-%20The%20Great%20Edgar%20Hunt%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6759094377,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>Hollywood is in an uproar - the Edgar awards for films have been stolen! The culprit is none other than C.C. Deville, who is threatening to melt down the Edgars unless he gets a ten-picture deal from Warner Bros.! Deville arrives in his airship, but accidentally crashes into the Water Tower, scattering the Edgars across the various movie lot and freeing Yakko, Wakko, and Dot at the same time. Help the Warners reclaim the Edgars!</p><p><em>Animaniacs: The Great Edgar Hunt</em> is a 3D platformer where the player controls Yakko, Wakko, and Dot. Each character has their own special skills that can be unlocked as players progress through the game. For example, Dot can limbo under low walls, Wakko can dig tunnels in soft earth, and Yakko can bomb weak walls. Players progress further through the game by collecting Edgar awards which opens up more areas in the Warner Movie Lots. There are also 300 collectibles in each world; players are awarded one Edgar at 150 collectibles and another at 300.</p><p>In addition to this, there are also bonus mini-games guest-starring Pinky and The Brain. Each of their short games features another failed attempt at world domination. The game also has the original cast of the cartoon reprising their roles for the game. There are also plenty of movie parodies, and it also takes the opportunity to riff a couple of video games as well.</p>"},{"name":"Antz Extreme Racing","year":2002,"developer":"Supersonic Software Ltd.","url":"microsoft_xbox_a/Antz%20Extreme%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6770362596,"score":5.4,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>In <em>Antz Extreme Racing</em>, the characters of the movie <em>Antz</em> are bored and start a racing championship. Each character has eight individual courses and challenges they must take on; besides the initial two the rest has to be unlocked by finishing the game with another character. Like in most arcade racers there are various power ups to collect, e.g. rockets or protective shields. The game features four basic race types: driving the backs of larger bugs, running, flying on the backs of bugs, or surfing on a leaf. </p><p>The game also can be played in four-player split-screen multiplayer.</p>"},{"name":"Aoi Namida (Shokaiban)","year":2004,"developer":""},{"name":"Apex","year":2003,"developer":"Milestone s.r.l.","url":"microsoft_xbox_a/Apex%20%28USA%29.zip","filesize":6651490768,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile","desc":"<p><em>Apex</em> is a racing game with one twist: the player owns a car factory and uses one of its prototypes for racing, not one of the licensed models. However, the prototype can't be designed individually - the player has to choose between between three designs per build. These differ in speed, brakes and acceleration. To keep with the theme, the player races to improve the sales figures, which serve the same purpose as ranking points in other action racers. High enough sales unlock new prototypes and car classes (roadster, speedsters, supercars and dreamcars). The game features 50 courses, various race categories and sometimes special challenges to solve.</p><p>Additionally to this dream mode, there is an arcade mode (single races) which can be played against another player.</p>"},{"name":"Aquaman: Battle for Atlantis","year":2003,"developer":"Lucky Chicken Games, Inc.","url":"microsoft_xbox_a/Aquaman%20-%20Battle%20for%20Atlantis%20%28USA%29.zip","filesize":6765403805,"score":3.1,"genres":"Action > 1st-person > 3rd-person (Other) > Arcade > Flight / aviation > Licensed","desc":"<p>In <em>Aquaman: Battle for Atlantis</em> the player takes the role of the DC superhero Aquaman who has to defend Atlantis from his archenemy Black Manta. The story is told in comic-style cutscenes.</p><p>During the course of the game, Aquaman has to solve 21 missions which mostly involve swimming to a certain place and beating up all enemies. When he engages in combat the camera zooms out and the player presses button combinations to perform standard attacks or combos. Aquaman's cybernetic morphing hook-hand and his telepathic power can be used, too. In some sequences, the game switches to a first-person perspective and Aquaman controls a submarine to attack enemies. The player can unlock the possibility to play as Classic Aquaman, Tempest, or Black Manta.</p>"},{"name":"Arctic Thunder","year":2001,"developer":"Midway Games, Inc.","url":"microsoft_xbox_a/Arctic%20Thunder%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6584597559,"score":6.2,"genres":"Racing / Driving > 1st-person > Behind view > Snowmobile","desc":"<p><i>Arctic Thunder</i>, the fourth installment in Midway's arcade racing series, is a fantasy snowmobile-racing game that plays like a mix of Cruis'n and a kart racer on ice.  The main object of the PS2 and Xbox versions is to upgrade sleds and unlock secret characters or tracks.  You earn Gold Medals or lots of points to unlock most secrets, and you do this by winning races.  The gameplay involves shooting down enemies with weapons, boosting yourself ahead, and pulling off tricks.  Exclusive to the console versions is a Battle Mode that emphasizes the game's frantic combat.</p>"},{"name":"Area-51","year":2005,"developer":"Midway Studios - Austin Inc.","url":"microsoft_xbox_a/Area%2051%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5965235509,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>Area 51, the urban legend, is a U.S. military-controlled base in the Nevada desert, apparently containing a secret aircraft testing facility. It is also famed as the subject of many UFO conspiracy theories. <em>Area-51</em>, the game, is a first-person shooter (FPS) set in this particular base, now infested with rampant aliens and a mutagenic virus that changes your character. As Ethan Cole, Special Forces, specialist in the HAZMAT (hazardous materials) Division, you have to discover what's going on inside the base and blast the menace to save the world. Your character races against time: the same virus that is mutating the facility personnel into monsters is also in his organism, slowly transforming him into an inhuman creature under the control of the alien masterminds.</p><p>The hero has access to more than ten types of human and alien weapons to fight the creatures. They are designed by Stan Winston Studios, monster creator for such films as <em>Aliens</em>, <em>Jurassic Park</em> and <em>Predator</em>. The weapons can be used in melee combat as well, and it's possible to switch to an alternate firing mode, in some cases with the downside that it consumes more ammo. Ethan can also use a scanner to investigate items of interest, documents, alien artifacts and residue. The information contributes to the backstory and is stored in the scanner's databank.</p><p>At a specific point in the game, you will gain the ability to mutate into a creature for a limited time. All monsters and humans are then highlighted by your thermal vision, and you can use claws in melee and shoot heat-seeking parasites. Staying in the mutant form consumes mutagen, which can then be replenished by draining infected corpses, killing enemies in melee or consuming special syringes with mutagen, as opposed to using normal medical syringes to restore health.</p><p><em>Area-51</em> has a two-player split-screen and an online multiplayer (for up to 16 players) component with several modes including Deathmatch, Team Deathmatch, Capture the Flag, Capture and Hold, and Infection. In Infection, all but one player start as normal healthy soldiers hunting one mutant player. The latter is able to create more mutants by killing opposing players, and thus infecting them.</p>"},{"name":"Arena Football","year":2006,"developer":"EA Tiburon","url":"microsoft_xbox_a/Arena%20Football%20%28USA%29.zip","filesize":6660621669,"score":6.3,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Football (American) > Licensed","desc":"<p><em>Arena Football</em> is a simulation of the sport of the same name. It shares many similarities with the Madden Series, whose engine it uses, but has a different play-style thanks to Arena football's rather different rules. The game is played indoors with teams of eight on a 50-yard field and the sidelines and uprights have barriers to make balls that would go out of bounds in standard American football bounce back into the play field. It is still considered live at this point. Obviously, this makes the game much faster-paced and higher-scoring.</p><p>Features include a coach's pick which will recommend plays, a telemetry view, which lets you see how tired both your players and the opposing ones are along with passing routes so you can set good match-ups, a quick play mode, a season mode, which allows you to go up to 20 seasons and trade players, set salaries, etc, practice and online play.</p><p><em>Arena Football</em> is officially licensed by the Arena Football League and includes all the teams and players from the 2006 season. New Orleans VooDoo is not included as they sat this season out due to hurricane Katrina, though their logo is available to use for created teams. Numerous historic teams are also available.</p>"},{"name":"Armed and Dangerous","year":2003,"developer":"Planet Moon Studios","url":"microsoft_xbox_a/Armed%20and%20Dangerous%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":6371855022,"score":7.3,"genres":"Action > 1st-person > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>In <em>Armed and Dangerous</em>, the player controls Roman, a thief in the Lionheads gang. The evil King Forge is attempting to unlock the Book of Rule, which will grant him magical powers. Aided by a blind seer and his thieving friends - a robot and a mole - Roman decides to intercept the book and banish the king.</p><p>The game is a variation of the run-and-gun third-person shooter. Created by Planet Moon, it has the same humour and similar gameplay elements as Giants: Citizen Kabuto. </p><p>The game has several unusual characters and weapons. Included is the shark gun, a device that literally shoots a shark at your enemies. There is a corkscrew device that burrows in to the ground and inverts gravity. You hang on to the device while your enemies fly into the sky and fall hard back to the ground.</p>"},{"name":"Army Men: Major Malfunction","year":2006,"developer":"Team17 Software Limited","url":"microsoft_xbox_a/Army%20Men%20-%20Major%20Malfunction%20%28USA%2C%20Europe%29.zip","filesize":6864366135,"score":5.1,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p>Major Malfunction has gone bad. He has holed himself up inside a house and is leading an army of toys against the Army Men. The player takes control of Private Anderson and it's his job to infiltrate the house, take out Major Malfunction's army, and stop the major himself.</p><p><em>Army Men: Major Malfunction</em> is a 3rd-person platformer/shooter. Shoot, dodge, and jump through over 30 missions. Each level has 10 service medals hidden in out-of-the-way places, which unlock extras. Weapons include, among others, the standard assault rifle, a mini-gun, and a bazooka, with weapon power-ups scattered around the levels.</p>"},{"name":"Army Men: Sarge's War","year":2004,"developer":"The 3DO Company","url":"microsoft_xbox_a/Army%20Men%20-%20Sarge%27s%20War%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6669135801,"score":5.8,"genres":"Action > 1st-person > Behind view > Shooter > Direct control","desc":"<p>The story: in a new, grittier direction for the Army Men series, Sargeant Hawk takes on his most insidious enemy yet: Lord Malice. After years of conflict, the Green army has finally defeated the Tan menace. On the eve of the peace ceremonies, a ruthless attack wipes out all of Sarge's squad. It's now up to Sarge to even the score.</p><p>Gameplay: This is primarily a level-based, third-person shooter. Most of the weapons can also be used in a first-person view. The game includes some multiplayer games for two to four players on some platforms.</p>"},{"name":"Arx Fatalis","year":2003,"developer":"Arkane Studios SA","url":"microsoft_xbox_a/Arx%20Fatalis%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6234812831,"score":7.6,"genres":"Role-playing (RPG) > 1st-person > Action RPG > Puzzle elements > Direct control > Fantasy > Regional differences","desc":"<p>Arx was a once a prosperous place. However, after one night the sun of the world of Exosta never rose again, and the blistering cold forced their inhabitants into the dwarf mines. There, a new city was built, and humans, trolls, goblins, dwarves, and other races lived along peacefully, until the scarce resources proved to be too few for everyone. The animosity started to build up, and conflict between races ensued. The protagonist starts the game dazed out, being dragged into a cell by a goblin. Where is he? Why did he end up there? <em>Who</em> is he? With only that in mind, the adventure starts...</p><p>Inspired by the Ultima Underworld series, <em>Arx Fatalis</em> is a first-person role-playing game taking place in a vast underground world. All the locations and interconnected by passages, tunnels, and stairs, with eight levels altogether. Despite their dungeon-like appearance, locations also include populated settlements such as the city of Arx, where the player character can buy and store supplies, as well as other non-hostile areas. The player, however, is free to attack and possibly kill any non-player character encountered. While several main quests must be completed in a specific order to unlock a new area, the player can access and explore certain locations freely at some points in the game. There are no dialogue options, but some missions can be completed in different ways, and there are also a few side quests.</p><p>The player generates and builds up the main character by customizing his main attributes (strength, intelligence, dexterity, and constitution) as well as various skills, which include close or ranged combat proficiencies, technical skill for lockpicking and disarming traps, and others. Vanquishing enemies and completing quests yields experience points, which are converted to attribute and skill points when the protagonists levels up and can be allocated manually. Much of the combat in the game can be avoided, and the player may opt to develop a stealthy character, a spellcaster, a ranged attacker, as well as the traditional physical type. </p><p>Combat in the game is action-based. The player can press down the attack key to build up force in order to strike more efficiently. It is also possible to execute several types of melee attacks by combining them with directional arrows. One of the unique aspects of the game is the spell-casting system, where the player uses the mouse (or the directional pad in the Xbox version) to draw the runes constituting a particular spell. The most complex spells can be performed by combining runes. Spells can also be readied and cast simply by pressing a corresponding key. Casting spells depletes the protagonist's magic points. </p><p>As some places lack light sources, players can take advantage of the darkness to stealthily move in the shadows, or use torches to lighten up a room to search for some object or find their way in a path. The game's world offers interactivity by allowing the player to pick up, drag, and place most objects. Food must be collected and eaten periodically to prevent the protagonist from dying of hunger. The player can combine various items to create new ones, as well as modify their properties. For example, it is possible to cook food, bake bread, use tools such as pickaxes and shovels, and brew potions.</p>"},{"name":"AstroPop Deluxe","year":2005,"developer":"PopCap Games, Inc."},{"name":"Atari: 80 Classic Games in One!","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"microsoft_xbox_a/Atari%20Anthology%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6669449080,"score":7.3,"genres":"Compilation","desc":"<p><em>Atari: 80 Classic Games in One!</em> contains Atari 2600 games from the 1970's and 1980's. Over 85 games are reproduced, including arcade titles: Asteroids, Asteroids Deluxe, Battlezone, Black Widow, Centipede, Crystal Castles, Liberator, Lunar Lander, Gravitar, Major Havoc, Millipede, Missile Command, Pong, Red Baron, Space Duel, Super Breakout, Tempest, and Warlords.</p><p>Also included are Atari 2600 titles: 3D Tic Tac Toe, Adventure, Air-Sea Battle, Asteroids, Atari Video Cube, Backgammon, Battlezone, Blackjack, Bowling, Breakout, Canyon Bomber, Casino, Centipede, Circus Atari, Combat, Crystal Castles, Demons to Diamonds, Desert Falcon, Dodge 'Em, Double Dunk, Flag Capture, Football, Fun with Numbers (a.k.a. Basic Math), Golf, Gravitar, Hangman, Haunted House, Home Run, Human Cannonball, Math Gran Prix, Maze Craze: A Game of Cops 'n Robbers, Millipede, Miniature Golf, Missile Command, Night Driver, Off the Wall, Outlaw, Quadrun, Radar Lock, RealSports Baseball, RealSports Football, RealSports Tennis, RealSports Volleyball, Sky Diver, Slot Machine, Slot Racers, Space War, Sprintmaster, Star Raiders, Star Ship, Steeplechase, Stellar Track, Street Racer, Submarine Commander, Super Baseball, Super Breakout, Super Football, Surround, SwordQuest: EarthWorld, SwordQuest: FireWorld, SwordQuest: WaterWorld, Video Checkers, Video Chess, Video Olympics, Video Pinball, Warlords, and Yars' Revenge.</p><p>Each genre of game is broken down into an individual hub where gamers can check out both arcade and home came versions of these classics. As bonus features, gamers are offered comics, instruction manuals, catalogs, and updated visual modes, which allow higher res versions of the games, to features which distort gameplay to make the games more challenging.</p>"},{"name":"ATV: Quad Power Racing 2","year":2003,"developer":"Climax (Brighton) Ltd","url":"microsoft_xbox_a/ATV%20-%20Quad%20Power%20Racing%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6846212068,"score":7.4,"genres":"Racing / Driving > Behind view > Arcade > Off-roading > Vehicle simulator","desc":"<p><em>ATV Quad Power Racing 2</em> is the sequel to ATV: Quad Power Racing, with many new features.</p><p>Choose from 10 of the top professional riders from all over the world, including Dana Creech, Kory Ellis, and Tim Farr.Race through 17 massive tracks and five environments, located in challenging countries throughout the world.Get dirty and physically fight with opponents to the finish line, letting them know that you're king off-road.Over-the-top controls and game physics, allowing players to pull huge air and amazingly fun power slides.More than 20 freestyle tricks to let riders express their wild side while tearing up the competition.Several multi-player modes of play bring action to players and their friends.Real-life in-game sponsors, adding to the realism of the game.</p>"},{"name":"Auto Modellista","year":2004,"developer":"Capcom Production Studio 1","url":"microsoft_xbox_a/Auto%20Modellista%20%28USA%2C%20Japan%29.zip","filesize":6696657397,"score":6.6,"genres":"Racing / Driving > Anime / Manga > Arcade > Automobile > Track racing","desc":"<p><em>auto modellista</em> is a cel-shaded racing game featuring many high-performance cars from different manufacturers, including Mazda, Honda, Toyota, and Subaru, as well as some Japanese concept cars.</p><p>The game has a few modes: garage life, two-player split-screen, time trial, and arcade. Garage life is the main mode in the game. Here the player will race with any of the cars they have unlocked over seven levels, each with a different number of races. The player will need to finish first in some or all of the races to move to the next level. Winning these races unlocks new parts, items, and cars. In the garage, the player may customize the appearance of their car with stickers and body parts previously won. It's also possible to tune the car by adjusting brakes, suspension, tires, etc. </p><p>The US version of the game also supports on-line play (broadband only).</p>"},{"name":"Avatar: The Last Airbender","year":2006,"developer":"THQ Australia Studios Pty Ltd."},{"name":"Azurik: Rise of Perathia","year":2001,"developer":"Adrenium Games","url":"microsoft_xbox_a/Azurik%20-%20Rise%20of%20Perathia%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6401920862,"score":5.8,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy","desc":"<p>Young Azurik must learn to control the elements, Earth, Air, Fire, and Water, using his double sided ax, the Axion.  His goal is to restore balance to the universe.  You must journey through a vast, mysterious land, full with dynamic and dangerous creatures.</p><p>As Azurik, you must travel through four realms, each associated with the four elements.  The Earth realm contains numerous mountains, lots of dirt and dust terrain, and rocks.  The Air realm is populated by clouds and floating islands.  The Fire realm is alive with molten lava, fissures and spewing geysers.  The Water realm is submerged.  Azurik must recover the four elements and return them to their rightful place before the world collapses.</p>"}]