[{"name":"Backyard Wrestling 2: There Goes the Neighborhood","year":2004,"developer":"Paradox Development","url":"microsoft_xbox_b/Backyard%20Wrestling%202%20-%20There%20Goes%20the%20Neighborhood%20%28Europe%29.zip","filesize":6536305226,"score":5.4,"genres":"Sports > 3rd-person (Other) > Fighting > Wrestling > Licensed","desc":"<p>Backyard Wrestling 2: There Goes the Neighborhood is the second game in a series of fast paced fighting-wrestling hybrid games.  The game is based on the BYW license, a gruesome series of videos of amateur wrestlers who actually do, at times, wrestle in backyards.  In the game, a tournament has shown up in your town, and the one million dollar prize is turning everyone into a backyard wrestler, and every place into a ring.  Players take their created wrestler through the different federations to have a chance at the money.  There is a versus mode, and unlockable content.</p>"},{"name":"Backyard Wrestling: Don't Try This at Home","year":2003,"developer":"Paradox Development","url":"microsoft_xbox_b/Backyard%20Wrestling%20-%20Don%27t%20Try%20This%20at%20Home%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6513801172,"score":5.9,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Wrestling need not be limited to a ring and bare arms. In Backyard Wrestling you can use bricks, tables and anything else found within range - nothing in the environment is statically painted-on. These objects are incorporated into many surprising stunts. The damage modeling includes full blood and gore, which coupled with an intense rock-rap soundtrack ensures that this is not a game for younger players. There are 30 pre-configured wrestlers, and you can create your own to take them on.</p>"},{"name":"Bad Boys: Miami Takedown","year":2004,"developer":"Blitz Games Ltd","url":"microsoft_xbox_b/Bad%20Boys%20-%20Miami%20Takedown%20%28USA%29.zip","filesize":6366885738,"score":4.6,"genres":"Action > 1st-person > Behind view > Shooter > Licensed","desc":"<p>This game is based on the Will Smith &amp; Martin Lawrence buddy cop movie sequel Bad Boys II.  You can play as either character, Mike, or Marcus, from 1st or 3rd person viewpoints. Each has their own personalities and characteristics. </p><p>Through 15 stages, you engage in fast-paced all-action gameplay that features multiple mission objectives. Shoot your way through Colombian drug lords, Russian mobsters, and even dirty cops. Sometimes you will need to protect your computer-controlled partner or collect some evidence.  You can often duck behind a wall or around a corner, from where you will be able to pick off your targets with less chance of being hit. You will be accordingly rewarded on your successful actions and achievements on a \"Bad Boy\" rating system. You can follow all the laws and avoid unnecessary damage or take the opposite approach and be a Bad Boy. There's a good amount of different weapons from pistols and shotguns to automatic assault rifles and grenades. Environments are fully destructible. You can use a quick aiming and shooting Action mode, or search for clues and evidence using the Explore mode.</p>"},{"name":"Baldur's Gate: Dark Alliance","year":2002,"developer":"Snowblind Studios, Inc.","url":"microsoft_xbox_b/Baldur%27s%20Gate%20-%20Dark%20Alliance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6195941448,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Hack and slash > Fantasy > Licensed","desc":"<p><em>Baldur's Gate: Dark Alliance</em> is an action RPG which casts the player as one of three basic characters: an elf sorceress, a human archer, or a dwarf fighter. From humble beginnings slaying rats in the cellars of an inn, the adventurer will move on to exploring caves, crypts, and mountain passes. Naturally, it's all filled to the brim with horrible monsters, wicked traps, treasures, and fabled magical weapons. As the game progresses, the player is constantly rewarded with new weaponry, new monsters to fight, and experience points to put into the adventurer's character stats to grow even more powerful. The adventurer must eventually unravel the secrets of a dark, new Thieves Guild backed by powerful mages.</p>"},{"name":"Baldur's Gate: Dark Alliance II","year":2004,"developer":"Black Isle Studios","url":"microsoft_xbox_b/Baldur%27s%20Gate%20-%20Dark%20Alliance%20II%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5994860036,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Hack and slash > Fantasy > Licensed","desc":"<p>The threat of the Onyx Tower has passed for now, but mere moments pass before a new threat to the Sword Coast arises. The heroes of the Onyx Tower have disappeared, so the fate of Baldur's Gate now rests on the shoulders of five wandering adventurers who are only now journeying into the region.</p><p><em>Baldur's Gate: Dark Alliance II</em> can be played solo or cooperatively with one other player, each choosing from 5 playable characters. The gameplay is the same as its previous incarnation: kill monsters and bad guys to collect treasure, items, and experience. By talking to townspeople in Baldur's Gate the player can learn of optional maps filled with more dangerous monsters and additional treasure. Equipment can be enchanted by the player this time, and given various magical effects such as additional fire damage, absorbing mana, or boosting stats.</p>"},{"name":"Barbarian","year":2003,"developer":"Saffire, Inc","url":"microsoft_xbox_b/Barbarian%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6784454596,"score":6.2,"genres":"Action > 3rd-person (Other) > Fighting > Direct control > Fantasy","desc":"<p>A dark and evil force has spread over the land of Barbaria. Rumors say that the evil wizard called Zaugg is responsible. Prophecies foretell of a savior of the land who can prove to be a champion and defeat Zaugg. Ten Barbarians, all with their own reasons to hate Zaugg, come forward, each willing to destroy the wizard and prove themselves the hero of prophecy.</p><p><em>Barbarian</em> is a 3D vs. fighting game in a fantasy setting, inspired in gameplay largely by the Power Stone series. The game features ten characters who battle it out in fully three-dimensional, multi-level arenas, including castles, sewers, shipwrecks, swamps, and caverns.</p><p>Training mode includes tutorials for all of the game's moves and a practice session against a live opponent. Versus mode allows players to set up any fight they want, including four-player battles. The game's main single-player mode is Quest mode. Players select one of the ten characters, each of which has their own storyline. The story includes fights against all the other characters in the game and also features mirror matches. In some of the fights, opponents bring some lesser minions with them for support. After a fight is won, players can select which opponent to take on next, allowing for different paths through the story. Also after a fight, players can update their characters, raising their attributes like life, strength, damage dealt or magic regeneration time, and also unlock special abilities like double jumps or a berserker mode.</p><p>The fighting system is based on two basic buttons, one for weak and quick, one for strong and slow attacks. Stringing button combinations together enables combos, which each character having their own set. Some combos unleash magical attacks, which require the magic bar to be filled. Landing combos successfully enables additional rune attacks. Blocking and counters are also possible. The game's levels feature many objects to pick up that can be used as throwing or melee weapons. Objects come in different weights and require a certain amount of strength to pick up.</p>"},{"name":"Barbie Horse Adventures: Wild Horse Rescue","year":2003,"developer":"Blitz Games Ltd","url":"microsoft_xbox_b/Barbie%20Horse%20Adventures%20-%20Wild%20Horse%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6619714438,"score":6.4,"genres":"Sports > 3rd-person (Other) > Horse / derby > Licensed","desc":"<p>In <em>Barbie Horse Adventures: Wild Horse Rescue</em>, a bunch of horses have been frightened by a lightning storm and Barbie must go round them back up. Her horse serves to move her around the terrain, but she must get off to do much else. The storm also knocked some things down, so she must climb or clear obstacles to access certain areas.</p><p>When she finds a horse, she must pet it to calm it down if it's a foal, or lasso a bigger horse, then lead it to a hitching post and call the stable on her cell phone. There are also coins to find which can be used to buy new outfits for Barbie or her horse. The object of the game is to rescue all the horses and complete Barbie's wardrobe.</p>"},{"name":"Bard's Tale, The","year":2004,"developer":"inXile Entertainment, Inc.","url":"microsoft_xbox_b/Bard%27s%20Tale%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6293627938,"score":7.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Fantasy","desc":"<p>The Bard is a cynical, opportunistic musician who roams the country in search of carnal pleasures. However, this impatient and selfish fellow is compelled to accept the greatest quest of his life: save the princess Caleigh from a demonic cult that has kidnapped her. The unlikely hero must now explore the land in search of the princess, accompanied by the omnipresent Narrator who obviously can't stand the Bard and uses every opportunity to sarcastically comment on his actions. Furthermore, Fionnaoch, the mysterious abductor of the princess, does everything he can to stop the Bard, sending his minions after him.</p><p>A self-proclaimed \"quest for coin and cleavage\", <em>The Bard's Tale</em> is an action RPG that is more of a whimsical take on role-playing games than a remake of the classic series. As the Bard, players can fight off hordes of foes with blade and bow, and summon companions through magical Bard Songs. Leveling up allows the player to raise the character's main attributes and invest specialization points in the different types of weapons he can use. Magical companions must be sought out and then summoned during battles. After being summoned, they act pretty much like AI-controlled party members; some of them specialize in physical attacks and offensive spells, while others can heal the hero.</p><p>During conversations the player can choose \"nice\" or \"snarky\" responses for the protagonist. While mostly used for humorous effect, some of these responses may affect subsequent events. The game uses the Dark Alliance engine and has a similar camera and control scheme.</p>"},{"name":"Bass Pro Shops: Trophy Bass 2007","year":2006,"developer":"Big John Games","url":"microsoft_xbox_b/Bass%20Pro%20Shops%20-%20Trophy%20Bass%202007%20%28USA%29.zip","filesize":6787873396,"score":"","genres":"Racing / Driving > Sports > 1st-person > Behind view > Fishing > Naval / watercraft > Licensed","desc":"<p><em>Bass Pro Shops: Trophy Bass 2007</em> is the sixth game in the <em>Bass Pro Shops</em> series. This fishing simulation carrying the license for the Bass Pro Shops brand of gear allows players to fish in seven different bass tournaments at thirteen lakes and reservoirs. There are challenges for casting as well as boat races on the lake. Some of the included bass types are Largemouth Bass, Smallmouth Bass, Walleye and Northern Pike. On the lakes players get to drive Nitro boats from Tracker Marine. The racing courses also have ramps.</p><p>When at a location the boat can be driven freely to find a good spot. The fishing sequence is split up into two parts. Prior to casting the player can select cast types, change the lure, change the tackle etc. After casting there are controls to rod, set hook, reel in, adjust the drag and more. There is a career mode where doing well is rewarded with sponsorship patches and cash. Players can also design a custom angler.</p>"},{"name":"Bass Pro Shops: Trophy Hunter 2007","year":2006,"developer":"Jarhead Games Inc.","url":"microsoft_xbox_b/Bass%20Pro%20Shops%20-%20Trophy%20Hunter%202007%20%28USA%29.zip","filesize":6787952511,"score":"","genres":"Action > 1st-person > Behind view > Hunting > Shooter > Direct control > North America > Licensed","desc":"<p><em>Bass Pro Shops: Trophy Hunter 2007</em> is a hunting game carrying the Bass Pro Shops license for gear. This game lets the player stalk fourteen animals including grizzlies, musk oxes, polar bears and whitetails in ten different environments. The game is played from a first-person or third-person behind view perspective and ATVs or snowmobiles can also be used to get around depending on the location, ranging from the snow in the Northwest Territories to the Rocky Mountains. Hunting is done by picking up visual tracking queues.</p><p>There are two game modes: Quick Hunt or a Career Mode with a focus on different scenarios and objectives. The included RedHead hunting equipment includes calls and survival gear, and weapons such as bows, rifles and shotguns.</p>"},{"name":"Batman Begins","year":2005,"developer":"Warner Bros. Interactive Entertainment Inc.","url":"microsoft_xbox_b/Batman%20Begins%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6145178128,"score":6.9,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other) > Stealth > Direct control > Fantasy > Licensed","desc":"<p>In this adaptation of the film of the same name, the origins of the Batman legend are explored. Playing as both Bruce Wayne and his alter-ego, Batman, you will need to hunt evil forces in familiar locations such as Arkham Asylum, Gotham City, but also in the Himalaya. Using both stealth and brutal skills, you take on enemies in true beat-em-up style. Batman has a vast array of moves, from kicks and punches to more exotic special moves. Multiple enemies can be attacked at once, and there are tricks to break through enemies' defenses. Also, certain attacks can only be used as a finishing move when opponents are weakened.</p><p>Next to the melee combat, Batman carries his Bat Utility Belt with a Batgrapple to reach higher areas, the Batarang and gadgets such as smoke and flash grenades, a lockpick, camera hacker and an optical wire to peek from behind corners.</p><p>Certain levels turn Batman Begins into a racing game, as you drive the shiny Batmobile at high speeds through Gotham City. During these missions, your progress is measured by a reputation meter, which increases when you take out cops and thugs, and decreases when you harm civilians. There is nitro available for even higher speeds and an armor meter shows the status of your car.</p>"},{"name":"Batman: Dark Tomorrow","year":2003,"developer":"Kotobuki System Co., Ltd.","url":"microsoft_xbox_b/Batman%20-%20Dark%20Tomorrow%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6559954736,"score":3.7,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>Become vengeance and take on the night in this Batman adventure.  Batman: Dark Tomorrow reaches deep into the Batman canon, setting the Dark Knight against the villainous machinations of Ra's Al Ghul, the Joker, Poison Ivy, and more.</p><p>Batman is well-armed in this outing, having full access to every item in the Batcave.  Thugs must be Batcuffed after Batman knocks them out.  Batman navigates through the night using his Batgrapple.  Batman uses Batarangs and smoke bombs to disable and disorient attackers.</p>"},{"name":"Batman: Rise of Sin Tzu","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_b/Batman%20-%20Rise%20of%20Sin%20Tzu%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6711561754,"score":6.3,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p>On the anniversary of the death of his parents, Bruce Wayne must face a new evil that is turning Gotham City into a crisis zone. Batman must rise to the challenge, as Sin Tzu leaves his mark on the city.</p><p>Along with Robin, Nightwing and Batgirl, Batman must battle through various locations in Gotham City in search of the truth behind this new foe, while fighting off the threat from other well-known characters from the comic book series, Bane, Clayface and Scarecrow.</p><p>Batman can use his full collection of weapons and gadgets to his advantage, including the Batarang and grappling hook. Plus there's plenty of martial arts moves to bust on the bad guys, and if it's too much to fight off, the 2 player co-op mode allows two characters to battle side-by-side.</p>"},{"name":"Batman: Vengeance","year":2001,"developer":"Ubi Soft Entertainment Inc.","url":"microsoft_xbox_b/Batman%20-%20Vengeance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6798564522,"score":6.7,"genres":"Action > 1st-person > 3rd-person (Other) > Cyberpunk / dark sci-fi > Licensed","desc":"<p>Based on the cartoon series rather the comic books or the movies, <em>Batman: Vengeance</em> puts you in the role of the 'Dark Knight' in a 3D Gotham City, in order to face and fight enemies; such as Mr. Freeze, Poison Ivy, Harley Quinn, and, yes, The Joker.</p><p>The Joker has died after falling from a bridge mid-scuffle with our caped hero. With the big man's place at the top of the criminal hierarchy up for grabs, the city's most heinous villains are out in force, clambering over each other for the new employment opportunity. Batman's most dangerous opponents are causing a crime wave the likes of which Gotham has never seen. Nothing is as it seems. You can't even be sure that the infamous Joker has really ceased to exist. Gotham's safety hangs in the balance and only Batman can save it.</p>"},{"name":"Battle Engine Aquila","year":2003,"developer":"Lost Toys Ltd","url":"microsoft_xbox_b/Battle%20Engine%20Aquila%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5814357559,"score":7,"genres":"Action > 1st-person > Shooter > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the future, on the planet Allium, the situation has become desperate. This world has suffered from global warming, causing the polar ice caps to melt. The rising sea has resulted in the amount habitable land to decrease dramatically. All that is left are island chains, making land the most valuable resource on the planet. The entire population must survive and compete over these islands.</p><p>Currently, there are two distinct civilizations on Allium, settled into an uneasy cease-fire. There are the scientifically advanced Forseti and the aggressive Muspell. The Forseti have recently developed the most advanced combat vehicle in existence, the Battle Engine Aquila. The Aquila is both a four-legged mechanized tank and a combat jet, it is capable of switching modes at will. Players take the role of Hawk Winter, a Forseti cargo loader operator who has been conscripted because of his piloting skills.</p><p><em>Battle Engine Aquila</em> is a mechanized shooter taking place in a larger battlefield. The player plays only a single, yet important, role in a larger war effort. A large part of the gameplay consists of supporting and being supported by the allied forces. Players will have to fight naval, air, and ground forces in both modes of their battle engine.</p>"},{"name":"Battlefield 2: Modern Combat","year":2005,"developer":"Electronic Arts UK Ltd.","url":"microsoft_xbox_b/Battlefield%202%20-%20Modern%20Combat%20%28Europe%29%20%28En%2CEs%2CNl%2CSv%29.zip","filesize":6098310577,"score":7.7,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Helicopter > Tank > Contemporary > War","desc":"<p>Although called Battlefield 2, this is the first of the Battlefield series to pass over to console. Vehicles like the Humvees, tanks, APCs and helicopters all make it into the game although fixed wing aircraft are noticeable absent.</p><p>Multiplayer allows up to 24 players battle it out in a Conquest mode where you capture flags and maintain control of them until the enemy tickers run down, or Capture the Flag which is all out attack to get the enemy flag back to your own base. A single player campaign, which is story led, see's China and USA go up against each other in Kazakhstan.Throughout the single player campaign you switch between China and USA armies as you follow orders based on news reports which show both sides of the war giving you a view of how war is and how it's reported.The new Hot Swap feature allows you to jump into almost any other allied troop on the battlefield which saves loads of running and gets you into the best position for your next attack or defense.</p>"},{"name":"Battlestar Galactica","year":2003,"developer":"Warthog Games Ltd.","url":"microsoft_xbox_b/Battlestar%20Galactica%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6357008746,"score":6.9,"genres":"Action > Simulation > 1st-person > Behind view > Shooter > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Set 40 years before the Sci-Fi Channel's 2004 <em>Battlestar Galactica</em> miniseries, the game acts as a prequel to the events in the new series. Players control Captain William Adama as he participates in 15 missions leading up to the end of the First Cylon War.</p><p>Missions are tightly scripted. Players control three varieties of Viper fighters, as well as captured Cylon raiders, depending on the needs of the mission. Players also will man the stationary defense turrets on board the <em>Galactica</em>. Missions have clear goals, often with time limits, and are expressed and tracked through voiced radio chatter between wingmen and <em>Galactica</em>'s war room. Players are graded in a variety of areas after each level (including accuracy and keeping wingmen alive), and unlock upgrades and bonus material for high ratings.</p><p>Players control their craft from either a first or third person view. Fighters have unlimited ammo, missiles, and auto-repair any damage taken, but only if enough recharging energy is available. Firing weapons and using afterburners drain energy, and the fighter only repairs itself when the energy level is full. Players must be aware of their energy usage to keep from running out at critical moments.</p><p>Missiles on every craft can also be configured on the fly through an option in the pause menu. Pilots can program missiles to have increased power at the cost of speed, or increase maneuverability at the cost of blast radius. This system allows players to adapt their missiles to the current needs of the mission, from swatting down formations of fighters to breaking through a capital ship's defenses.</p><p>Though it acts as a prequel to the new series, art and design is pulled from the original 1978 <em>Battlestar Galactica</em>. The intro from the original series is used. Cylons Raiders, Colonial Vipers, and the <em>Galactica</em> itself use the original designs, Cylons themselves look like the original chrome toasters, and the reptilian race that created them (in the original series, not the reboot) make appearances.</p>"},{"name":"Beast, The","year":2003,"developer":""},{"name":"Beat Down: Fists of Vengeance","year":2005,"developer":"cavia inc.","url":"microsoft_xbox_b/Beat%20Down%20-%20Fists%20of%20Vengeance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6169035995,"score":5.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Fighting > Direct control","desc":"<p>You start out in an abandoned warehouse in the grimy city of Las Sombras ready to make a drug deal and then all hell breaks loose. You have been double-crossed by your current cartel and now you seek revenge. In this beat-em up with light rpg elements, you get to choose one of the five characters whose names are: Raven, Jason G, Gina , Lola and Aaron. You walk through the city with two optional allies getting into fights with other gang members, Some gang members are able to be recruited if you best them in a one on one fight. You also have a crime level which makes gang members and police able to identify you. You can lower your crime level by purchasing and then wearing different outfits. You can also level up your characters attack, stamina and technique by gaining experience from fighting,There are two multiplayer modes in Beatdown: VS mode normal, where you can select up to three characters for your team, then choose player vs cpu, player vs player and cpu vs cpu; and also VS mode custom, where you select up to three characters for your team and load a three character party that you have recruited from the single player game.</p>"},{"name":"Beats of Rage","year":2004,"developer":"Senile Team"},{"name":"Bejeweled: Deluxe","year":2004,"developer":"PopCap Games, Inc."},{"name":"Beyond Good & Evil","year":2003,"developer":"Ubisoft Pictures SAS","url":"microsoft_xbox_b/Beyond%20Good%20%26%20Evil%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6639964967,"score":8.1,"genres":"Action > Racing / Driving > 1st-person > Behind view > Puzzle elements > Shooter > Stealth > Direct control > Flight / aviation > Hovercraft > Space flight > Sci-fi / futuristic > Spy / espionage","desc":"<p>In the future, on the planet Hillys, the population suffers from constant attacks from the alien DomZ. The situation is gradually getting worse, as the rate of DomZ kidnapings increases. The Alpha Section forces, who are in charge of protecting citizens, seem to be completely ineffective, not even fighting the DomZ. In the midst of this situation, the secretive organization IRIS alleges that the Alpha Section is involved in a massive government conspiracy, and seeks to expose the truth through journalism.</p><p>The player controls a young reporter and photographer named Jade with her companions Pey'j and Double H. After experiencing first-hand a DomZ attack, she is contacted by IRIS, who recruits her as an action reporter. Jade is now tasked with infiltrating the Alpha Section, exposing the government conspiracy, and ultimately finding the truth for herself.</p><p><em>Beyond Good &amp; Evil</em> is an action game with diverse gameplay. Much of the game is based on stealth and puzzles, but there are sequences of racing, shooting, combat, and platform action. Jade fights with her staff and also uses various abilities to execute long-ranged attacks and solve puzzles. Many of the puzzles require switching between the characters and using their special abilities; often it is necessary to coordinate the actions of two characters to achieve precise co-operation that leads to a puzzle's solution. Besides hostile areas with puzzles and enemies, there is also a city and other friendly areas to explore, where various items and gadgets can (and sometimes must) be bought. There are several mini-games and even an online ranking system (used by entering codes online after they are assigned in-game when the game is saved).</p>"},{"name":"Bible Game, The","year":2006,"developer":"Mass Media, Inc.","url":"microsoft_xbox_b/Bible%20Game%2C%20The%20%28USA%29.zip","filesize":6878312734,"score":"","genres":"Educational > Simulation > Game show / trivia / quiz > Religion","desc":"<p><em>The Bible Game</em> is a Christian-themed party game. There are a variety of trivia questions (from a pool of 1,500) related to the Old Testament. The main two modes are \"TV Game Show\" and \"Challenge Games\". The latter lets you choose any mini-game. In the TV Game Show mode players need to buzz in quickly to answer. The game supports up to four players and includes 20 mini-games based on Biblical stories, from Jonah and the Whale to David and Goliath. It also includes music by Christian artists.</p>"},{"name":"Bicycle Casino","year":2004,"developer":"Leaping Lizard Software, Inc.","url":"microsoft_xbox_b/Bicycle%20Casino%20Includes%20-%20Texas%20Hold%27em%20%28USA%2C%20Europe%29.zip","filesize":5267988635,"score":5.9,"genres":"Gambling > 1st-person > 3rd-person (Other) > Cards / tiles > Licensed","desc":"<p>Licensed by card manufacturer Bicycle, this game lets you gamble on the Xbox with slot machines, card games, keno, roulette, money wheel, pai gow, craps and different types of poker, including the popular Texas Hold'Em. The game boasts 500 variations, but most of them are based on the table limits for each game. You start by creating a character with different options for skin tones, facial features clothes, accesoires. The gameplay for table games is shown through a camera hovering about the players.</p><p><em>Bicycle Casino</em> has support for Xbox Live. You can talk, bluff or threaten through the head-set, or use in-game animations and emoticons. Hints and strategy tips are included for all games.</p>"},{"name":"Big Bumpin'","year":2006,"developer":"Blitz Arcade","url":"microsoft_xbox_b/Big%20Bumpin%27%20%28USA%29.zip","filesize":6445916647,"score":6.6,"genres":"Action > Racing / Driving > Diagonal-down > 2D scrolling > Arcade > Direct control","desc":"<p>Get bumped royally. In Big Bumpin'; part of a trio of budget games released by Burger King from November 19th to December 24th 2006; your job is to go head to head with friends online and off in a bumper car mayhem. </p><p>You will choose from six characters and five arenas and compete in five different bumper car competitions. The playable arenas include, Ice Box, King's Court, Broiler, and Monsoon of Doom. The playable characters include; of course Burger King's The King mascot, Brooke Burke, and Subservient Chicken. The competitions are; Own the Puck, where you must keep the puck away from the other players the longest, Last Man Standing, where you have to outlast all your competitors, Power Surge where you must race to keep all your power, Shockball, which is a hot potato kind of game involving exploding bumper cars, and the last game is Hockey, where you basically play two-on-two hockey with power-ups and weapons. Big Bumpin' also has a character creation mode where you can make a player as well as a bumper car. It also includes a tournament mode available only to solo players.</p>"},{"name":"Big Mutha Truckers","year":2002,"developer":"Eutechnyx Limited","url":"microsoft_xbox_b/Big%20Mutha%20Truckers%20%28USA%29.zip","filesize":6662486628,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Managerial / business simulation > Transport > Truck > Vehicle simulator","desc":"<p>Ma Jackson, the owner of Big Mutha Truckers, tells her four sons she is retiring. The new owner of Ma's company will be the son who makes the most money trucking through Hick State County for 60 days.</p><p><em>Big Mutha Truckers</em> is a truck racing game in which the player can take control of Bobbie-Sue, Cletus, Earl, or Rawkus. The basic gameplay consists of transporting wares from one of the game's five cities to another one. In each city, there is a local store, where these goods can be bought or sold. Each store indicates how their buying and selling prices for an item measure up against the competition. At the local bar, the player can talk to the bartender to get some tips on what kind of items to buy and where to sell them. It's also the place to get some special missions, like destroying a number of cars. Players can refuel, repair, and upgrade their truck at the garage.</p>"},{"name":"Big Mutha Truckers 2","year":2005,"developer":"Eutechnyx Limited","url":"microsoft_xbox_b/Big%20Mutha%20Truckers%202%20%28USA%29.zip","filesize":6521409911,"score":6.1,"genres":"Racing / Driving > 1st-person > Behind view > Managerial / business simulation > Transport > Truck > Vehicle simulator","desc":"<p>The truckers return and this time you have to get Ma Jackson off the hook after being arrested for tax evasion. Bribe the jurors as you take the roll of Ma's cousin Jacob in a race to make money by trucking and trading.Drive and go almost everywhere at any time in a bigger environment than the original finding shortcuts and new towns to go trucking in. Trading is only a small part of the game and has been simplified to allow more time driving.</p>"},{"name":"Biniax 2","year":2009,"developer":""},{"name":"Bionicle","year":2003,"developer":"Argonaut Games PLC","url":"microsoft_xbox_b/Bionicle%20%28USA%29.zip","filesize":6503998162,"score":6.1,"genres":"Action > Behind view > Licensed","desc":"<p>Playing as the Toa, Toa Nuva, and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes, and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing so you will face danger in equal measure from the islands many environmental hazards (including falling rocks, rainforest winds, icicles, and lava falls) and the foul minions of Makuta. Choose any one of the six Toa characters to begin your adventure. Use the unique elemental powers of the Toa and summon blasts of elemental energy to defeat your enemies.</p>"},{"name":"Bistro Cupid","year":2002,"developer":"Firedog Computer Entertainment Ltd.","url":"microsoft_xbox_b/Bistro%20Cupid%20%28Japan%29.zip","filesize":6677473447,"score":"","genres":"Role-playing (RPG) > Simulation > 1st-person > Side view > Top-down > 2D scrolling > Fixed / flip-screen > Isometric > Anime / Manga > Turn-based > Managerial / business simulation > Visual novel > Menu structures > Fantasy > Romance","desc":"<p>Taking place in a fantasy cooking world, <em>Cupid Bistro</em> asks: what really is the difference between cooking and alchemy? The answer, apparently, is very little; in this world, cooking delicious meals can produce fantastical effects and grant magical powers to their eaters. The player takes on the role of a restauranteur with the dream of becoming a Master Chef - the world's most powerful magical chef.</p><p>Gameplay combines business management with RPG adventuring and visual novel storytelling. In the restaurant mode, players view their restaurant from an isometric layout; they're able to customize the layout as they please while choosing what to make. Players can also research new original dishes, or even expand their empire with extra floors or new restaurants entirely. Players can also venture out of the restaurant itself into town, where they can engage in dialogue with other characters or go shopping for restaurant supplies. Characters they meet can become workers in the player's restaurant and, if their relationship is good enough, they can even participate in research to come up with unique new dishes.</p><p>In the adventure mode, players can explore the wilderness with up to two allies while bringing their best magical food with them to support them in battle. Defeating enemies not only grants experience points, it also grants money and special items that can't be bought in the city. Players can also romance any of twelve different female characters, with unique plot branches and endings based on their choices.</p>"},{"name":"Bistro Cupid 2","year":2003,"developer":"Firedog Creative Company Limited","url":"microsoft_xbox_b/Bistro%20Cupid%202%20%28Japan%29.zip","filesize":6635517862,"score":"","genres":"Adventure > Simulation > 1st-person > Anime / Manga > Turn-based > Japanese-style RPG (JRPG) > Managerial / business simulation > Visual novel > Menu structures > Fantasy > Romance","desc":"<p>Taking place in the same fantasy cooking world as the original Cupid Bistro, <em>Cupid Bistro 2</em> puts players back in charge of a fantasy restaurant. Like in the last game, the player juggles three major gameplay elements. In the restaurant mode, players build out their own restaurants in an isometric view, with great control over layout and cuisine. Instead of being able to open separate restaurants, as in the last game, this time players can expand their restaurant vertically with the ultimate restaurant towering an entire nine stories. Players can also travel into town, where they can buy supplies for their restaurant or chat with friendly faces. There are eight different romanceable heroines, and players may be able to fall in love and pursue unique endings if they become close enough with one. In the adventure mode, players can set out to explore the world with their allies; they can being magical dishes with them, letting them take out monsters with flashy cooking magic. Players can collect special rare recipes on their adventures and bring them home, giving them new and exotic meals to attract customers.</p><p>Although mostly identical, there is one small difference between the PS2 and Xbox versions: each features a unique cast member who isn't available on the other platform. The PS2 version includes Thyme Moscato, an androgynous young woman, while the Xbox version features the feminine Myrtle Raspberry.</p>"},{"name":"Black","year":2006,"developer":"Criterion Software Ltd.","url":"microsoft_xbox_b/Black%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6335003973,"score":7.3,"genres":"Action > 1st-person > Shooter > Direct control > Contemporary","desc":"<p>Sgt. J. Keller is a Black Op and he has just failed his operation - badly. He has been incarcerated and is interrogated to reveal his mission and to find out what went wrong. The player goes through Keller's failed operation in eight areas, wasting enemy soldiers and trying to stay alive. There are primary and secondary objectives, such as reaching a rendezvous point and gathering intel.</p><p><em>Black</em> is a traditional first-person shooter with variety of weapons and interactive scenery - interactive meaning destructible in this case. Enemy soldiers can be killed by destroying a nearby fuel tank for example, and weak shelter, like a wooden fence, can be shot to pieces in order to expose the enemy.</p><p>The game can be played in four difficulty levels: easy, normal, hard, and black ops. In easy mode, only the primary objective is required. In normal and hard modes, some of the secondary objectives are required. In black ops mode - unlocked after completing the game on hard - all objectives must be reached. New weapons are also unlocked after finishing a level.</p>"},{"name":"Black Stone: Magic & Steel","year":2003,"developer":"XPEC Entertainment Inc.","url":"microsoft_xbox_b/Black%20Stone%20-%20Magic%20%26%20Steel%20%28USA%2C%20Europe%29.zip","filesize":6735798469,"score":6,"genres":"Role-playing (RPG) > Diagonal-down > Anime / Manga > Action RPG > Fantasy","desc":"<p>Up to 4 players battle through various environments, fighting off endless waves of enemies and using magic and melee attacks of many types to defeat evil and reclaim hope for the planet.</p><p>A various range of characters are available, each with their own set of attack styles and magic abilities. During play you can pick up scrolls that will add further attack abilities. Enemies spew out of huts, which must be destroyed in order to continue on. You can also ride on dinosaurs for that extra edge in battles.</p>"},{"name":"Blade II","year":2002,"developer":"Mucky Foot Productions Limited","url":"microsoft_xbox_b/Blade%20II%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6183523638,"score":5.6,"genres":"Action > Behind view > Horror > Licensed","desc":"<p>In an adaptation of the \"Blade II\" movie, you take on the role of the daywalker Blade in his quest to rid the world of vampires.  Using weapons such as a pistol, shotgun, or just wooden stakes, you must control Blade to fight through every level's exit to the ultimate confrontation.</p><p>Determined to stop the vampires, Blade battles through three huge campaigns: The Arcan Mountain Base, Lairs of Buron, and Karkov Tower. Using martial arts and weapons, you'll try to defeat vampires and collect glyphs without getting yourself killed. If you need help, request a tutorial from your friend, Whistler.</p>"},{"name":"Blazing Angels: Squadrons of WWII","year":2006,"developer":"Ubisoft Studios SRL"},{"name":"Blinx 2: Masters of Time & Space","year":2004,"developer":"Artoon Co., Ltd.","url":"microsoft_xbox_b/Blinx%202%20-%20Masters%20of%20Time%20%26%20Space%20~%20Blinx%202%20-%20Battle%20of%20Time%20%26%20Space%20%28World%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6362388816,"score":6.7,"genres":"Action > Behind view > Puzzle elements > Shooter","desc":"<p><em>Blinx 2: Masters of Time and Space</em> is a race up against the Tom Tom Gang for the pieces of the Big Crystal. The game is different than the first as players take control of the Time Sweepers and mastering time. The Tom Tom Gang control space. However, the player does not play as Blinx. The time limit is also gone from each level. The game is more of an action game rather than a platform game. Artoon's game has expanded into non-traditional platform territories and plays more like a light-weight action game. The player has a huge arsenal of gadgets and weapons. The switch between the two teams is a new experience.</p>"},{"name":"Blinx: The Time Sweeper","year":2002,"developer":"Artoon Co., Ltd.","url":"microsoft_xbox_b/Blinx%20-%20The%20Time%20Sweeper%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6644042512,"score":6.8,"genres":"Action > Behind view > Puzzle elements > Direct control > Fantasy","desc":"<p>Take on the role of Blinx; a cool cat who works at the Time Factory.  When the outlaw Tom-Tom gang shows up to steal time crystals and kidnap Princess Lena, it's up to Blinx to jump in and save the day.  Using his sweeper, Blinx can suck up and shoot out various trash, items, and bullets.  By collecting different hands of crystals Blinx can also rewind, fast-forward, pause, slow, and record time using the Xbox hard disk drive.  Play through more than 9 worlds and 30 warped stages in your quest to save World B1Q64.</p>"},{"name":"Blitz: The League","year":2005,"developer":"Midway Games, Inc.","url":"microsoft_xbox_b/Blitz%20-%20The%20League%20%28USA%29.zip","filesize":5982880161,"score":7.3,"genres":"Sports > Top-down > Quick Time Events (QTEs) > Football (American)","desc":"<p><em>Blitz: The League</em> is the first football game with no NFL license in many years - because EA signed an exclusive deal with the NFL, Midway developed one without the license. The game has 17 fantasy teams all with their own look and feel - from personalities to logos. </p><p>The game differentiates itself further from official games by giving the players an off-field presence, often involving sex, performance-enhancing drugs and violence. The game has input from the writer for Playmakers, the football-based soap opera the NFL forced ESPN to cancel.</p><p><em>Blitz: The League</em> has 8-man teams, and makes spectacular action-packed moves easier than in real life. Impressive moves boost your Clash meter, which allows you to pull off unrealistic moves, such as easier running due to Bullet Time, and some brutally tough defences tackles. If these tackles happen frequently enough the players will fight hockey-style, lunging into wild tackles. The team with the most tackles from this gains the Unleashed mode, which has even more gruesome moves, of a style the NFL would not allow to be associated with their product.</p><p>Additional features include multiplayer action with head-to-head online play and complete customization options of players, teams, stadiums and more. Lawrence Taylor appears as the poster boy.</p>"},{"name":"Blood Wake","year":2001,"developer":"Stormfront Studios","url":"microsoft_xbox_b/Blood%20Wake%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.zip","filesize":6345488388,"score":7.1,"genres":"Action > Behind view > Shooter > Naval / watercraft","desc":"<p><em>Blood Wake</em> can best be described as Twisted Metal on water. It is an action game, pitting you as the main character who must work his way up the ranks of a clan by defeating opposing clans and accomplishing goals, such as picking up treasure chests.</p><p>The game spans multiple acts, with each act consisting of five or six missions. These missions come in many varieties, such as destroy an X amount of ships, race around the harbor in X amount of time, collect four treasure chests, etc.</p><p>A multiplayer mode is included which offers several variants of play, such as \"Kingdom Come\" and \"Free For All\".</p><p>There are many secrets to be unlocked, such as additional weapons, boats, multiplayer levels, multiplayer game modes, and more.</p>"},{"name":"BloodRayne","year":2002,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_b/BloodRayne%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6282613786,"score":6.8,"genres":"Action > Behind view > Direct control > Fantasy > World War II > Regional differences","desc":"<p>There are things in the world that humanity should not know about, and things it must be protected from. It is these things that the Brimstone Society hunts, and their newest agent for the cause is the half-vampire codenamed BloodRayne. Her mission will take her from clearing out the walking dead and man-sized insects in the swamps of Louisiana to hunting down members of the secretive Gegengheist Gruppe branch of the Nazi military around the world, as well as the monsters they unwittingly awakened.</p><p>Rayne's primary weapons against both monsters and men are the blades attached to her arms, and as the game progresses she will gain additional attacks to string together. Rayne can also hold many weapons, such as pistols, shotguns, and submachine guns, at once, but she is not overly attached to them and will discard any weapon that runs dry. Her enhanced vampiric strength even allows her to rip up mounted gun emplacements and fire them from the hip. Another vampiric strength is her ability to drain the blood out of any human she can grab in order to restore her health. By killing enemies Rayne's rage meter will fill, eventually allowing her to enter Blood Rage, slowing the world around her and gaining new combo attacks that can dismember or totally cut in half weaker opponents. Rayne's ability to perceive the world will grow as the game progresses as well, allowing her to see living things through walls, zoom in on distant targets, and speed up her perception that everything, herself included, appears to slow down.</p>"},{"name":"BloodRayne 2","year":2004,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_b/BloodRayne%202%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":5890649346,"score":6.9,"genres":"Action > Behind view > Direct control > Fantasy > Regional differences","desc":"<p>Sequel to BloodRayne, <em>BloodRayne 2</em> follows Rayne into the modern day. No longer killing Nazis, she teams up again with the Brimstone Society to take out her Vampire Father and her various siblings. Rayne's new powers and abilities include rail sliding (among other acrobatics), blood guns, stop time, and tons of gruesome fatalities to dispatch her foes with.</p>"},{"name":"Bloody Roar Extreme","year":2003,"developer":"Eighting Co., Ltd.","url":"microsoft_xbox_b/Bloody%20Roar%20-%20Extreme%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6455812659,"score":6.8,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p>This is a slightly enhanced port of the GameCube game, Bloody Roar: Primal Fury, which in turn was an enhanced port of the PlayStation 2 game, Bloody Roar 3. Like the rest of the games in the Bloody Roar series, your character can transform into a Hyper-Beast alter-ego for more intense fighting.</p><p>This version of the game features 1 more character than Primal Fury, CG endings for each character, some new moves, improved graphics and hidden game modes. There are 10 multi-level, interactive destructible fighting arenas.</p>"},{"name":"Blowout","year":2003,"developer":"KaosKontrol, Inc.","url":"microsoft_xbox_b/Blowout%20%28Europe%29.zip","filesize":6732518155,"score":6.3,"genres":"Action > Side view > 2D scrolling > Sci-fi / futuristic","desc":"<p>Blowout is a game that takes a classic gameplay concept and updates it with modern graphics and sounds. This game is a side-scrolling platform shooter. The graphics are 3-dimensional polygons, but the action stays almost entirely in a 2-dimensional plane.</p><p>The setting for the game is a space station that has been overrun by hostile aliens. You play as a bad-ass soldier dude who will single-handedly wipe the aliens out.</p><p>You travel around each level in a non-linear fashion.  You have to fight your way through endless hordes to find keys, flip switches, use elevators, and then ultimately defeat a big boss at the end.</p>"},{"name":"BMX XXX","year":2002,"developer":"Z-Axis, Ltd.","url":"microsoft_xbox_b/BMX%20XXX%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6740015657,"score":5.6,"genres":"Sports > Behind view > Tricks / stunts > Bike / bicycling > Adult","desc":"<p>Slightly unusual for a tricks/stunt game, BMX XXX adds a twist to its genre by employing themes involving foul language, nudity, and toilet humor.</p><p>The \"Hardcore Tour\" mode has you playing the levels, pulling off tricks and completing goals to unlock things such as new levels or stripper videos. The goals are of the odd variety, including things like collecting yellow snow for an ice cream man or gathering empty cans for a homeless guy. Also, have to watch out for a health bar that accounts for your injuries and can make you start over levels if you run out of it.</p><p>Do well enough in the game and you unlock a topless mode, where the riders are all.. well... </p><p>There's also a 'create-a-ride' mode, and a two-player split-screen option, with different games of its own. The game plays on Acclaim's own Dave Mirra series' engine.</p>"},{"name":"Breakdown","year":2004,"developer":"Namco Limited","url":"microsoft_xbox_b/Breakdown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6278460730,"score":7,"genres":"Action > 1st-person > Beat 'em up / brawler > Shooter > Sci-fi / futuristic","desc":"<p>A vast underground complex was discovered in Japan. Unexpectedly, an entire race of creatures, known as the T'lan, was found dwelling there, guided by a mysterious being called Nexus. The humans built a research facility near the underground complex, called Site Zero, and sent soldiers to protect the researchers and ensure that the fragile peace between humans and T'lan will last. As Derrick Cole awakens in a recovery facility near Site Zero, he fails to remember anything from his past. Apparently, he was injected T'langen, a fluid that was taken from the T'lan, which has unexpected effects on human organism. As the war between the humans and the T'lan begins, Derrick must first of all find a way to escape, with both sides being hostile to him, unaware of the role he will play in the future of both races.</p><p><em>Breakdown</em> is a first-person action game. Though Derrick can use firearms, it is not entirely a FPS; much of the game's combat relies on melee moves and combos that Derrick learns, turning the game into a \"first-person fighter\". An unusual feature of the game is the completely physical interaction with the environment, which strives to be realistic. In order to force Derrick to pick up ammo, operate an object, eat food to restore health, etc., the player has to physically move the controller, imitating corresponding real-life movements.</p>"},{"name":"Breeders' Cup World Thoroughbred Championships","year":2005,"developer":"4J Studios Ltd.","url":"microsoft_xbox_b/Breeders%27%20Cup%20-%20World%20Thoroughbred%20Championships%20%28USA%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6603890280,"score":5.8,"genres":"Sports > Horse / derby > Licensed","desc":"<p><em>Breeders' Cup World Thoroughbred Championships</em> is a realistic horse racing simulator where players can bet and race horses in real Breeder's Cup events. You can compete in North America's premier events such as Del Mar, Belmont Park and Keeneland along with many others, leading up to the most prestige event, the Breeders' Cup.</p><p>Choose from thousands of horses to own and breed to create the ultimate champion or place bets with the most sophisticated betting system used by professional handicappers. Choose to start a career or choose a quick race to play against the computer or go head to head with a buddy, you can choose to go to an event just to bet or even choose Race a Legend to take on real Breeder's Cup winners including the legendary Seabiscuit. </p><p>The game is officially licensed by the NTRA (National Throughobred Racing Association) and features the voice of Breeder's Cup announcer Tom Durkin.</p>"},{"name":"Brian Lara International Cricket 2005","year":2005,"developer":"Swordfish Studios Limited","url":"microsoft_xbox_b/Brian%20Lara%20International%20Cricket%202005%20%28Europe%29.zip","filesize":6371675362,"score":7.5,"genres":"Sports > Diagonal-down > 2D scrolling > Cricket > Licensed","desc":"<p>The legend of cricket makes a welcome come back after years of absence and does it with style. Take part in a World Tour, tournaments and a Challenge mode where you can relive some classic cricketing moments (the graphics even go black and white) like the first Ashes match where England lost back in 1882.Simple controls make the game as pick up and play as you could possibly want so you don't need to be a cricket genius to enjoy the game or understand what's going on.</p>"},{"name":"Broken Sword: The Sleeping Dragon","year":2003,"developer":"Revolution Software Ltd.","url":"microsoft_xbox_b/Broken%20Sword%20-%20The%20Sleeping%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5693968267,"score":7.8,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Quick Time Events (QTEs) > Africa > Europe > Fantasy > Detective / mystery","desc":"<p>No less than six years have gone by before the third installment in the Broken Sword series saw the light of day. The first two games (The Shadow of the Templars and The Smoking Mirror) delved into the Knights Templar and Mayan mythology. This time, George Stobbart and Nico Collard are after the Voynich Manuscript to unravel its mysteries.</p><p><em>The Sleeping Dragon</em> moves away from the 2D point-and-click concept from the earlier games and features a full 3D world, with a camera that does not rotate, but uses fixed cinematic perspectives, combined with full 5.1 sound. For the Windows version the game is no longer controlled through the mouse, but now through the keyboard, for the movement of the characters as well as all the actions. The player alternately controls George or Nico. Next to typical adventure gameplay such as exploration, conversations, and searching and combining items, there are also a few action sequences. The characters can duck, sneak, hang from ledges and move crates to reach higher areas.</p><p>The locations visited throughout the game include The Congo, Paris, England, Czech Republic and Egypt.</p>"},{"name":"Brothers in Arms: Earned in Blood","year":2005,"developer":"Gearbox Software LLC","url":"microsoft_xbox_b/Brothers%20in%20Arms%20-%20Earned%20in%20Blood%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5813590875,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Historical events > World War II","desc":"<p>Barely seven months after the release of Brothers in Arms: Road to Hill 30, Gearbox brings us the sequel.</p><p>Brothers in Arms: Earned in Blood tells the story of Corporal Joe \"Red\" Hartsock as one of the thousands of paratroopers who landed in Normandy, France, on the eve of D-Day. Hartsock made an appearance in the previous game and now we get to see the events from his point of view, based on actual events and persons.</p><p>Though the game engine remains largely unchanged, the A.I. has been significantly improved to offer a more challenging experience as the player tries to advance through the treacherous area known as the Bocage. The player fights in first person as Hartsock but also commands either two fireteams or a fireteam and a tank as using cover and suppression fire is critical to success.</p><p>The game also offers an interesting multiplayer mode with the rare single-mission co-op option available for the PC, as well as skirmish maps and other mods such as \"Defense\".</p>"},{"name":"Brothers in Arms: Road to Hill 30","year":2005,"developer":"Gearbox Software LLC","url":"microsoft_xbox_b/Brothers%20in%20Arms%20-%20Road%20to%20Hill%2030%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5874457563,"score":8,"genres":"Action > Strategy > 1st-person > Behind view > Shooter > Direct control > Historical events > World War II > Licensed","desc":"<p>Brothers in Arms, one of the few games to truly be based on actual events, places you in the shoes of real-life World War II Sergeant Matt Baker, tasked with commanding your squad through a week's worth of actual battles that Baker's 101st Airborne platoon faced. Combining the cinematic action of games such as Medal of Honor and Call of Duty with the strategic command of Full Spectrum Warrior, you must command your troops to use actual army doctrine to find, fix, flank, and finish the enemy while actually participating in the battle yourself.</p>"},{"name":"Bruce Lee: Quest of the Dragon","year":2002,"developer":"Ronin Entertainment","url":"microsoft_xbox_b/Bruce%20Lee%20-%20Quest%20of%20the%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5960932316,"score":4.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Martial arts > Licensed","desc":"<p><em>Bruce Lee: Quest of the Dragon</em> features an epic storyline in which Bruce battles multiple enemies to rescue his kidnapped father and retrieve the mystical Golden Relic. A quest which will take him to several different cities around the world including Hong Kong and San Francisco.</p><p>The game features a variety of martial arts styles, including Jeet Kune Do, the discipline started by Bruce Lee himself. It contains over 100 motion captured moves performed by one of Bruce Lee's 3rd generation students. These moves are learned as you progress through the game by collecting tokens from defeated enemies. In the end, over 30 different types of adversaries must be overcome in order to retrieve the relic and save your father.</p>"},{"name":"Brute Force","year":2003,"developer":"Digital Anvil","url":"microsoft_xbox_b/Brute%20Force%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6719770823,"score":7.3,"genres":"Action > 1st-person > Behind view > Shooter > Sci-fi / futuristic","desc":"<p>You control a team of 4 elite and unique squadron members:</p><p>Hawk, who has the ability to turn invisible and use a powerful melee attack; Flint, the sniper expert with the ability to auto target on enemies and cleans up with one shot kills; Tex, the heavy weapons expert who can also disarm mines; and Brutus, the only non-human member of the squad has a unique thermal vision and can regenerate energy over time.</p><p>Switch between all 4 squad members during play at a touch of a button in order to accomplish goals (using each members strength to get past an obstacle, be it many enemies, puzzles or long distance attacks). Each of the 18 missions has a new challenge and a range of human and alien enemies to overcome.</p><p>Multiplayer mode allows up to 8 people to fight as two teams of 4 against each other in a range of different play modes, and download new levels via Xbox Live support.</p>"},{"name":"Buffy the Vampire Slayer","year":2002,"developer":"The Collective, Inc.","url":"microsoft_xbox_b/Buffy%20the%20Vampire%20Slayer%20%28Europe%29.zip","filesize":6113266914,"score":7.6,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Horror > Licensed","desc":"<p>Step into the shoes of Buffy Summers, popular high school student by day, destroyer of the undead by night. In this third-person action/adventure, you are the Chosen One. With an arsenal of weapons including crossbows, shovels, and stakes and over 60 fighting moves and combinations, you will punch, kick, and stake your way through familiar Sunnydale locations like the sunken church, Sunnydale High School, and the Bronze nightclub where you match wits with enemies such as Matereani, Rhakshasa, Spike, and The Master. If you run into trouble, your Watcher Giles and friends Willow, Cordelia, and Xander are on-hand to assist you.</p>"},{"name":"Buffy the Vampire Slayer: Chaos Bleeds","year":2003,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_b/Buffy%20the%20Vampire%20Slayer%20-%20Chaos%20Bleeds%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":5787207386,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror > Licensed","desc":"<p>Buffy and the crew are back for another battle against evil. On this occasion (set as a 'missing episode' from the TV series' fifth season), the powerful vampire Kakistos and The First are ready for war, and the only ones standing in their way is Buffy the Vampire Slayer and her friends Willow (an at times powerful witch), Faith (a fellow Slayer), Spike (former evil vampire turned slightly good) and Xander (caught in the middle of his best friends work).</p><p>You get the chance to play as each character during the game as you slay vampires, solve puzzles and collect items along the way to prepare you for the final showdown. Various other characters from the show appear to help you out, while some are out to hurt you big time.</p><p>Multiplayer options are also included for up to 4 players. Go rabbit hunting in Bunny Catch; be the last person standing against wave after wave of vamps in Survival or battle for control of the arena in Domination.</p>"},{"name":"Burnout","year":2002,"developer":"Criterion Software Ltd.","url":"microsoft_xbox_b/Burnout%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6560710433,"score":7.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Track racing","desc":"<p><em>Burnout</em> is an arcade style racing game in the mold of the Test Drive or Need For Speed series. In this game, you are racing on realistic streets with real traffic to contend with.</p><p>There are 6 courses on which to race, 3 of which are reminiscent of Europe, and 3 from the USA. There are several vehicles to choose from, ranging from compact cars to pickups. However, they are not based on real makes and models.</p><p>One notable feature of Burnout is the \"Burn Meter.\" The Burn Meter is a gauge that is filled by performing reckless stunts, like racing into oncoming traffic or power-drifting through corners. Once the Burn Meter is filled, your car gets a super speed boost. If you crash, however, the Burn Meter is reset and must be filled again to achieve a boost.</p>"},{"name":"Burnout 2: Point of Impact","year":2003,"developer":"Criterion Software Ltd.","url":"microsoft_xbox_b/Burnout%202%20-%20Point%20of%20Impact%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5829231310,"score":8.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing","desc":"<p>Racing a car is one thing, but racing into traffic at high speeds, where you are rewarded for the style of your crash, is another. This is the idea behind Burnout 2, which brings new modes and higher speeds compared to the original title. As usual, the aim is to speed around real-life roadways, through the traffic ahead, while avoiding collisions. </p><p>Burnout is a street racing game focused around speed and crashing.  Unlike many games that focus on closed course driving, you get to drive through cities with real traffic and city infrastructure.  Designers have built city districts and surrounding areas and implemented the racecourses throughout the streets.  As a result, many times certain parts of race-courses interlace with other parts of other races.  As well, instead of encouraging strategic driving and safe driving, Burnout strongly encourages offensive driving.  Driving on the wrong side of the road, barely missing passing traffic, drifting, and jumps all add to your boost \"burnout\" meter.  Speed boosts and jumps aid your attempt to drive past buses, trucks, and anything else that gets in the way.  The more offensive and dangerous your driving is, the more boost you get!</p><p>Burnout 2 contains a full campaign and custom car campaign.  While you can unlock regular cars and tracks, later in the campaign you unlock more raceways like reverse tracks and one-way sprints.  You can unlock over 20 cars like a Nascar, a 1920s gangster car, a Japanese muscle, and many customized vehicles with custom paint jobs and upgraded stats.  </p><p>Along with the same sense of speed and highly detailed crash animations as before, Point of Impact includes new modes of play.  Pursuit mode has you playing the cop as you chase down the speeding motorists, and to win you must crash them out of the race.  Or you can reverse that with a friend.  You can flee from a friend while he attempts to chase you.  Crash mode, as the name suggests, forces you to glide into crowded intersections to get the most cars involved in a pile-up as possible.  The bigger the crash, the better.  Up to 4 players can compete for the best score.</p><p>Training and 2 player racing modes are also included.</p>"},{"name":"Burnout 3: Takedown","year":2004,"developer":"Criterion Software Ltd.","url":"microsoft_xbox_b/Burnout%203%20-%20Takedown%20%28Europe%29%20%28En%2CEs%2CNl%2CSv%29.zip","filesize":6409939073,"score":8.7,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>Burnout 3: Takedown is a racing game which encourages aggressive driving and lets you use your vehicle to smash your way to the finish line by taking out your rivals and causing massive multi-car pileups. The more cars you take out, damage you inflict, the more events and cars you can unlock. Burnout 3 also has a \"crash\" mode which puts your vehicle at a variety of traffic junctions jam-packed with moving vehicles and pickups to see just how much monetary damage you can inflict.</p><p>Burnout 3: Takedown continues the racing series with more cars, more tracks, a more detailed crash engine, and a multitude of new gameplay modes for single players, multiple players on one system, and online play.</p><p>Some features include:</p><p>Crash Mode: In addition to this gameplay element introduced in Burnout 2, Pick-ups have been added. They are scattered throughout the intersections. Some pick-ups will halve, double or quadruple your score, cause massive explosions to cause even more damage, or increase your damage with monetary bonuses.</p><p>Sophisticated crash technology allows for high-speed crashes with extreme detail.  Use your vehicle as a weapon and takedown rivals, using the new Aftertouch feature to control your vehicle after the moment of impact.</p><p>9 Race Modes including Single Race, Tournament, Lap Eliminator, Burning Lap and Road Rage.</p><p>Multiplayer Modes include Quick Line, Battle Race, Road Rage, and Party Crash, where 2-16 players participate in a pass-the-controller match-up.</p><p>7 Online Modes allow you to race online with up to 6 players. Battle through oncoming traffic in Crash Mode, Single Race, Road Rage, and more.</p><p>Over 70 Vehicles in 12 different classes including European exotics, American muscle cars, mid-size sedans, sports cars, compacts, buses and semi trucks.</p><p>Over 40 Tracks spanning 3 continents. Take on opponents across a broad range of environments, and experience dozens of traffic-filled crash junctions.</p>"},{"name":"Burnout: Revenge","year":2005,"developer":"Criterion Software Ltd.","url":"microsoft_xbox_b/Burnout%20Revenge%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6470916744,"score":8.6,"genres":"Action > Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Contemporary","desc":"<p>The fourth Burnout racing game puts you once again in the eye of traffic storms, where you do not only rush to be the fastest, but brutally, yet stylishly, take down your opponents. This is emphasized by <em>impact time</em>, which shows crashes in all their slowed-down glory, and the boost you receive after a successful wrecking. Reckless driving bumps your Revenge rank, unlocking new events. This can also be achieved by medal placings that grant new vehicles.</p><p>Collectible signature takedowns, crashbreakers (detonate your vehicle, now also in some regular races) and aftertouch for precise havoc remain, but one of the major changes is the ability to check traffic. Non-racing vehicles are no longer a nuisance with the sole purpose of slowing you down. They can now be actively used to obstruct traffic or send them into your foes. The Road Rage mode (take down a set number of rivals within a time limit) and Crash mode make a return, but Traffic Attack is new - race against the clock and level the traffic at the same time. Other modes include regular races, grand prix races, Burning Lap (high-speed time attack), Eliminator (last one after each round is out) and a normal time attack mode.</p><p>In the Crash mode, the multipliers and bonuses have been removed, and you cannot drive at full speed towards a crossroads. You have to time your start to receive a proper boost and then it is only about steering, crashbreakers and aftertouch. There are many new tracks and cars, a soundtrack with lots of famous artists, and a new world tour in different countries.</p><p>Online multiplayer is available for up to six players. New off-line additions are the split-screen Traffic Attack and a hot-seat Crash Tour for up to six players, next to the familiar Road Rage, Crash Party and Crash Battle modes.</p>"}]