[{"name":"Cabela's Big Game Hunter 2005 Adventures","year":2004,"developer":"Sand Grain Studios","url":"microsoft_xbox_c_part1/Cabela%27s%20Big%20Game%20Hunter%202005%20Adventures%20%28USA%2C%20Europe%29.zip","filesize":6840046413,"score":6.9,"genres":"Action > Simulation > Sports > Hunting > Licensed","desc":"<p>Another in the Big Game Hunting series, 2005 Adventures brings you 36 big game animals in 10 locations.  Choose from many guns, bows, equipment, and clothing before heading out to take on these animals.</p><p>Head out looking for whatever animal(s) you have tags for.  Track your target through mountains, plains, hills, streams, and lakes.  Swim across lakes and streams that are in your way and drive various vehicles to save time getting where you're going.  Once you find your prey, get close enough to shoot without your target noticing you.  Then take the shot!</p><p>Play the game in quick hunt or career mode, or play with friends online.  Go to your cabin to see the animals you have shot in career mode... you can even choose your what cabin you want out of six choices!</p><p>Unlike many other hunting games that have you go out and kill what you can in a single day, you can take as many days as you need to bag your limit.  Use tents to sleep away the nights, or walk around looking for possible spots to sit and wait for prey on the following day... just don't forget to eat and drink to keep up your energy.</p><p>Play through rain and snow as well as clear weather conditions.  Animals behave differently in different conditions, just like in real life.</p>"},{"name":"Cabela's Dangerous Hunts","year":2003,"developer":"FUN Labs Romania S.R.L.","url":"microsoft_xbox_c_part1/Cabela%27s%20Dangerous%20Hunts%20%28Europe%2C%20Australia%29.zip","filesize":6830500730,"score":6.5,"genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p><em>Cabela's Dangerous Hunts</em> is a hunting game with adrenaline - hunt or be hunted!</p><p>Many of the animals you'll be after are dangerous and aggressive and will take you one-on-one - and you'll be armed with a primary weapon as well as a knife or pistol for close combat defense. You'll hunt for 27 animals in 12 regions. Animals include dangerous species such as bears, wolves, leopards, rhinos and cape buffalo; big game species such as moose, bighorn, mountain goat, elk and caribou; and exotic species such as impala, duiker and kudu.</p><p>The regions include British Columbia, Colorado, New Mexico, Tanzania and Zimbabwe. Game modes include Quick Hunt (one tag, one animal, one region), Action Zone (warp from location to location, where dangerous animals are waiting to attack you), and Career Hunt (a series of missions where you have some choice as to which task you'll take on next, and unlock chartered hunts).</p>"},{"name":"Cabela's Dangerous Hunts 2","year":2005,"developer":"Sand Grain Studios","url":"microsoft_xbox_c_part1/Cabela%27s%20Dangerous%20Hunts%202%20%28USA%2C%20Australia%29.zip","filesize":6835749128,"score":6.4,"genres":"Action > 1st-person > Shooter > Licensed","desc":"<p><em>Cabela's Dangerous Hunts 2</em> is a hunting game focused on linear story-based gameplay, instead of the freeform hunting of the main Cabela's line. You will hunt 20 animals, including lions, tigers, and bears, across 12 main levels, and 4 hidden levels. There are three difficulty levels, and a slow-motion ability to help line up shots. Keep your eyes open; there are secret stumps in each level, which if shot can unlock extra levels and other items. In most levels, you will be assisted by a native guide, who will both draw the attention of the local wildlife, and assist you in killing them.</p><p>The story features you, a world-famous hunter, who has just found out an old friend, Bullseye Bill, is missing. Retrace his steps around the world, helping other people along the way.</p>"},{"name":"Cabela's Deer Hunt: 2004 Season","year":2003,"developer":"Sand Grain Studios","url":"microsoft_xbox_c_part1/Cabela%27s%20Deer%20Hunt%20-%202004%20Season%20%28USA%29.zip","filesize":6863612728,"score":"","genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p>Cabela's Deer Hunt 2004 Season will have you stalking elusive deer all across North America. From well-known species like Whitetail, Mule Deer and Columbian Blacktail to exotic species such as Coues, Fallow and Sika. Each animal will present a unique challenge and environment.</p><p>Hunt through real-life locations like the Grand Tetons in Wyoming, the Sonoran Desert in Arizona, or Mille Lacs Minnesota. ATVs, trucks, snowmobiles and boats make it easier to travel around. And lots of guns and gear make every trip unique!</p>"},{"name":"Cabela's Deer Hunt: 2005 Season","year":2004,"developer":"Sand Grain Studios","url":"microsoft_xbox_c_part1/Cabela%27s%20Deer%20Hunt%20-%202005%20Season%20%28USA%2C%20Australia%29.zip","filesize":6839095170,"score":6.9,"genres":"Sports > 1st-person > 3rd-person (Other) > Hunting > Licensed","desc":"<p>This sequel to Cabela's Deer Hunt 2004 Season really is more than a sequel. Improved technology gives much bigger levels with more trees and vegetation, as well as much better animal AI. 18 new missions really add to gameplay, as do the clay shooting challenges. 9 deer species across North America will give any virtual hunter hours of entertainment.</p>"},{"name":"Cabela's Outdoor Adventures","year":2005,"developer":"Sand Grain Studios","url":"microsoft_xbox_c_part1/Cabela%27s%20Outdoor%20Adventures%20%28USA%2C%20Australia%29.zip","filesize":6851746665,"score":"","genres":"Simulation > 1st-person > Hunting > Fishing > North America","desc":"<p>Take the Hunting &amp; Fishing expedition of a lifetime with 22 adventures across North America and beyond. Stalk monster bucks and trophy big game or stop off and fish the local waters. Experience the sights and sounds of a true-to-life outdoor adventure where stealth, strategy, and technique are of the utmost importance!</p>"},{"name":"Call of Cthulhu: Dark Corners of the Earth","year":2005,"developer":"Headfirst Productions","url":"microsoft_xbox_c_part1/Call%20of%20Cthulhu%20-%20Dark%20Corners%20of%20the%20Earth%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5313705072,"score":7.6,"genres":"Action > 1st-person > Stealth > Survival horror > Interwar > Detective / mystery > Horror > Licensed > Regional differences","desc":"<p>Detective Jack Walters arrived in Innsmouth to solve a case of a missing person. But soon he finds himself confronted with terrible mysteries older than humanity, and with ghosts of the mysterious events that led to his incarceration in a mental hospital years ago. </p><p><em>Call of Cthulhu: Dark Corners of the Earth</em> is a first-person action-adventure survival horror game, based on the H.P. Lovecraft mythos and his short story \"The Shadow Over Innsmouth\". </p><p>Initially, <em>CoC: DCotE</em> plays like an adventure game, but soon it gains elements of a stealth game and of a first-person shooter. Notably, the game does not feature an on-screen HUD (not even a crosshair); Jack's health is hinted at by visual cues; as for ammo, you need to remember how much you have left before you'll have to reload. </p><p>The health system used in the game is uncommon. There is no \"hit points\" system; rather, Jack receives minor or major wounds in specific parts of the body, and if he breaks a leg he's slowed down. To heal himself and prevent death from bleeding out, Jack can pick up medikits which contain bandages, splints, sutures and antidotes, each of which is used to heal a specific type of wound. Ill effects emerging from the wounds can be temporarily suppressed with a fix of morphine. </p><p>Jack's sanity also plays an important role. When Jack looks at disturbing things or finds himself in alarming conditions, his vision blurs, he begins hearing voices and talking to himself. If this gets too bad, Jack may go insane or commit suicide. Also, Jack suffers from acrophobia, and looking down in high places will cause him vertigo.</p>"},{"name":"Call of Duty 2: Big Red One","year":2005,"developer":"Treyarch Corporation","url":"microsoft_xbox_c_part1/Call%20of%20Duty%202%20-%20Big%20Red%20One%20%28Europe%29%20%28Fr%2CEs%2CIt%29.zip","filesize":5942577818,"score":7.8,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Tank > Historical events > World War II > War > Regional differences","desc":"<p>In the second Call of Duty game for consoles, players again take to battle in The Second World War.  As with other Call of Duty games, the focus is on the characters and their drama amidst the furious, heavily scripted, first-person action.  As a private new to war in America's most legendary infantry division, nicknamed the Big Red One for the distinctive patch they wore, players will fight through the game as a team in the Fighting First and will be affected by the loss of friends on the battlefield.</p><p>Players will have to re-enact the successes of World War II through a wide variety of land, sea, and air missions in Africa, Sicily, and Normandy, by using vehicles including tanks, jeeps, armored cars, and half-tracks.  Success will depend on how well players can move, shoot, and complete the objectives that a commanding officer provides before each mission.</p><p>The Xbox and PS2 versions offer multiplayer games with up to 16 players.</p>"},{"name":"Call of Duty 3","year":2006,"developer":"Treyarch Corporation","url":"microsoft_xbox_c_part1/Call%20of%20Duty%203%20%28Europe%29%20%28Fr%2CIt%29.zip","filesize":5312675125,"score":7.7,"genres":"Action > 1st-person > Shooter > Direct control > Tank > Historical events > World War II > War > Regional differences","desc":"<p>The third main <em>Call of Duty</em> game centers around Operation Cobra in Normandy, France, the World War II operation planned by United States Army General Omar Bradley to break out from the Normandy area after the previous month's D-Day landings. You play as 4 allied sides with American, Canadian, British and Polish soldiers in 14 chronological singleplayer missions covering the 88 days leading up to the liberation of Paris. Surprisingly, you cannot play as the French 2nd Armored Division that actually liberated Paris.</p><p>The battles are usually dramatic with many fights and scripted events at the same time, consisting of infantry and vehicles, with semi-destructible environments. In between, there are cinematics that explain the events. A few gameplay mechanics have been kept intact or make a return: slight auto aim, the damage system that allows you to recover if you hide for a moment, and smoke grenades. New features include the ability to toss back unexploded grenades and actions requiring a successful series of button combinations. This can occur in hand-to-hand combat where you can yank the weapon out of enemy soldiers' hands. Enemies work in groups, try different tactics and search for cover.</p><p>The main multiplayer modes are standard deathmatch (battle), team deathmatch (team battle), Capture the Flag (either with two flags or two sides trying to control a single, neutral flag) and Headquarters (two sides either defend or attack a structure, and players can now respawn after dying). The new mode, War, is similar to the gameplay of the Battlefield series. Two teams start with two control points each, and one neutral flag in the middle. The objective is to control all five flags.</p><p>There are multiple-occupancy vehicles (Sherman Tank, Panzer IV, Jeep, Horch, BMW, Harley), and several multiplayer classes: Rifleman, Heavy Assault, Light Assault, Medic, Scout, Support and Anti-Armor. Each class has unique abilities. There are also two rankings: a normal rank system during a single game where your abilities improve if you do well, and an overall TrueSkill ranking. Also, unlike the previous games, your team stays grouped together after a match and is not booted back to the lobby right away.</p>"},{"name":"Call of Duty: Finest Hour","year":2004,"developer":"Spark Unlimited","url":"microsoft_xbox_c_part1/Call%20of%20Duty%20-%20Finest%20Hour%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6092998021,"score":6.9,"genres":"Action > 1st-person > Behind view > Shooter > Tank > Historical events > World War II > War > Regional differences","desc":"<p><em>Call of Duty: Finest Hour</em> is the first CoD game on the consoles. The story spans through three different fronts in the Second World War through three soldiers' viewpoints. Basically, the game is a heavily scripted, story-driven action game where the main focus is on the action and the dramatization of the war and the people in the middle of it all. One of the defining features if Call of Duty-games is the mood they set and the accurate reproduction of the actual WW2 battlefields and operations. As well as the usual range of WW2 weaponry, in CoD:FH there are also vehicles in which one can drive around, blasting the enemies to bits in the process.</p>"},{"name":"Capcom Classics Collection Vol. 1","year":2005,"developer":"Capcom Entertainment, Inc.","url":"microsoft_xbox_c_part1/Capcom%20Classics%20Collection%20Vol.%201%20%28USA%2C%20Europe%29.zip","filesize":6430507490,"score":7.9,"genres":"Compilation","desc":"<p>A compilation of 22 of Capcom's greatest hits from its arcade catalog. Also featured are concept artwork and other special features to enhance the experience of revisiting these classics.</p><p>The games included are:</p><ul><li>1942</li><li>1943</li><li>1943 Kai</li><li>Bionic Commando</li><li>Commando</li><li>Exed Exes</li><li>Final Fight</li><li>Forgotten Worlds</li><li>Ghost 'N Goblins</li><li>Ghouls 'N Ghosts</li><li>Gun.Smoke</li><li>Legendary Wings</li><li>Mercs</li><li>Pirate Ship Higemaru</li><li>Section Z</li><li>Son son</li><li>Street Fighter 2</li><li>Street Fighter 2 Hyper Fighting</li><li>Street Fighter 2 Champion Edition</li><li>Super Ghouls' N Ghosts</li><li>Trojan</li><li>Vulgus</li></ul>"},{"name":"Capcom Classics Collection Vol. 2","year":2006,"developer":"","url":"microsoft_xbox_c_part1/Capcom%20Classics%20Collection%20Vol.%202%20%28USA%29.zip","filesize":6731803334,"score":7.4,"genres":"Compilation","desc":"<p>This collection contains 20 original Capcom titles. It is a selection of the new games from Capcom Classics Collection Remixed (PSP), the three new games from Capcom Classics Reloaded (PSP) and two games (<em>Super Street Fighter II Turbo</em> and <em>Tiger Road</em>) that did not appear in a Capcom Classics collection before. The games are upscaled from their original resolutions with anti-aliasing, showing soft images with blurry details. The following games are included:</p><ul><li>1941: Counter Attack</li><li>Avengers</li><li>Black Tiger</li><li>Block Block</li><li>Captain Commando</li><li>Eco Fighters</li><li>King of Dragons</li><li>Knights of the Round</li><li>Last Duel</li><li>Magic Sword</li><li>Mega Twins</li><li>Quiz &amp; Dragons: Capcom Quiz Game</li><li>Side Arms Hyper Dyne</li><li>The Speed Rumbler</li><li>Street Fighter</li><li>Strider</li><li>Super Street Fighter II Turbo</li><li>Three Wonders</li><li>Tiger Road</li><li>Varth: Operation Thunderstorm</li></ul><p>You can unlock cheats and training videos, and view the original game art along with the history of the games.</p>"},{"name":"Capcom Fighting Evolution","year":2005,"developer":"Capcom Production Studio 2","url":"microsoft_xbox_c_part1/Capcom%20Fighting%20Evolution%20~%20Capcom%20Fighting%20Jam%20%28World%29%20%28En%2CJa%29.zip","filesize":6822431861,"score":5.9,"genres":"Action > Side view > 2D scrolling > Fighting","desc":"<p><em>Capcom’s Fighting Evolution</em> is the ultimate classic head-to-head brawler to date! And by classic we mean Classic! Fighting Evolution includes characters from not only Street Fighter II, Street Fighter III, and Street Fighter Alpha, but also from bone crushing favorites Darkstalkers and Red Earth. Even as you’re at your last wits unlocking the hidden characters, each familiar face will bring a smile to any gamer.</p><p>Each and every character maintains their original fighting styles, so strategy is king in this rumble. Picking the right character is your key to victory. This comes into play especially in the two-on-two team battles, as well as the wide variety of other gameplay modes available, and all of it in classic 6 button control scheme!</p>"},{"name":"Capcom vs. SNK 2 EO","year":2003,"developer":"Capcom Co., Ltd.","url":"microsoft_xbox_c_part1/Capcom%20vs.%20SNK%202%20EO%20-%20Mark%20of%20the%20Millennium%202001%20%28Europe%29.zip","filesize":6850343594,"score":7.6,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>A fighting game with characters taken from many Capcom and SNK games. The game system is centered around \"grooves\" which are selected before any battle. These different grooves alter the character's abilities to resemble different Capcom or SNK games. There are three grooves dedicated to each company, and even the option to define a custom groove.</p><p>The \"EO\" of the GameCube and Xbox titles refer to a new groove: Easy Operation. Instead of the normal inputs needed to do special and super moves, these moves are instead done automatically by tapping the right thumb-stick in specific directions. Only a small part of each character's move set can be accessed this way, however, and if the player does not select EO then the game will play the same as the arcade and previous releases.</p><p>Playable characters come from the following games:* Street Fighter (Ryu, Ken, Eagle, Sagat)* Final Fight (Rolento)* Street Fighter II (Guile, Chun-Li, Blanka, Dhalsim, E. Honda, Zangeif, M. Bison, Balrog, Vega)* Final Fight 2 (Maki)* Super Street Fighter II (Cammy)* Super Street Fighter II Turbo (Akuma/Gouki)* Street Fighter Alpha (Dan)* Street Fighter Alpha 2 (Sakura, Shin Akuma/Gouki, Evil Ryu)* Darkstalkers (Morrigan)* Street Fighter III (Yun)* Rival Schools (Kyosuke)* Psycho Soldier (Athena)* Fatal Fury (Terry, Joe, Raiden, Geese)* Art of Fighting (Ryo, Yuri, King, Todoh)* Fatal Fury 2 (Kim, Mai)* Samurai Shodown (Haohmaru, Nakoruru)* The King of Fighters '94 (Kyo, Benimaru, Chang&amp;Choi, Rugal)* The King of Fighters '95 (Iori)* Fatal Fury 3 (Yamazaki)* The King of Fighters '96 (Vice)* The King of Fighters '97 (Orochi Iori)* The Last Blade 2(Hibiki)* Fatal Fury: Mark of the Wolves (Rock)</p>"},{"name":"Carmen Sandiego: The Secret of the Stolen Drums","year":2004,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_c_part1/Carmen%20Sandiego%20-%20The%20Secret%20of%20the%20Stolen%20Drums%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6208734964,"score":6.3,"genres":"Action > 1st-person > Behind view > Platform > Puzzle elements > Stealth > Direct control > Detective / mystery","desc":"<p>Cole Gannon, a rookie in the ACME detective agency finds a set of GPS coordinates on the agency's computer server, which leads him to a museum in New York. The GPS coordinates involve a case dealing with the infamous thief Carmen Sandiego, who Cole wants to capture despite being still just in training. It seems Carmen wants to put back together a set of stolen tribal drums that will unleash an unspeakable power. </p><p>There are two other ACME operatives, Jules and Shadow, who are working on the case in Siberia at the moment so they can only help Cole with advice through email messages.</p><p>The game consists of exploring nine different locales all over the world from New York to Thailand. Each locale is broken down into several areas. Each area has different items to collect. The main items to collect are compasses. These will help in locating Carmen Sandiego's whereabouts. Another item Cole can collect is puzzle pieces. Collecting these will unlock a jigsaw puzzle for Cole to solve.</p><p>Also for Cole to make his way through areas, he has to defeat some enemy combatants who possess key codes. A few key codes are needed to unlock forcefields, which block the pathways to get further into the area. To defeat enemies, Cole is equipped with a staff he can use to whack enemies with. He also comes equipped with a dart gun, which he can use to hit switches he can't reach otherwise. Cole must also move stealthily through each area to avoid security measures and to get a drop on unsuspecting enemy units. Cole has other moves he can perform such as pole vaulting with his staff, rolling from a crouch position, pressing his body close to a wall, double jumping, tightrope walking, and hanging from ledges, pipes, and even ziplines.</p><p>During the game, players can access a menu with various tabs. The atlas tab gives educational factoids about the area Cole is in. The map tab gives detailed information about the area that Cole is currently exploring. The GPS tab gives information about where Carmen Sandiego will be heading next. The transport tab lets the player go back to the areas they previously explored in their current location. The communication tab lets the player receives messages from Jules and Shadow..</p>"},{"name":"Carve","year":2004,"developer":"Argonaut Games PLC","url":"microsoft_xbox_c_part1/Carve%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6497955829,"score":6.3,"genres":"Racing / Driving > 1st-person > Behind view","desc":"<p><em>Carve</em> is a watercraft racing game, taking the player through many different environments and rough waters. The ultimate goal is to cross the finish line before the competition, but success depends on your ability to pull of stunts and take gambles as well. Featuring a simple trick system, success depends on correct timing of trick use to boost your speed. A buoy miss system allows you to bypass a limited number of buoys as well, adding in another strategic element.</p><p>Gameplay modes include quick race, tournament, trick tutorial and multiplayer via system link and Xbox Live.</p>"},{"name":"Castle Shikigami 2","year":2004,"developer":"AlfaSystem Co., Ltd."},{"name":"Castlevania: Curse of Darkness","year":2005,"developer":"Konami Corporation","url":"microsoft_xbox_c_part1/Castlevania%20-%20Curse%20of%20Darkness%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5772308021,"score":7,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy","desc":"<p>In <em>Castlevania: Curse of Darkness</em> you play Hector, a former Dracula servant and a Devil Forgemaster, who disowns his dark gifts and aims to live a normal life. This event left Dracula vulnerable to the attacks of the Belmont clan. Now that Dracula is vanished, you must fight back the curse cast upon all Europe. There is but one problem, another Dracula servant does not approve with your plan.</p><p>Being a Devil Forgemaster now gives the player an ability to forge familiars to fight by your side. As the player himself, they have levels and they can even morph to a different stage depending which weapon you use to fight with them.</p><p>The game has some basic role-playing elements such as character attributes and experience. Unlike Castlevania: Lament of Innocence, you are now able to use many types of weapons: Axes, swords, spears, knuckles and even shields for example. You can also craft your own weapons either by using an existing weapon as a base, and having some additional material such as bronze, steel and aluminium or having an extra amount of materials.</p><p>The battle system allows you to lock on to an enemy and hit them with multiple combos. You have some control on your Innocent Devil, and can command it to use certain skills, guard you and join the fight.</p>"},{"name":"Catwoman","year":2004,"developer":"Argonaut Games PLC","url":"microsoft_xbox_c_part1/Catwoman%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CDa%29.zip","filesize":6559063063,"score":4.9,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Another licensed title by EA, based on the movie with the same name, starring Halle Berry. The game follows the film's plot and its models and graphics are based upon the respective characters and locations as seen in the movie. Halle Berry also lends her voice to the character, aside from her likeness.</p><p>Catwoman has an impressive array of powers at her disposal with which to overcome obstacles and fight her enemies. The gameplay is split between overcoming obstacles using Catwoman's agility and whip, and defeating (but not killing) enemies using her abilities and the aforementioned whip, again.</p>"},{"name":"Cel Damage","year":2001,"developer":"Pseudo Interactive, Inc.","url":"microsoft_xbox_c_part1/Cel%20Damage%20%28Europe%29.zip","filesize":6858978991,"score":6.7,"genres":"Action > Racing / Driving > Behind view > Automobile > Track racing","desc":"<p>A vehicular combat game set in a cartoon universe with 12 different environments. Wield a massive chainsaw, giant axe or one of 34 other wild weapons. There are 3 gameplay modes: Smack Attack (smack your opponents to gain points), Gate Relay (Pass the Checkpoints 5 times before your enemies do), and Flag Rally (CTF). 6 playable characters with 4 unlockable guest stars. For 1 to 4 players.</p>"},{"name":"Championship Bowling","year":2006,"developer":"Black Market Games","url":"microsoft_xbox_c_part1/Championship%20Bowling%20%28USA%29.zip","filesize":6726789053,"score":"","genres":"Sports > Behind view > Direct control > Bowling","desc":"<p><em>Championship Bowling</em> is a bowling game featuring:* 6 locations that can be played in day or night</p><ul><li>A control system allowing control over speed, direction and curve of the ball</li><li>Individual character stats from over 12 unlockable characters</li><li>Single-player tournament mode and multi-player mode</li></ul>"},{"name":"Championship Manager 2006","year":2006,"developer":"Gusto Games Ltd.","url":"microsoft_xbox_c_part1/Championship%20Manager%202006%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":6723525014,"score":"","genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>The console version of <em>Championship Manager 2006</em> is in many ways similar as the PC version. Players select a club from one of many different countries and play the manager's role, taking charge of tactics, training, signing new players, negotiating contracts etc. The game is very statistics heavy and assumes a fairly deep knowledge of the football game, setting it apart from its more accessible competitors.</p><p>Since this version was released some months after the PC version it features updated stats to reflect changes in the leagues. Additionally it features new camera angles for viewing the playing field and a new interface more intuitive for the consoles.</p>"},{"name":"Championship Manager 5","year":2005,"developer":"Beautiful Game Studios","url":"microsoft_xbox_c_part1/Championship%20Manager%205%20%28Europe%29.zip","filesize":6577235486,"score":5.9,"genres":"Simulation > Sports > Strategy > Text-based / Spreadsheet > Top-down > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>Football (soccer - damn yankees!) management simulation, for the PC. Player takes the role of a club manager responsible for the day to day running of a club in one of 26 countries. Duties include buying and selling players, arranging contracts, setting training schedules and organizing match day tactics. An interactive match day football simulation is at the heart of the game.</p>"},{"name":"Championship Manager: Season 01/02","year":2002,"developer":"Sports Interactive Limited","url":"microsoft_xbox_c_part1/Championship%20Manager%20-%20Season%2001-02%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6130707072,"score":7.3,"genres":"Simulation > Sports > Strategy > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>This was the fourth and final version of the Championship Manager 3 game engine. The basic gameplay is as ever - take control of a football team (literally thousands are offered, from 26 leagues) and aim to make them the best in the country and then the world.</p><p>Your players are depicted via a huge selection of statistics, covering their abilities, histories and performances (in each match they are rated out of 10; average ratings to 2 decimal places are among the stats saved for every one of the 30 seasons you can play for). A huge number of preset tactics are available, and each player's individual role can be customised for each area of the field. The transfer system allows you to scout for players all over the world and sign them permanently or on loan, with other clubs trying to do the same, and bidding for your players. You choose training schedules for each player, and watch their performance change as a result.</p><p>As well as updating the player and team data to account for transfers and promotions / relegations, a number of new features are included in the game. The transfer system changes in line with new EU rules limiting the length and binding nature of contracts, you can compare player stats side by side, and send players away for rehabilitation. There's also more interaction with the club's owners and the league officials. An extra challenging option of Attribute Masking is added - this results in obscure information being hidden, and requiring more scouting to discover.</p>"},{"name":"Championship Manager: Season 02/03","year":2002,"developer":"Sports Interactive Limited","url":"microsoft_xbox_c_part1/Championship%20Manager%20-%20Season%2002-03%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":6081387136,"score":"","genres":"Simulation > Sports > Strategy > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>Championship Manager 3 is now exclusive on the Xbox in this iteration. Covering seasons 2002-2003 with:</p><ul><li>Up to date team and player data for over 100,000 footballers and staff</li><li>Managing any team from 27 worldwide leagues</li><li>Includes the updated FIFA transfer system</li></ul>"},{"name":"Charlie and the Chocolate Factory","year":2005,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_c_part1/Charlie%20and%20the%20Chocolate%20Factory%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":5925904507,"score":4.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>You play Charlie Bucket, a poor child, on a tour through eccentric confectioner Willy Wonka's fabulous candy factory in this interactive take on the classic children's story.</p><p>As Charlie you will attempt to put the factory in working order, cleaning up the messes created by other children on the tour.  You'll have to run, jump, carry objects, push buttons, and command a small army of Oompa Loompa assistants on the way to winning the ultimate prize:  the factory itself.</p>"},{"name":"Chase: Hollywood Stunt Driver","year":2002,"developer":"I-Imagine Interactive","url":"microsoft_xbox_c_part1/Chase%20-%20Hollywood%20Stunt%20Driver%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6477192467,"score":7,"genres":"Action > Racing / Driving > Behind view > Automobile > Post-apocalyptic > Spy / espionage","desc":"<p>Griffin Corrada was world renown as the best stunt driver ever, but after a crippling injury he had to leave the business. Now his daughter Chase wants to break in by working on the movies of Mr. Chin, equally world renown for the use of over-the-top car stunts in his films. She's going to have to prove her worth as well as watch out for Rick Baen, current top stunt driver in the business with an axe to grind.</p><p><em>Chase: Hollywood Stunt Driver</em> takes place over the scenes of four movies ranging in setting from the prohibition era to a post-apocalyptic wasteland. Chase will have to reach the end of the scene before film runs out, as well as achieve multiple objectives along the way, such as destroying objects, power sliding over a specific distance, or setting up specific shots. Every objective completed rewards reputation points necessary to unlock additional scenes. Every vehicle has a built-in, recharging nitro boost and the ability to do tricks, such as wheelies or spinning in the air.</p><p>Hidden in each level is an optional trophy that will unlock additional challenge and multiplayer modes when enough are collected, such as jumping buses or doing tricks to earn points in a specific time. Completing scenes will unlock additional cars for these modes.</p>"},{"name":"Chessmaster","year":2004,"developer":"Ubisoft SRL","url":"microsoft_xbox_c_part1/Chessmaster%20%28USA%29.zip","filesize":6550774549,"score":7.9,"genres":"Strategy > Diagonal-down > Top-down > Turn-based > Chess > Point and select","desc":"<p>The 10th Edition is the first game in the series to feature a working online component and also the first PC version to feature animated chess sets and customizable interface.</p><p>There are three main areas:* Play, with Training, Ranked, Setup Position, Tournaments, Online/LAN modes</p><ul><li><p>Learn, with Academy (a humongous tutorial collection for all levels of players), Openings training, Database and Famous Games</p></li><li><p>Fun, a kid-oriented area with a whimsical interface where they can play, learn or solve chess puzzles</p></li></ul>"},{"name":"Chronicles of Narnia, The: The Lion, the Witch and the Wardrobe","year":2005,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_c_part1/Chronicles%20of%20Narnia%2C%20The%20-%20The%20Lion%2C%20the%20Witch%20and%20the%20Wardrobe%20%28Europe%29.zip","filesize":6236590190,"score":6.9,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Experience the world of C.S Lewis and Andrew Adamson's book and film. Play as Susan, Edmund, Lucy and Peter from the film, and journey through the Professor's house, the forests of Narnia, and escape the attack on London during World War II. </p><p>Depending on which level you're playing, you'll be able to play as at least two of the four children, although some levels require you to use all four. The four children all have different special abilities. Peter is the strongest of the bunch, so you can use him for fighting off enemies or breaking through barriers. Susan is a ranged fighter and she can throw arrows, tennis balls, and snowballs. Edmund is a decent melee fighter who can climb trees and walk on ice without breaking it. Lucy has the ability to heal the other children, go through small spaces and stand on big snowballs, and make them roll. During each level, you can switch between characters at any time.</p><p>Scattered throughout the levels are coins, pink and green gems, and hidden shields that will give ratings at the end of the levels, ranging from fair to outstanding.</p>"},{"name":"Chronicles of Riddick, The: Escape from Butcher Bay","year":2004,"developer":"Starbreeze Studios AB","url":"microsoft_xbox_c_part1/Chronicles%20of%20Riddick%2C%20The%20-%20Escape%20from%20Butcher%20Bay%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6078897671,"score":8.4,"genres":"Action > 1st-person > Behind view > Puzzle elements > Shooter > Stealth > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>You are Richard B. Riddick, a convicted criminal with a record as long as <em>War and Peace</em>. You are the most wanted man in the known universe, and you have just been captured and arrested. You are being transported to Butcher Bay, a triple-maximum-security prison, the deadliest prison ever built. No one has ever escaped, and those who tried have been killed. Will you be the first?</p><p>As Riddick, you must find your way out of the prison and to safety. You begin in a cell, and soon, hell breaks out. You are left with nothing to defend yourself, so you must find a machine which will allow you to use guards weapons, otherwise you will be shocked, as they are DNA protected.</p><p>Throughout your adventure, you will explore the prison complex, caverns, mines, the triple-security area, and even the palace area, where all of the administration is housed.</p><p>To help you escape, you will have access to a small but deadly arsenal of weapons, such as a pistol and machine gun. There are a number of melee weapons available too, like a wrench or shiv (shard of glass).</p><p>You will have to take on several different enemies, from guards to prisoners to robotics to mutated humans, also called 'dwellers' who lives deep below under the prison.</p><p>Vin Diesel voices Riddick. The game is a prequel to the 1999 film Pitch Black, which first introduced Vin Diesel as Richard Riddick, the anti-hero.</p>"},{"name":"Circus Maximus: Chariot Wars","year":2002,"developer":"Kodiak Interactive Software Studios, Inc.","url":"microsoft_xbox_c_part1/Circus%20Maximus%20-%20Chariot%20Wars%20%28Europe%29.zip","filesize":6499685438,"score":6.6,"genres":"Action > Racing / Driving > 1st-person > Behind view > Classical antiquity","desc":"<p><strong>Circus Maximus</strong> is a racing game that takes place in ancient Rome, and as such you'll be racing chariots around various tracks, including the famed Colliseum.</p><p>You'll be in control of both the driver and your partner, the warrior, whose job is to attack the other racers to make them fall over. Chariots are controlled by whipping horses and trying to balance an on-screen meter that keeps your chariot balanced while taking turns fast.</p><p>There are four different race modes available; Training, which gives you the basics on how to play, Arcade, which is your standard race, Multiplayer, which lets you face off against three friends (or foes), and Career, which tracks your progress over a period of time.</p><p>There are seven different environments and 19 tracks, all set throughout the Roman Empire.</p><p>Each course is littered with obstacles, power ups, weapons, and special moves, designed to give you an edge in combat.</p>"},{"name":"Classified: The Sentinel Crisis","year":2006,"developer":"Torus Games Pty. Ltd.","url":"microsoft_xbox_c_part1/Classified%20-%20The%20Sentinel%20Crisis%20%28USA%2C%20Europe%29.zip","filesize":6571156615,"score":5.3,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Classified: The Sentinel Crisis</em> is a budget-priced first-person shooter that takes place in a futuristic setting. You play as a mutant super-soldier resembling Master Chief, wearing the military's new \"Sentinel\" suit that makes him stronger, auto-heals him, and targets enemies. A group of terrorists have managed to find out about the Sentinel suits, and have kidnapped a scientist that helped develop the suits. You must destroy the terrorists and make sure that the Sentinel technology does not fall into the wrong hands.</p><p>As with many other budget-priced shooters on the market, the gameplay in <em>Classified: The Sentinel Crisis</em> is very similar to that of the <em>Halo</em> games. Most notably, the auto-healing system is similar to <em>Halo</em>'s \"shields\" system.</p>"},{"name":"Close Combat: First to Fight: United States Marines","year":2005,"developer":"Destineer Studios","url":"microsoft_xbox_c_part1/Close%20Combat%20-%20First%20to%20Fight%20-%20United%20States%20Marines%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6136281105,"score":6.9,"genres":"Action > 1st-person > Tactical shooter","desc":"<p><em>Close Combat: First to Fight</em> is a modern military first-person shooter. The player leads a marine fireteam in a fictional campaign taking place in Beirut, Lebanon. At certain times in the single player game, it's possible to call in mortar strikes and air strikes. Enemies have a psych-model similar to what is in the classic RTS <em>Close Combat series</em>, which causes them to hunker down, or even flee when they take enough fire.</p><p>The game features four player co-op through the entire single player campaign, as well as multiplayer deathmatch. Available weapons are: M16A4, M203 Grenade Launcher, M249 SAW, M590 Shotgun, M67 Frag Grenade, M8HC Smoke Grenade, AK-74, SVD Sniper Rifle, M1911 Pistol, RPG-7, and RPK.</p>"},{"name":"Club Football 2005","year":2004,"developer":"Hoodoo Studios","url":"microsoft_xbox_c_part1/Club%20Football%202005%20-%20AC%20Milan%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":5848284288,"score":6.1,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>Club Football 2005 is a series of 21 club-specific football games. Each version has its own opening sequence, menu graphics, and packaging as well as a Club Album that contains facts and memorabilia from each clubs present. When playing the game you earn credits that can be used to unlock features as pictures and video clips. The gameplay from last years game has been improved with a new animation system as well as some new skills including  dummies, close control and fakes. </p><p>The game comes with several different game modes. You can play in Domestic, European and Custom leagues and tournaments. The Career mode lets you create yourself in the game to play with your team. Several scenarios has been included allows you to play classic matches from the history of your club. For new players is the practice mode that lets you prepare for the big matches.</p>"},{"name":"Club Football: 2003/04 Season","year":2003,"developer":"The Codemasters Software Company Limited"},{"name":"Codename: Kids Next Door - Operation: V.I.D.E.O.G.A.M.E.","year":2005,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_c_part2/Codename%20-%20Kids%20Next%20Door%20-%20Operation%20-%20V.I.D.E.O.G.A.M.E.%20%28Europe%29%20%28En%2CDe%29.zip","filesize":6347936093,"score":6,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>This action/adventure platformer is based on the Cartoon Network show Codename: Kids Next Door. The Kids Next Door battle their arch-nemesis from the show (Knightbrace, Count Spankulot, and others) when they escape from the maximum-security KND prison on the moon.</p><p>In each mission, you control a specific KND agent, and each agent has a unique playstyle: Numbuh One is a master of ranged weaponry, Numbuh Two pilots aircraft, and spacecraft, Numbuh Three has extra platforming mobility, Numbuh Four is a melee brawler, and Numbuh Five uses stealth to her advantage.</p>"},{"name":"Cold Fear","year":2005,"developer":"Darkworks S.A.","url":"microsoft_xbox_c_part2/Cold%20Fear%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6589903656,"score":6.9,"genres":"Action > Behind view > Puzzle elements > Survival horror > Direct control > Horror","desc":"<p>A team from the Coast Guard boards a nameless Russian Whaler lost in a storm. Little do they know that a team of CIA operatives tried to do the sameshortly before, all of them ending up dead. Within minutes, the entire Coast Guard team shares their fate, except one person, veteran USCG Tom Hansen.Now it's up to him to discover which kind of creatures wiped out his mates. Are there any survivors? What happened aboard this vessel? How does its recent visit to the Russian scientific drilling platform \"Star of Sakhalin\" fit in?</p><p><em>Cold Fear</em> is a typical console-style action adventure, similar to gameslike the Silent Hill series. Most of the time players will be viewingthe action from a third person point of view, following the characteraround as he utilizes an array of weapons to dispose of a variety of enemies.Occasionally, a puzzle has to be solved or a cutscene (rendered with the game's own engine) must be witnessed. Additional insight can be gained by reading thevarious notes, letters and diaries that can be picked up every now and then.</p>"},{"name":"Cold War","year":2005,"developer":"Mindware Studios s.r.o.","url":"microsoft_xbox_c_part2/Cold%20War%20%28USA%29.zip","filesize":6660938794,"score":7,"genres":"Action > Behind view > Puzzle elements > Shooter > Stealth > Cold War > Contemporary > Spy / espionage","desc":"<p>In <em>Cold War</em> you play the role of Matthew Carter, an American journalist, who gets into serious trouble when chasing after a story in of Russia in 1986. You soon realize that you have been led you into a trap orchestrated by anti-perestroika KGB conspirators, headed by a fictional KGB director Named Georgi Barinski. These conspirators want to stop you from uncovering their plans, and also get revenge for a previous news story in which you exposed a KGB operation in Berlin. To get you out of the way, they have switched your ordinary camera for one incorporating a cunning X-ray weapon, and have framed you as a CIA assassin who wanted to kill General Secretary Mikhail Gorbachev (who, in the game, is somewhat incorrectly referred to as the \"president\" -- even though no such office existed at the time). Your goal is to escape the Lubyanka KGB prison, together with the head of the Presidential Guard, a loyalist named Grushkov who has also been framed. You must work with him to stop the KGB radicals from overthrowing the government, and to prove that you are both innocent.</p><p>Cold War's gameplay is based on stealth, similar to games like Splinter Cell or Dark Project. Being a journalist you are no weapons expert, so you should try to be stealthy and attack only when necessary. To help even the odds, you can create useful gadgets out of items you find, improvising things like gas grenades, anesthesia ammunition or distraction items.</p>"},{"name":"Colin McRae Rally 04","year":2003,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_c_part2/Colin%20McRae%20Rally%2004%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6323863942,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>Colin McRae is no longer with Ford and Nicky Grist is no longer Colin’s co-driver. Things have moved on in the rally-driving world, as they have with this, the fourth title in the series. This time the player is in the vehicle of their choice.</p><p>While the game features improved graphics over the older titles in the series the biggest improvement is the handling in the game, which is now based on real-world physics. Where the previous titles' handling of the cars made use of one pivot point, the new physics engine has four pivot points, each wheel interacting independently of the others. </p><p>There are four championships modes: 2WD, 4WD, Group B and Expert. 2WD is for beginners. 4WD is the next step up, offering an intermediate challenge. Group B features cars from the '80s that were banned in 1986, as they were unrestricted and capable of extreme acceleration. And finally, Expert is for those that finish 4WD in advanced mode, upon which they are presented with Expert mode where one drives with cockpit view only, and with the highest damage setting. </p><p>There are 8 national rallies in which to race, including USA, Australia, UK, Finland, Japan and Greece. There are also over 20 cars to unlock, including the Team Ford Transit van.</p>"},{"name":"Colin McRae Rally 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_c_part2/Colin%20McRae%20Rally%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5550005233,"score":8.1,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>The fifth iteration of the rally racing game inspired by the \"Flying Scotsman\".  Choose from over 30 car models.  The detail and physics are improved, and more playing modes are available, including a new around-the-world career mode.  Weather conditions and rally courses can both be customized.  Network play supports up to eight players with split-screen.  As always, the menu design is clean, and the tracks are dirty!</p>"},{"name":"Colin McRae Rally 3","year":2002,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_c_part2/Colin%20McRae%20Rally%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5735229905,"score":8.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>The third title in the rally series has you off road over a range of courses around the world as Colin McRae, in the Ford Focus rally car.</p><p>You are given 3 seasons to win the world rally championship, racing the Ford Focus RS RWC. In each season there are 8 competitions, staged in Australia, the USA, England, Sweden, Japan, Greece and Finland. Each competition has 6 stages set around different landscapes, and a special head-to-head stage at the end. You are out to beat the clock, and the time set by the opposing teams, on each occasion. Beat the time, win the stage, and you are once step closer to taking the world title.</p><p>Along the way you can alter and modify the Focus' setup, from the wheels used, gearboxes, brakes, suspension and so forth. You can also test drive the car before any event to make sure the setup is to your liking.</p><p>Apart from the championship mode you can also play stage mode, allowing you to race in any of the cars unlocked during the championship mode, on all the courses you have completed. Compete against the clock or against a friend in 2 player mode.</p>"},{"name":"College Hoops 2K6","year":2005,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_c_part2/College%20Hoops%202K6%20%28USA%29.zip","filesize":6129002394,"score":7.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>College Hoops 2K6 is a game dealing with college basketball. Go through Legacy Mode as the coach to bring a small college respect and eventually win a championship. Go online to test your skills against players around the world. Also included are features such as Pre-season, the Coach's Clipboard, Midnight Madness (which allows you to participate in the first practice of the year with a midnight intra-squad exhibition that has become a college hoops tradition.), Strip 'n' Rip System, Shot Stick (which controls the way you take your shot to make a basket), and V.I.P. System. Another feature is Selection Sunday broadcast shows, where you'll watch a broadcast of your team’s placement into the NCAA Tournament and listen to commentary as video clips give you the low down on all the bracket match ups.</p>"},{"name":"College Hoops NCAA 2K7","year":2006,"developer":"Visual Concepts, Ltd.","url":"microsoft_xbox_c_part2/College%20Hoops%202K7%20%28USA%29.zip","filesize":6214279661,"score":8,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>College Hoops 2K7</em> is the update of College Hoops 2K6 and a continuation of 2K's NCAA basketball franchise. It features the obligatory roster updates (including the names of the players) with 325 NCAA Division I teams to choose from and improve crowd reactions, updated mascots, new fight songs and real life coaches such as Billy Donovan, Roy Williams and Jay Wright.</p><p>It has the standard modes and has an updated <em>Legacy</em> (franchise) mode that has the player take command of a NCAA team, recruiting and training potential NBA players for the future. It sports updated offensive and defensive A.I. and features <em>Team Unity</em> where the chemistry of the team combined with the captain's leadership qualities can combine to help their team in their performance and morale on the court.</p><p>Players can also customize by creating their own school along with uniforms and even design a unique stadium for their created school. The games are almost identical except for a few differences: the PS3 and Xbox 360 versions has the ability to create their own chants for their crowds to yell during home games and the PS3 utilizes the SIXAXIS controller to shoot free throws by tilting it.</p>"},{"name":"Combat Elite: WWII Paratroopers","year":2005,"developer":"BattleBorne Entertainment, Inc.","url":"microsoft_xbox_c_part2/Combat%20Elite%20-%20WWII%20Paratroopers%20%28USA%29.zip","filesize":6465756186,"score":"","genres":"Action > 1st-person > Diagonal-down > 2D scrolling > RPG elements > Shooter > Direct control > Europe > World War II > War","desc":"<p><em>Combat★Elite: WWII Paratroopers</em> is primarily a top-down close-combat shooter with some RPG features. It can be played in single-player or two-player coop mode. The game lets the player take part as a paratrooper in the allied campaign in Europe during the second world war, starting out as a private soldier from either the US 101st Airborne, the US 82nd Airborne, or the British 1st Airborne regiment.</p><p>There are 40 missions strung together with a narrative, depicting the Operation Overlord (D-Day), Bastogne, Operation Market Garden and the Battle of the Bulge and beyond - ending in an fictional effort to stop the Nazis from creating an atomic bomb. During a mission, you find medical packs, ammunition (weapon specific), and new weapons as pickups lying around, or dropped by enemies killed - the drops disappear if not picked up in time. A mission takes place on a series of relatively small maps, separated into 'levels', and at the level transition points the player can save the game, and is also awarded skill points, new ranks and medals.</p><p>The RPG aspect includes the initial character specialization, and between missions levels the player get skill points, which can be saved for later or allocated between missions to improve various combat skills:Hand-to-Hand, Pistol, SMG, Rifle, Heavy SMG, Stealth, Medic, Grenade and 'Combat Sense'.</p><p>In single-player has classic run-and-gun gameplay. You use a player-centered bird's-eye view, and you must turn the character to spin the view as you can only shoot at enemies at the top of the screen, as opposed to the sniper mode, when you use a 1st person scoped view. The screen has a fixed scaling, there is no zoom or free pan, other than to automatically give you a few seconds look ahead when key locations are nearby. The player is kept in the center of the screen and the view window automatically slides over the battlefield as your character moves. Normally, enemies won't fire until they are within your view - but there are exceptions.</p><p>In two-player coop mode, each player can shoot in the direction their character is facing, and do not need to rotate the view to hit the enemy. The players cannot be farther apart than the screen size, which is fixed. The screen is centered between the player characters in this mode. If players are far apart at opposite edges of the screen, they can often be shot at from off-screen enemies, as enemies are triggered by being close enough - about half the screen size away on the map, no matter if you can see them yourself.</p>"},{"name":"Combat: Task Force 121","year":2005,"developer":"Direct Action Games","url":"microsoft_xbox_c_part2/Combat%20-%20Task%20Force%20121%20%28USA%29.zip","filesize":6764397537,"score":5.3,"genres":"Action > 1st-person > Shooter","desc":"<p>In Combat: Task Force 121, you are a member of the elite Task Force 121, the US military force responsible for the capture of Saddam Hussein.  You are tasked with taking out a group of Marxist rebels intent on destabilizing the unnamed region.  The single player game takes takes you through an oil rig, dense jungles, a refinery, shanty towns and an exotic island.</p><p>This FPS is very much a multiplayer oriented affair.  The game supports up to 16 players over Xbox Live, system link and Internet (PC).  There are 10 weapons to use, 10 multiplayer maps to explore and seven modes of play: deathmatch, team deathmatch, capture the flag, king of the hill, team king of the hill, last man standing, team last man standing and VIP escort.  There is also an offline training mode that lets you compete in deathmatch against bots.  The straightforward control scheme, well balanced weapons and interesting maps make for some quick, dirty and fun multiplayer action.</p>"},{"name":"Commandos 2: Men of Courage","year":2002,"developer":"Pyro Studios S.L.","url":"microsoft_xbox_c_part2/Commandos%202%20-%20Men%20of%20Courage%20%28Europe%29.zip","filesize":4862412254,"score":8.1,"genres":"Strategy > Diagonal-down > Free-roaming camera > Isometric > Real-time > Stealth > Multiple units/characters control > Point and select > Asia > Europe > Historical events > Oceania > World War II > War > Regional differences","desc":"<p>From the heart of the Third Reich to the most remote islands in the South Pacific, Sergeant Jack \"Butcher\" O'Hara and his elite group of gritty soldiers must combine their expertise and venture deep into enemy territory...in an attempt to change the course of the war. </p><p>This sequel contains the following enhancements:* All new 3D engine - rotate the environment 360 degrees and move seamlessly in and out of buildings, submarines, planes, underwater and zoom in and out of the environments.</p><ul><li><p>Interact like never before - steal enemy uniforms and weapons, climb and swing from cables, jump from windows and utillize vehicles.</p></li><li><p>Control 9 commandos - including the green beret, sniper, demolitions expert, seductress, thief and even a dog!</p></li><li><p>Authentic WWII scenarios - 10 missions spanning 9 different environments in night and day with realistic weather effects.</p></li><li><p>Multiplayer - players can go to war in the co-operative multiplayer mode.</p></li></ul>"},{"name":"Commandos: Strike Force","year":2006,"developer":"Pyro Studios S.L.","url":"microsoft_xbox_c_part2/Commandos%20-%20Strike%20Force%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6470436316,"score":6.7,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > War","desc":"<p>In this new Commandos game, converted from real-time strategy to first person shooter with a tactical component, you'll play as a Green Beret for the fast action, as a Sniper for the tactical shooting and as the Spy for the stealth and sabotage bits. In some missions you could use two of them, changing from one to another in real time.</p><p>The game, set in the WWII, makes you play in Stalingrad, Norway, and France, side by side with your allies, trying to wreak havoc!</p><p>The music is played by the Bratislava Symphony Orchestra and the City Choir of the same city.</p>"},{"name":"Conan","year":2004,"developer":"Cauldron Ltd.","url":"microsoft_xbox_c_part2/Conan%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6539534959,"score":6.2,"genres":"Action > Behind view > Hack and slash > Fantasy > Licensed","desc":"<p>As Conan returns from another successful adventure, he finds that a band of masked warriors has destroyed his village and murdered his uncle, bad move. Now it's time for Revenge! </p><p>\"Conan\" is a 3D hack'n'slash action title that blends RPG elements by awarding experience points for each defeated enemy. Said points can be spent on a plethora of fighting skills which are then triggered via a simple combo system for spectacular results as you battle hordes of human warriors and supernatural monsters from beyond in your quest for revenge. Should you fall to a well-placed blow, Conan offers you the chance to try and regain your honor in the domains of Crom, where a small arena fight can restore your honor and bring you back to life and continue the game or damn you to eternity should you fail. </p><p>Also available is a multiplayer Arena mode in which you can duke it out mano-a-mano with other human players as Conan or a selection of original characters. Features the original licensed soundtrack from the Conan movies by Basil Poledouris.</p>"},{"name":"Conflict: Desert Storm","year":2002,"developer":"Pivotal Games Ltd.","url":"microsoft_xbox_c_part2/Conflict%20-%20Desert%20Storm%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6522156405,"score":7.1,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Historical events > Middle East > War","desc":"<p><em>Conflict Desert Storm</em> is a first-person/third-person shooter (the perspective can be switched by pressing a button), in which the player controls a squad of four soldiers from either the British S.A.S or American Delta Force during the first Gulf War. It has ideas borrowed from the book <em>Bravo Two Zero</em> and other real missions from the war. </p><p>Missions are performed behind enemy lines and have specific objectives (infiltrate a base, destroy a SAM site, assassinate an opposing general, ...). Team members can be sent orders (attack, retreat, follow, stay, ...) or controlled individually. On the team is Bradley, the team leader, Conners, the heavy weapons man, Jones, the explosives and anti-tank expert, and Foley, the team sniper. Each soldier has different skills that improve as they kill more enemies and gain experience. This results in them doing a better or faster job (Foley will have more stable aiming or Jones will plant C4 faster as their skills increase). In some missions, the player drives tanks or jeeps around while other squad members man the guns on the vehicle. At the end of each mission, the soldiers can be awarded medals for their bravery</p><p>The game also features up to four-player co-op, each player controlling a soldier in the squad.</p>"},{"name":"Conflict: Desert Storm II - Back to Baghdad","year":2003,"developer":"Pivotal Games Ltd.","url":"microsoft_xbox_c_part2/Conflict%20-%20Desert%20Storm%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6576791323,"score":7,"genres":"Action > Behind view > Shooter > Direct control > Historical events > Middle East > War","desc":"<p><em>Conflict: Desert Storm II: Back to Baghdad</em> is the sequel to Conflict: Desert Storm. The player is ordered back to Iraq for some unfinished business.</p><p>The gameplay and controls haven't changed since the original, but it has more detailed graphics. There are more weapons at the squad's disposal and more vehicles to drive.</p>"},{"name":"Conflict: Global Terror","year":2005,"developer":"Pivotal Games Ltd.","url":"microsoft_xbox_c_part2/Conflict%20-%20Global%20Terror%20%28USA%29.zip","filesize":6346991811,"score":6.8,"genres":"Action > Strategy > 1st-person > Behind view > Shooter > Stealth > Tactical shooter > Direct control > Multiple units/characters control > Historical events","desc":"<p>This installment of the Conflict series occurs in many diverse regions of the world: in <em>Conflict: Global Terror</em>, Red Team spends the game fighting international terrorism.</p><p>Rather than gung-ho desert tank warfare, or tense jungle ambush fighting, the game explores many non-army locations such as gas factories, cocaine production facilities and hotels.</p><p>The combat is often up close and very personal, although most levels mix up the killzone areas, giving a wide variety of combat situations over many varying ranges. Missions vary quite a bit too. Some are frenetic and fast-paced, with the team fighting for their lives, while others can be played at a much slower pace if desired. The level design really adds to counter-terrorism gameplay. Red Team is often busting sieges using C4 to blow holes in walls and smoke grenades to flush the bad guys out.</p><p>The gadgets are useful and are frequently found to be helpful: thermal goggles let the player see through smoke, and Bradley's laser designator can mark key targets for gunship air strike. Claymore mines allow the team to protect their rear or even set up ambushes.</p><p>The game is very flexible and allows for many different playing styles. Players are free to run and gun, or play as a super-stealthy special forces team. They can play as one character leading the team, or switch around between characters as they see fit. Ordering the team about and switching characters is quick and simple. It is even possible to give each member advanced orders (\"On my signal, Connors runs to the window, Bradley opens the door and Jones throws a grenade through the window. Ready... Go!\"), allowing this kind of thorough planning if the player wants to play that way. The co-op allows multiple players to take control of Red Team.</p><p>There are 4 difficulty modes and a skill learning curve for beginners and veterans alike. There are over 30 weapons with individual stats and behaviours. Each has their own distinct advantages and disadvantages. For example, pistols are sometimes a better choice than a light machine gun.</p><p>The story unfolds throughout the missions and also in the cutscenes in between. The team is made up of four distinct characters, with their own personal histories, lives and personalities.</p>"},{"name":"Conflict: Vietnam","year":2004,"developer":"Pivotal Games Ltd.","url":"microsoft_xbox_c_part2/Conflict%20-%20Vietnam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6216731202,"score":6.4,"genres":"Action > Strategy > Behind view > Shooter > Cold War > Historical events > War","desc":"<p><em>Conflict: Vietnam</em> is the third game in Pivotal Games' Conflict series, this time going further back in time to the bloody battleground of Vietnam. The game is set during the Tet offensive in the year 1968.</p><p>The player takes over the roles of four soldiers who aren't, contrary to previous games, elite S.A.S or Delta Force soldiers. In fact, they are normal American G.I. who are separated from their unit during battle and have to fight themselves through enemy territory with hordes of hostile Vietnamese.</p><p>Game can be played by issuing orders to every member of the squad or directly taking control over one of them. In every mission, there are one or more main and several bonus objectives, like destroying all tanks in the area or collecting Vietcong documents. For each achieved objective, killed soldier or destroyed vehicle, squad members get experience points. Each one of them has different abilities (Sniper, Leader, Heavy Weapons, Medic) which can be improved with these points. To defuse one of the numerous booby traps, it is necessary to have skills in that ability.</p><p>The levels are set around the jungle and include underground Vietcong complexes or temples. In addition to enemies, friendly characters like allied soldiers or citizens can be encountered and talked to, with some of them giving bonus objectives to complete. Furthermore, some missions involve the use of stationary weapons like machineguns and driving jeeps or tanks.</p><p>The console versions of <em>Conflict: Vietnam</em> feature a split-screen multiplayer co-op mode with up to four players (Xbox), or two players (PS2). The PC version doesn't have this feature.</p>"},{"name":"Conker: Live & Reloaded","year":2005,"developer":"Rare Limited","url":"microsoft_xbox_c_part2/Conker%20-%20Live%20%26%20Reloaded%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6404639371,"score":7.9,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Shooter > Sci-fi / futuristic","desc":"<p><em>Conker: Live &amp; Reloaded</em> is a combination of frantic online multiplayer action and a single-player mode, which is a remake of the original  Conker's Bad Fur Day for Nintendo 64 with more detailed and technologically advanced graphics, as well as re-recorded music.</p><p>The single-player game plays very similarly to the original version, but a few gameplay-related changes have been made. Conker now uses a baseball bat instead of the frying pan (his default weapon in the original). A few particularly challenging sequences have been made slightly easier; for example, a crosshair has been added for the slingshot weapon. The remake also censors more swear words with \"beeps\" than the original release.</p><p>The multiplayer game supports up to 16 combatants. This team based game is about the war between two factions: Squirrels and Tediz. Each team has multiple classes as Grunt, Sneaker or Skyjockey, and if the team wishes to reign supreme, they must use the teams effectively as every class has it's own special skills. The game is comprised of two different campaigns: The Future War, and The Old War. Both of these include multiple levels which are played in order to tell a story, and ultimately, defining the winner of the campaign. There are also many vehicles, weapons and items to use which help to win the war.</p>"},{"name":"Conspiracy: Weapons of Mass Destruction","year":2005,"developer":"Kuju Entertainment Ltd.","url":"microsoft_xbox_c_part2/Conspiracy%20-%20Weapons%20of%20Mass%20Destruction%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6687473573,"score":4.1,"genres":"Action > 1st-person > Shooter","desc":"<p>Cole Justice, a retired Secret Service agent has been recalled by The Agency for one last mission. Hydra, a rogue government agency has according to intelligence reports been developing and selling biological weapons to terrorist organizations. Now, Cole's mission is to stop them, but who should he trust, the government or Hydra?</p><p><em>Conspiracy: Weapons of Mass Destruction</em> is a first person shooter built on the Fire Warrior engine. As Cole Sullivan, players will be assigned to missions around the globe, including places such as the South American jungle and the Arctic Circle. The game contains typical FPS weapons such as the machine gun, the sniper rifle and the rocket launcher.</p><p>In addition to the campaign there's also the Endurance Mode, where enemies will spawn around you and you have to stay alive as long as possible. For each enemy you take down you'll earn points, and if you're quick you can make chain combos and get huge scores.</p>"},{"name":"Constantine","year":2005,"developer":"Bits Studios Ltd.","url":"microsoft_xbox_c_part2/Constantine%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6537257223,"score":6.5,"genres":"Action > Behind view > Direct control > Horror > Licensed","desc":"<p>John Constantine is the name of the main character in the <em>Hellblazer</em> comic by Vertigo DC. This game is based on the movie <em>Constantine</em>, starring Keanu Reeves. The player assumes the role of Constantine, a mage/exorcist/demonslayer of the modern age. A man who fights Evil, but remains cynical and skeptical in the face of Good. He also smokes a lot.</p><p>The game is played in third person perspective, switching to first person when the hero enters narrow spaces. Constantine's goal is to discover how and why Demons have managed to physically enter Earth, although the ancient laws forbid it. He utilizes a number of holy weapons and artifacts, from twin revolvers (dubbed the Witch's Curse) that shoot stones from the Holy Lands to Holy Water Bombs and the Cross Shotgun. Constantine can also utilize various kinds of offensive magic powered by the souls of slain demons. Often he will be obliged to travel to Hell, which resembles a perpetually ablaze and decaying version of our world, in order to bypass obstacles. Each level is linear and is played sequentially, following most of the story of the movie with a few sections added in or stretched out to allow for more action. Hidden cards in levels will unlock cutscene animatics, concept art, and interviews with the stars of the film.</p>"},{"name":"Corvette","year":2003,"developer":"Steel Monkeys","url":"microsoft_xbox_c_part2/Corvette%20%28USA%29.zip","filesize":6879899987,"score":6.2,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Licensed","desc":"<p>Celebrate the 50th anniversary of the great American dream machine.  This race game features over 100 Corvette models, from the 1953 original to the fine-tuned 2003.  Simple single and split-screen player modes are available, or start from the beginning and race through history, collecting and upgrading cars along the way.  There are over 15 tracks, with alternate routes that can be unlocked through races.  Models and colors are true to spec, although custom cars can be unlocked as well.</p>"},{"name":"Counter Terrorist Special Forces - Fire for Effect","year":2005,"developer":"Asobo Studio S.A.R.L.","url":"microsoft_xbox_c_part2/Counter%20Terrorist%20Special%20Forces%20-%20Fire%20for%20Effect%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6501274705,"score":6.5,"genres":"Action > 1st-person > Behind view > Shooter","desc":"<p><em>Special Forces: Nemesis Strike</em> is an action game in which you are a part of an anti-terrorist force whose sole purpose is to strike where striking is needed and put end to evil plans to destroy/take over the world.</p><p>The player controls two different heroes. Night Owl is an infiltrations expert, and very good at accurate shooting and jumping from planes, which some of the missions require him to do. Raptor on the other hand, is a weapons expert. He is also more than adequate in hand-to-hand combat. These two take turns in their own levels on their way to destroy the evil NEMESIS group and retrieve the stolen scientific plans.</p><p>Levels are always very action-oriented even when playing as Night Owl and there are very little sneaking to do, as the main focus is on action. The levels range from your basic submarine factories to hidden missile silos and so on, with a few outdoor levels here and there, in which one usually can drive one of the vehicles (jeeps, hovercrafts, boats, etc).</p><p>There are multiple weapons to choose from. From knives to huge rocket launchers and solid turrets. The physics system is also implemented in the game and most of the time there is a nice amount of stuff and dudes flying around as you make havoc with havok.</p>"},{"name":"Counter-Strike","year":2003,"developer":"Turtle Rock Studios, Inc.","url":"microsoft_xbox_c_part2/Counter-Strike%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%2CKo%29.zip","filesize":6846381864,"score":6.4,"genres":"Action > 1st-person > Shooter > Direct control > Regional differences","desc":"<p>The Steam and Xbox releases of <em>Counter-Strike</em> are commercial standalone versions of the game, updated with a newer GoldSrc engine build. However, they omit the extra modifications which were available in the Half-Life: Counter-Strike retail releases that are not <em>Counter-Strike</em> itself.</p><p>The Linux and Macintosh PC versions were never available separately. When they were released, <em>Counter-Strike</em> could only be bought as a compilation pack containing both Counter-Strike: Condition Zero and the original <em>Counter-Strike</em>. However, existing players who only owned <em>Counter-Strike</em> thus received it for the additional platforms for free, even if they did not own the original <em>Counter-Strike: Condition Zero</em> or never bought the compilation pack.</p>"},{"name":"Crash 'N' Burn","year":2004,"developer":"Climax Racing","url":"microsoft_xbox_c_part2/Crash%20%27n%27%20Burn%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6853254394,"score":6.8,"genres":"Racing / Driving > 3rd-person (Other)","desc":"<p>Race aggressively against 15 other cars through various courses to win races that are run through city-street circuits. You must also keep your car running by not having it damaged too severely from car crashes. You also have to dodge the wrecks of your competitors which remain on the track after they have crashed one too many times. After each race you win, you earn cash that can be used to upgrade the cars in your garage. There are four car types available: compact, pickup, muscle, and sports.Other race modes include last man standing, bomb tag, running man, and kamikaze.</p>"},{"name":"Crash Bandicoot: The Wrath of Cortex","year":2002,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_c_part2/Crash%20Bandicoot%20-%20The%20Wrath%20of%20Cortex%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6494863548,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy > Regional differences","desc":"<p><em>Crash Bandicoot: The Wrath of Cortex</em> is the first Crash Bandicoot game for a system other than the original PlayStation. The story is set sometime after Warped: Dr. Cortex wants revenge after being defeated by Crash (again). For this purpose, he creates Crunch, a super-bandicoot who can destroy everything that crosses his way. Crunch's power source is a set of magical masks known as the Elementals, each representing a different element, including Earth, Water, Fire, and Ice. The warp room splits levels into their respective elements, with the boss of each section being a battle against Crunch influenced by the Elemental mask of said section. </p><p>The game is a typical jump and run, with some other action passages, like air combat and a sequence where Crash is trapped inside a giant sphere rolling around in some sort of rollercoaster. All graphics are in 3D, and the sound is typical for cartoon games like this. The whole game is pretty straightforward in design, getting stuck on a puzzle is not really possible.</p>"},{"name":"Crash Nitro Kart","year":2003,"developer":"Vicarious Visions, Inc.","url":"microsoft_xbox_c_part2/Crash%20Nitro%20Kart%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6548436773,"score":7.2,"genres":"Racing / Driving > Behind view > Direct control > Automobile > Track racing > Fantasy > Comedy","desc":"<p>Crash Bandicoot returns to the karting scene with a host of other characters from the adventure series, and this time they have both Neo Cortex and Emperor Velo to worry about. Velo has taken the crew to a remote planet, forced to race for their lives against Neo Cortex and his many evildoers.</p><p>Choose from various game modes, from the straight into the action Arcade mode to Adventure mode, following Crash and the gang in the story to save Earth. Race against four friends in multiplayer battle modes, plus connect to the Gamecube for extra options and upload your high scores to the internet ranking system.</p>"},{"name":"Crash Tag Team Racing","year":2005,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_c_part2/Crash%20Tag%20Team%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":5802772602,"score":7,"genres":"Action > Racing / Driving > Behind view > Direct control > Automobile > Fantasy > Comedy","desc":"<p>When Ebeneezer von Clutch, the owner of the famed racetrack amusement park MotorWorld, has the Black Power Gem that maintains his life force stolen, he charges Crash and friends (and foes) to recover the gem and catch the culprit.</p><p>Similar to previous racing games in the Crash Bandicoot series, players are able to choose from a variety of characters from the series, including both notable allies and enemies, along with several notable new characters. In addition, <em>Crash Tag Team Racing</em> introduces the ability to 'clash' with another racer, allowing the two to create a hybrid vehicle to cooperatively destroy their opponents.</p>"},{"name":"Crash Twinsanity","year":2004,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_c_part2/Crash%20Twinsanity%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":5758563963,"score":6.8,"genres":"Action > Behind view > Side view > Platform > Sandbox / open world > Direct control > Fantasy > Comedy","desc":"<p>Two purple birds called the Evil Twins form a new threat to Crash's homeworld. Crash has to team up with his arch rival Dr. Neo Cortex to put a stop to this new threat.</p><p>Crash Twinsanity is a classic-style Crash platform game, though this time Crash has to work together with Dr. Cortex from time to time. Crash can pick up and throw Dr. Cortex to places he can't reach himself, or use him as a hammer to slap enemies. The consistent conflict between both heroes causes many funny situations.</p>"},{"name":"Crazy Taxi 3: High Roller","year":2002,"developer":"Hitmaker","url":"microsoft_xbox_c_part2/Crazy%20Taxi%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6742592627,"score":6.6,"genres":"Racing / Driving > 3rd-person (Other) > Behind view > Arcade > Automobile > Vehicle simulator","desc":"<p>Crazy Taxi 3 serves up more of the classic gameplay that made the series so popular on the Dreamcast.  High Roller takes place in \"Glitter Oasis\" which is modeled after Las Vegas.  You take the roll as one of 4 new drivers and you must try to deliver as many customers as possible to collect huge fares.</p><p>Crazy Taxi 3 also includes reworked versions of the original 2 levels from Crazy Taxi and Crazy Taxi 2 -- West Coast and Small Apple each with their respective drivers.  Also included is Crazy X mode in which you play through a slew of minigames for when you don't feel like tackling the main game.</p>"},{"name":"Cricket 2005","year":2005,"developer":"HB Studios Multimedia Ltd.","url":"microsoft_xbox_c_part2/Cricket%202005%20%28Europe%29.zip","filesize":6805927751,"score":6.3,"genres":"Sports > Behind view > Diagonal-down > Cricket > Licensed","desc":"<p>Electronic Arts continues its yearly cricket franchise with this outing. The Australian, English, South African and New Zealand national and league teams' names and likenesses are licensed. If you don't want likenesses of official players, then make your own with the built-in player editor to make the game custom to you. With 35 stadiums accurately modeled with real crowd noise the atmosphere is set for this TV style presentation (with action replay mode, third umpire, animated duck sequences, and TV style overlays) of cricket. </p><p>Fielding is fully automated, and it is possible to skip the entire bowling innings. Batting depends as much on shot timing as selection, while running between the wickets is faster than in previous editions. There are 13 tournament modes including domestic and international one-day and test matches, including England County Cricket's fast-paced Twenty20 Cup, and 2 net practice modes. The game has commentary from Richie Benaud and Jim Maxwell.</p>"},{"name":"Crime Life: Gang Wars","year":2005,"developer":"Hothouse Creations Ltd.","url":"microsoft_xbox_c_part2/Crime%20Life%20-%20Gang%20Wars%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6775748345,"score":4.4,"genres":"Action > Diagonal-down > Fighting > Crime","desc":"<p>Crime Life is a mission-based street combat game following a storyline involving multiple gangs, corrupt cops and betrayal from within.</p><p>The player controls Tre, a new member of the Outlawz gang on his rise to the top within the fictional city of Grand Central. The Outlawz face trouble as rival Headhunterz and KYC gangs join forces against them. The members of the rap band D12 feature their voices and likenesses as the key members of the enemy Headhunterz gang.</p><p>The gameplay is influenced by old school beat-em-ups, meaning hand-to-hand combat is the main focus here. As well as featuring twenty-five story-based missions, Crime Life also gives the player the freedom to explore the game world and to experience mini-missions that include fighting whilst drunk and taking control of rival turf.</p>"},{"name":"Crimson Sea","year":2002,"developer":"KOEI Co., Ltd.","url":"microsoft_xbox_c_part2/Crimson%20Sea%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6172858315,"score":7.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Sci-fi / futuristic","desc":"<p>Recently, an alien race called the mutons has been invading the solar system Theophilus. Like swarming bugs, the mutons threatened the very existence of the solar system. Enter Sho, a bounty hunter who uses a special weapon that can serve as a blade and as firearm at the same time. Starting as a subordinate, Sho quickly becomes the leader of a special squadron of soldiers that will use all its power to stop the muton invasion.</p><p><em>Crimson Sea</em> is a mission-based action game set in a distant future. In some cases, you can choose yourself the order in which you want to tackle the missions. Some of the missions have a time limit. Sho will encounter hordes of mutons and battle ferocious muton bosses. He can find and attach various upgrades to his custom weapon that allow new attacks. He also uses \"neo-psyonic powers\", which work pretty much like magic spells. There are slight role-playing elements in the game: it is possible to buy weapons, weapon upgrades, and items in stores, and weapons can gain experience points when continuously used in battles.</p>"},{"name":"Crimson Skies: High Road to Revenge","year":2003,"developer":"FASA Studio","url":"microsoft_xbox_c_part2/Crimson%20Skies%20-%20High%20Road%20to%20Revenge%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":6239074397,"score":8.4,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Flight / aviation","desc":"<p>Three years after the original Crimson Skies, FASA Studio brings the game to the Xbox in an adapted version (not a port). Set in an alternate 1930s world of gunship diplomacy and sinister intrigue, Crimson Skies: High Road to Revenge lets gamers pilot aircraft against nefarious air pirates and behemoth war zeppelins.  </p><p>You take the role of the daring air pirate Nathan Zachary, leader of the infamous Fortune Hunters. The high-flying adventure's single player campaign is filled with escapes, defense/escort missions and dogfights. You can take on friends over Xbox Live! as well.</p>"},{"name":"Crouching Tiger Hidden Dragon","year":2003,"developer":"LightWeight Co., Ltd.","url":"microsoft_xbox_c_part2/Crouching%20Tiger%2C%20Hidden%20Dragon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6677585547,"score":5.6,"genres":"Action > Behind view > Martial arts > Licensed","desc":"<p>Set in Qing dynasty of 19th Century China, this adaptation of the film of the same name follows the path of the characters Jen, Yu Shu Lien and Li Mu Bai. When warrior Li decides to retire from fighting, he gives his famous jade sword, The Green Destiny, to a nobleman. The weapon is stolen shortly afterwards, and he has to hunt down the thief with his friend Yu Shu Lien, while the sassy nobleman's daughter Jen keeps crossing their path.</p><p>The epic story has been split up in three parts, one for each character. The game mimics the film's famous martial arts, based on the Wudan fighting style, with a set of basic attacks, attack combos and special moves, combined with defensive actions such as basic blocking, combo blocking and evasion. While fighting, the characters learn new moves, collect items and earn rewards. Skills are improved according to your fighting style. Using specific attacks (e.g. unarmed) boosts the related skills, which can be leveled up.</p><p>There are different flavours of weapons to be collected, from axes to  swords, spears and sabers, and even exotic variants such as falchion, firangi or gloive. New ones can be acquired during battle, but enemies can pick them up as well.</p>"},{"name":"Crusty Demons","year":2006,"developer":"Climax Action Limited","url":"microsoft_xbox_c_part2/Crusty%20Demons%20%28USA%29.zip","filesize":6618646855,"score":5.4,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle > Off-roading","desc":"<p><em>Crusty Demons</em> is an extreme sports game based on the real-life stunt troupe of the same name. Motorized vehicles such as motorcycles and cars are used in performing tricks on ramps, half-pipes and over open areas. Large environments such as trailer parks and international cities like New York and Tokyo are available for the player to explore, do tricks and race.</p><p>The story of the videogame has the Crusty Demons meeting the Devil and agreeing to sign over their souls if given immortality. However, the Crusty Demons want to renege on the deal once they find out that they can still feel pain when fatally injured. The Devil, not without mercy, agree to offer back their souls on the condition that the Crusty Demons follow his every order and fulfill his demands for whatever stunt he asks of them.</p><p>Whenever a stunt goes fatally wrong, the games rag doll engine rewards the player with a graphic simulation of the collision or bail. This is also conjoined with the appropriate blood splatter on the screen as well as x-rays that show whichever bones have broken. Unlockables consist of pictures of \"babes\".</p>"},{"name":"CSI: Crime Scene Investigation","year":2004,"developer":"369 Interactive","url":"microsoft_xbox_c_part2/CSI%20-%20Crime%20Scene%20Investigation%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6436729966,"score":6,"genres":"Adventure > Compilation > 1st-person > Puzzle elements > Crime > Detective / mystery > Licensed","desc":"<p>This game is named for and based upon the CBS television series CSI. This Xbox version incorporates all 10 cases from the first two PC Windows games: CSI: Crime Scene Investigation and CSI: Dark Motives.</p><p>Solve intriguing crime cases as a member of the Las Vegas police force and work in the same settings and atmosphere as the show. Interactive parts are voiced by the actors and actresses from the series.</p><p>High-tech equipment and tools are at your disposal and must be used in combination with your wits, intuition and common sense. During your investigation you will question witnesses and suspects, find evidence and clues and discover motives to make an arrest.</p>"},{"name":"Curious George","year":2006,"developer":"Monkey Bar Games","url":"microsoft_xbox_c_part2/Curious%20George%20%28USA%29.zip","filesize":6628394511,"score":6.3,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Curious George</em> is a platformer based on the animated movie of the same name. Ted Shackleford, a human with a big yellow hat, visits Africa in search of an idol. This project does not work out, but he finds a new friend: the monkey Curious George. The game follows their way back to America and shows scenes from the movie as cutscenes.</p><p>During the thirteen linear levels, the player takes control over George. The majority of time is spent with platform challenges which usually involve jumping or swinging over gaps. Frequently the levels are interrupted by mini-games, Those involve simple tasks, for example, rhythm sequences (pressing given buttons with the correct timing) or arcade sequences. Optionally the player can collect bananas on the way and receive special points by interacting with certain objects. Those are used to unlock bonus content: the cutscenes and mini-games already experienced during regular play as well as a few hats for George to wear.</p>"},{"name":"Curse: The Eye of Isis","year":2003,"developer":"Asylum Entertainment Ltd.","url":"microsoft_xbox_c_part2/Curse%20-%20The%20Eye%20of%20Isis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":6736261129,"score":6.5,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Shooter > Horror","desc":"<p>Someone has stolen an artifact from the British Museum - a sacred (and CURSED) Egyptian statuette called the \"Eye of Isis\". You are called in to investigate its disappearance, find and return it to the pyramid where it once resided. The deadly curse must be stopped, and time is of the essence!</p><p><em>Curse: The Eye of Isis</em> is a horror action game. Choose to play either Dr. Darien Dane or his assistant, Victoria Sutton. Each character has different scenarios to complete to reach the same objective. Travel to seven different locations, battling undead monsters (zombies, mummies, etc. and their bosses) as well as animated deadly objects. Locate and use a variety of weapons including a shotgun, rifle, pistol, truncheon, crossbow, flame-thrower and mortar gun. Find clues, characters and puzzles to help you discover the location of the sacred statue.</p><p>During the game, realtime 3D cut scenes, interactions with NPCs as well as visual and audio messages provide more information to advance the story line. Gameplay is in 3rd person with action scenes reverting to 1st person.</p>"}]