[{"name":"Da Vinci Code, The","year":2006,"developer":"The Collective, Inc.","url":"microsoft_xbox_d_part1/Da%20Vinci%20Code%2C%20The%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6482537032,"score":5.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Stealth > Detective / mystery > Licensed","desc":"<p><em>The Da Vinci Code</em> game is based on the movie directed by Ron Howard which is in turn based on Dan Brown's best selling novel The Da Vinci Code. In this third-person action-adventure game, players have to solve riddles, fight enemies, escape in high-speed car chases and in the meantime unraveling a murder and an ancient secret.</p><p>Harvard professor Robert Langdon is in Paris for a meeting with a curator of the Louvre. When he arrives, it turns out the curator is dead. With his own blood, he has written a cryptic message. French cryptographer Sophie Neveu arrives and they team up to solve the murder and discover that Leonardo Da Vinci has left clues to a secret in his paintings. This leads them to uncover a millennia-old conspiracy. A secret society tries to stop them from doing so.</p>"},{"name":"Daemon Vector","year":2004,"developer":"XPEC Entertainment Inc."},{"name":"Dai Senryaku VII: Modern Military Tactics","year":2003,"developer":"SystemSoft Alpha Corporation","url":"microsoft_xbox_d_part1/Daisenryaku%20VII%20%28Japan%29.zip","filesize":6791131744,"score":7.1,"genres":"Strategy > Top-down > Turn-based","desc":"<p>Dai Senryaku VII: Modern Military Tactics is a Turn Based Strategy game (TBS). The game has a generic story line, in that the player is not referred to as a specific country, but as a color in Mission Mode. The game allows the player to fight over several different maps with different objectives choosing from several hundred units. The title is multiplayer, up to 4 people and has a map editor. </p><p>The player can build, disband, and join units, and save units that have gained experience at the end of battle. Everything from submarines, numerous aircraft, naval ships, apc's, and infantry are available to the player for use in the game. In Free Play mode, the player can choose between several countries, including the USA, Israel, Germany, China, Japan, and more. The player can only create units during a game that are associated with that specific country. </p><p>In addition to keeping track of the fuel supply, the player must also gain funds by taking over cities to support the army, as well as supply the vehicles with weapons and fuel. The game also has well over 70 maps to play and some that are based on real world situations.</p>"},{"name":"Dakar 2: The World's Ultimate Rally","year":2003,"developer":"Acclaim Studios Cheltenham","url":"microsoft_xbox_d_part1/Dakar%202%20-%20The%20World%27s%20Ultimate%20Rally%20%28USA%29.zip","filesize":6525978599,"score":6.5,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Motorcycle > Off-roading > Licensed","desc":"<p>Dakar 2 is a racing game, of course simulating the famous Paris-Dakar Rally. Although not the real 6000 kilometers can be crossed in the game, the rally mode takes the player through 12 tracks all the way from France to Dakar. The tracks lead racers through cities, forests, and the desert. Most of them are simple tracks, but there are desert tracks where the player can drive around freely, finding the checkpoints faster than the opponents. The player can choose from the officially licensed cars, trucks, and bikes from Dakar 2002, but only vehicles of the same type can compete in a race. There is also an arcade racing mode, where all the tracks and vehicles that have been unlocked in rally mode can be selected, as well as a split-screen mode for two players.</p>"},{"name":"Dance Dance Revolution: Ultramix","year":2003,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_d_part1/Dance%20Dance%20Revolution%20Ultramix%20%28USA%29.zip","filesize":6661260842,"score":7.8,"genres":"Action > 3rd-person (Other) > Video backdrop > Music / rhythm","desc":"<p>In DDR, the player stands on a pad with four arrows: up, down, left, and right. As arrows on screen collide with grey arrows at the top of the screen, you hit the corresponding arrow on the mat. This version includes:</p><p>Shiny Disco Balls by Who Da Funk</p><p>Put Your Faith In Me (Saturday Night Mix) by Uzi-Lay</p><p>Sana Mollete Ne Ente by The Togo Project Feat. Sana</p><p>And more!</p>"},{"name":"Dance Dance Revolution: Ultramix 2","year":2004,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_d_part1/Dance%20Dance%20Revolution%20Ultramix%202%20%28USA%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6505699917,"score":7.5,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>This game is similar to other \"DDR\"s. There are 4 arrows on-screen: Up, Down, Left, Right. You stand on a mat, and stomp on those arrows in time to music, getting graded as you go and at the end of the song. Songs include:  </p><p>Macho Gang by Anal Spyder  </p><p>Love Heart; Shine by Riyu Kosaka  </p><p>Brick House by The Commodores  </p><p>Rubberneckin' by Elvis  </p><p>And many more.</p>"},{"name":"Dance Dance Revolution: Ultramix 3","year":2005,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_d_part1/Dance%20Dance%20Revolution%20Ultramix%203%20%28USA%29.zip","filesize":6622911023,"score":7.3,"genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p>The third edition of DDR Ultramix, the title of DDR for XBOX, brings new features like new game modes as the Freestyle, Quest mode or Jukebox mode:</p><ul><li>Freestyle: allows players to dance just the way they want to any song in the game, while rewarding the completion of different combinations</li><li>Quest Mode: lets players travel “virtually” from city to city and build the ultimate dance team by completing challenging songs and routines along the way</li><li>Jukebox Mode turns your Xbox into a music machine allowing to listen the 65 default tracks and the downloables</li></ul><p>Additionally, this edition includes 65 new songs (more knew, at least in EU) but DDRU3 is compatible with the downloaded song pack for the first and second part making more than 125 songs in total.</p><p>Of course, the old game modes are present and you can still play the workout mode to make extra exercise or edit your songs to custom your playing. You can play trough Xbox Live until 4 ppls.</p><p>Added the new features, this game improves the graphics, having now more 3D in view during songs.</p>"},{"name":"Dance Dance Revolution: Ultramix 4","year":2006,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_d_part1/Dance%20Dance%20Revolution%20Ultramix%204%20%28USA%29%20%28En%2CFr%2CEs%29.zip","filesize":6546235549,"score":7,"genres":"Action > 3rd-person (Other) > Arcade > Music / rhythm","desc":"<p>Dance Dance Revolution Ultramix 4 is the fourth game in the series to appear on the Xbox. The mechanics are the same as they have always been: step on arrows on a dance mat in time with arrows on the screen. The soundtrack has more variety than previous entries in the series and has quite a few licensed tracks. There are various modes available including arcade, practice and workout. Also in this entry is a quest mode which gives you a career-type series of dances to earn money.</p>"},{"name":"Dance:UK","year":2004,"developer":"Broadsword Interactive Limited","url":"microsoft_xbox_d_part1/Dance-UK%20%28UK%29.zip","filesize":6763152125,"score":"","genres":"Action > 3rd-person (Other) > Music / rhythm","desc":"<p><em>Dance:UK</em> takes the standard 'bemani' formula - arrows appear rhythmically on screen and the player must hit the corresponding button (on either a dance mat peripheral or the standard controller) in time with these arrows and the music. Points are awarded for accuracy with extras for making certain 'combos' (mini-routines within a song which are deemed especially difficult or long).</p><p>The PS2 and XBOX version of the game have over thirty tracks (around 20 of which are famous/original) by artists including Misteeq, Run D.M.C, Liberty X, Sugababes, Room 5, Sophie Ellis Bextor, Chic, The Trammps, 5ive, Junior Senior, Las Ketchup and DJ Sammy, while the Playstation version has a reduced twenty song tracklist.</p><p>There are initially three difficulty levels, and the player can either practice one song at a time (in Jukebox mode) or enter the Dance:UK Championship, winning which will unlock a 'Dance Recorder' mode in which players can record their own dance routines. In multiplayer up to 8 players can compete in succession or 2 players can compete head-to-head.</p><p>A karaoke mode is also provided for use with a wireless microphone (sold separately) whilst 'Aerobic' Mode calculates the number of calories you've burnt during play.</p>"},{"name":"Dark Summit","year":2001,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_d_part1/Dark%20Summit%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6480636473,"score":6.8,"genres":"Sports > Behind view > Tricks / stunts > Snowboarding / skiing","desc":"<p>The military has mysteriously closed the summit of Mt. Garrick, and Chief O'Leary is trying desperately to drive snowboarders off the mountain.</p><p>Dark Summit is a twist on the snowboarding genre.  Instead of trying to pull off insane tricks, you'll be completing various missions, such as \"Find the Bomb\" and \"Destroy the Cannon\".  Pulling off tricks earns you points to buy new equipment.</p>"},{"name":"Darkwatch","year":2005,"developer":"High Moon Studios, Inc.","url":"microsoft_xbox_d_part1/Darkwatch%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5860780644,"score":7.7,"genres":"Action > 1st-person > Shooter > Steampunk > Horror","desc":"<p>The Darkwatch is an ancient organization hell-bent on destroying evil in the world. They have just captured the vampire lord Lazarus and are transporting him back to headquarters for questioning, when an outlaw tries to rob the train and instead of finding riches releases Lazarus from his hold, but not before the outlaw is bitten by the vampire lord. As Jericho Cross, the former outlaw and now the newest member of the Darkwatch, you must find and kill Lazarus, lest you turn into a full-blown vampire yourself.</p><p>Darkwatch is a first-person shooter set in the Wild West with supernatural beings. Fight your way through reapers, undead riflemen, banshees and other creatures using Darkwatch weaponry that doubles as melee weapons, such as a revolver, two-fisted pistols, a crossbow (with dynamite attached to the bolts) and a Rail Rocket. You will also find dynamite along the way to throw at the enemy and to destroy barricades. Along with conventional weapons, Cross will acquire vampire powers of good or evil nature that you must choose in the story. If you decide to be good, then you receive powers such as Silver Bullet that increases your shots with holy fire or Vindicator that calls down chain lightning on your enemies. If you choose to be evil, you will receive Blood Frenzy that makes melee attacks supernaturally powerful and Soul Stealer, which sucks the very souls from distant enemies. Regardless of good or evil, you will always have Blood Shield (protection from losing health), Vampire Jump (for those hard to reach areas) and Blood Vision (causes enemies, weapons and other important objects to glow). With every creature killed, there will be at least one Blood Cloud and sometimes more to replenish your health and restore your Vampire Powers.</p><p>In single player you can choose from story mode (follow the story of Jericho Cross one chapter at a time) or Gunslinger mode (replay any level unlocked in story mode as either evil or good). At the end of the level, you see your number of kills and accuracy percentage, which, if it is good enough, will unlock some movies and concept art.</p><p>Play on-line over Xbox Live with up to 16 players or up to 4 people in split-screen mode. Multiplayer matches include Death Match, Team Death Match, Capture the Flag, Soul Hunter (fight to collect Blood Clouds and be the first to fill your Blood Bar) and Team Soul Hunter. You can adjust the settings for each match regarding the game type, map in which you wish to play, total time play, score limit and kill limit.</p><p>In the main menu, you can choose Extras to view concept art unlocked from playing Gunslinger Mode, movies from Story Mode and your statistics from Story Mode and Gunslinger Mode.</p>"},{"name":"Dave Mirra Freestyle BMX 2","year":2001,"developer":"Z-Axis, Ltd.","url":"microsoft_xbox_d_part1/Dave%20Mirra%20Freestyle%20BMX%202%20%28Europe%29.zip","filesize":6693312357,"score":7.5,"genres":"Sports > Behind view > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Dave Mirra returns along with 14 pro riders including Ryan Nyquist, Mike Laird, and Collin Mackay. 8 levels are on offer, with a total of 1,500 tricks to master. You can create your own BMX park thanks to the Park Editor mode. And while you attempt to master the tricks, you can listen to the soundtrack featuring Ozzy Osbourne, The Cult, Methods of Mayhem, Godsmack, and Rage Against the Machine (all except Game Boy Advance version).</p>"},{"name":"David Beckham Soccer","year":2002,"developer":"Rage Games Ltd.","url":"microsoft_xbox_d_part1/David%20Beckham%20Soccer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4797121368,"score":6.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>Endorsed by the then England and Manchester United captain and international superstar, David Beckham Soccer is the last of Rage long tradition in developing soccer games.It includes both national and club teams (from England, France, Germany, Italy and Spain), plus the ability to create custom teams,  with details ranging from the usual name, strips and colours to the stadium. Other than Beckham himself, no player is licensed (likeness is preserved, but names are replaced with phonetic equivalents, such as “Owin” or “Zanetee”), but the editor also allows the player to customize each player and team.Game modes include friendly, club season, several international cups (including the defunct Home Championship), Classic Matches (some featuring the highlights of Beckham's career, others just classic matches), Beat Brazil, where the player starts with France, and tries to beat Brazil with a progressively weaker team, Survival, where the player face top international teams, with goals against carrying over, until the player loses a match, and Train With Beckham, a series of  drill minigames destined to teach the basics of the game and unlock “secrets”. </p><p>Gameplay is similar to previous titles developed by the company (most notably Microsoft Football 2000 and UEFA Striker), and not unlike Beckham, has its strong point during dead ball situations, where the player can choose either to use a set play to get the defense offguard, or take a direct shot or swerving pass using the traditional arrow indicator.In terms of options, the game doesn’t offer much to tweak, only bookings, offsides, injuries, match length and the decider (simple or golden goal overtime and penalty shootout)</p>"},{"name":"Dead Man's Hand","year":2004,"developer":"Human Head Studios, Inc.","url":"microsoft_xbox_d_part1/Dead%20Man%27s%20Hand%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6320935337,"score":6.4,"genres":"Action > 1st-person > Shooter > Direct control > Western","desc":"<p>The Mexican gunslinger El Tejon once joined the dreaded Nine gang, hoping to become rich and famous. However, as he became disillusioned with the gang's murderous ways and distanced himself from it, he turned into a liability to the criminals. The gang's leader shot him and left him for dead; barely surviving, El Tejon was imprisoned by the authorities. In the prison, he meets a member of a revolutionary movement, and becomes determined to regain his freedom and exact revenge upon those who betrayed him.</p><p><em>Dead Man's Hand</em> is a first-person 3D shooter set in the Wild West. The protagonist is armed with a fairly standard arsenal, which includes pistols, rifles, shotguns, TNT, bombs, etc. The game rewards the player for precise shooting and creative ways of killing enemies (e.g. by shooting a rock that drops on them): as the player practices these activities, the protagonist's \"trick meter\" is being gradually refilled. A full trick meter allows secondary shooting mode, unique for each weapon. Between levels the player can compete in poker to increase the protagonist's health and ammunition.</p>"},{"name":"Dead or Alive 3","year":2001,"developer":"Team Ninja","url":"microsoft_xbox_d_part1/Dead%20or%20Alive%203%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6411403036,"score":8.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p><em>Dead Or Alive 3</em> is a fighting game exclusive to the Microsoft Xbox. It features 16 characters (3 of them new), hidden extras, specular lighting effects, volumetric fog and grass, clothing and muscle movement that accurately responds and interactive environments.</p><p>Up to four players can fight in <em>DoA3</em>'s Tag Battle mode.</p>"},{"name":"Dead or Alive: Ultimate","year":2004,"developer":"Team Ninja","url":"microsoft_xbox_d_part1/Dead%20or%20Alive%201%20Ultimate%20%28Europe%29.zip","filesize":5471138544,"score":8.1,"genres":"Action > Compilation > Fighting","desc":"<p><em>Dead or Alive Ultimate</em> features the original SEGA Saturn version of Dead or Alive as well as a totally redesigned Dead or Alive 2 along with more costumes and more features including the addition of Live! support so the player can take their fight online.</p>"},{"name":"Dead or Alive: Xtreme Beach Volleyball","year":2003,"developer":"Team Ninja","url":"microsoft_xbox_d_part1/Dead%20or%20Alive%20Xtreme%20Beach%20Volleyball%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6289332250,"score":6.8,"genres":"Gambling > Sports > 3rd-person (Other) > Direct control > Volleyball","desc":"<p><em>Dead Or Alive: Xtreme Beach Volleyball</em> takes all the female fighters from Dead Or Alive 3, sends them to a tropical island named <em>Zack Island</em>, and pits them in volleyball matches.</p><p>At the outset, you choose from one of eight characters, all female. When you first play the game, the new character, Lisa, introduces you to a few aspects, and joins you for your first volleyball match. All matches are two-on-two, with the first team to seven being the winner.</p><p>Each day is comprised of four sections; morning, day, evening, and nighttime. There are several different areas you can visit; separate beaches and jungles to challenge different teams, an accessory shop, where you can buy accessories such as sunglasses, a sporting shop where you can buy new bikini's, a store called \"Zack of all Trades\" where you can buy miscellaneous items, such as a gun, lipstick, lotion, etc., a radio station, where you can select what soundtracks to listen to, or listen to your own, and the hotel, where each day ends.</p><p>Once nighttime comes around, you can visit the casino. Once there, you can play one of four games; Blackjack, Poker, Roulette, or Slots. Playing games can earn you money, but can also strip you of money.</p><p>There is a large variety of items to collect, and some items you must buy to entice someone to join your team. If a character's favorite color is black and her hobbies include cars, then you would buy them a black steering wall to pursuade them to join you.</p><p>Volleyball matches earn you money (if you win) and consist of three basic moves; serve, spike, receive. If you lose too many games, you're partner may ditch you. Win enough and her loyalty will increase.</p><p><em>XBV</em> includes a multiplayer feature that lets you play against a friend.</p>"},{"name":"Dead to Rights","year":2002,"developer":"Namco Hometek Inc.","url":"microsoft_xbox_d_part1/Dead%20to%20Rights%20%28USA%29.zip","filesize":6203997069,"score":7.2,"genres":"Action > Behind view > Mini-games > Shooter > Direct control > Detective / mystery > Regional differences","desc":"<p><em>Dead to Rights</em> is a 3rd-person shooter in which the player is Jack Slate, a police officer in Grant City. On a routine call, he finds the dead body of his father. While trying to find the murderer, he is framed for another murder. Jack becomes a fugitive; his run from the law will take him to various places, from strip joints and hotels to office complexes, and even prison, as an inmate.</p><p>When controlling Jack, players can perform various moves, such as grabbing an enemy from behind and using him as a human shield, or tossing a fire extinguisher and shooting it, causing a huge explosion. If Jack does not have a gun drawn, he can disarm an enemy which causes him to steal the enemy's gun, then performing some sort of finish, such as a neck breaker. Initially, only a few disarm moves are available, but more can be unlocked as the game progresses.</p><p>Players will sometimes have to control Jack's best friend and partner, his K-9 dog Shadow, which allows enemies to be killed from a distance. In addition, Shadow will fetch their guns and bring them to Jack.</p><p>The game also features \"adrenaline combat\", similar to \"Bullet Time\" from Max Payne. Jack will then perform slow-motion dives and spins, giving him an advantage, as long as his adrenaline meter holds out.</p>"},{"name":"Dead to Rights II","year":2005,"developer":"Widescreen Games SARL","url":"microsoft_xbox_d_part1/Dead%20to%20Rights%20II%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6763038072,"score":5.8,"genres":"Action > Behind view > Beat 'em up / brawler > Shooter > Direct control > Contemporary > North America > Crime","desc":"<p>Jack Slate is back, in this beat-up sequel to the first. He teams up with his K9 Dog, Shadow, to overtake the criminal underground in Grant City. The main focus of the game is on Jack taking down crime after the kidnapping of a judge. He discovers a city full of corruption and betrayal.</p><p>Included is a 360 degree fighting system. Returning to the game is the super slow motion that was originally employed in  Max Payne games and The Matrix movie. You can now use Shadow to attack enemies in real-time while you beat down on other enemies. If his stamina bar is high enough, Slate's K9 will kill the enemy, and if he is tired, he'll work to keep any enemy away with vicious bites.</p><p>This game includes a lot of weapons including rocket launchers, grenades, and Molotov cocktails. The minigames are not essential to the game, whereas they were in the original game. However, most of the game is very similar to its predecessor.</p>"},{"name":"Deathrow","year":2002,"developer":"SouthEnd Interactive AB","url":"microsoft_xbox_d_part1/Deathrow%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6431747278,"score":7.2,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Sci-fi / futuristic","desc":"<p>Deathrow is a brutal fighting sport where the fastest, toughest players are victorious and the slow and weak are defeated. It combines the lightning-fast game-play of third-person action games, adrenaline rush of fighting games and the cooperative team play and gritty roughness of rugby, offering a unique game-play experience. The object of Deathrow is to win matches however you can, either by scoring as many points as possible before time runs out, or by severely injuring your opponents and removing them from the field of combat.</p>"},{"name":"Def Jam: Fight for NY","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_d_part1/Def%20Jam%20-%20Fight%20for%20NY%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6274615442,"score":8,"genres":"Action > Side view > 2D scrolling > Fighting > Wrestling > Licensed","desc":"<p><em>Def Jam: Fight for NY</em> is the sequel to the out-of-left-field Def Jam: Vendetta.</p><p>The game opens with the person you beat in the previous game, D-Mobb, being arrested. As the police are driving, an SUV comes out of nowhere and smashes into the car, setting D-Mobb free. After a quick cutscene, it turns out the person who was driving the SUV was you, and you have now joined D-Mobb's crew.</p><p><em>Fight for NY</em>'s story mode takes you through the ranks, and pits you against tougher and tougher fighters. You start off in D-Mobb's crew as a nobody and will have to work your way up, fighting off people from other crews, including D-Mobb's rival, Crow. You'll take part mostly in one-on-one brawls, with the odd team match and free for all thrown in.</p><p>To aid you in fighting, you can use the environment to hurt your enemy. You can smash people into wooden/cement walls, fences, or just whack them off of a wooden pillar. Speakers, soda machines, garbage cans... All there to harm your enemy (or you). Some objects are interactive, such as floodlights, which will change the lighting of the ring once someone's been thrown into them. You have weapons at your disposal, usually a metal pipe, pool cue, and a broken bottle.</p><p>The crowd also gets into the action, which can be good or bad for you. You can throw an enemy into a crowd and have them push him towards you; you can knock a stunned enemy into the crowd, and they will hold him down, giving you free shots; or you can throw an opponent into a part of the crowd holding a weapon, and they'll use the weapon against him.</p><p>There are five fighting styles available to you. There is Street Fighting, which focuses on punches; Kickboxing, which focuses on kick attacks; Martial Arts, which focuses on speed, running, and acrobatic attacks; Wrestling, which focuses on standard wrestling moves, like bodyslams; and Submissions, which focus on wearing down a specific part of the enemy until that limb is damaged enough to earn a submission.</p><p>In addition to Story mode, you have Battle mode, which allows you to play with up to four players in different types of matches.</p><p><em>Fight for NY</em> has lots of unlockables. Earning reward points from Battle matches, you can purchase new fighters or venues to fight in.</p>"},{"name":"Defender","year":2002,"developer":"7 Studios, Inc.","url":"microsoft_xbox_d_part1/Defender%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6705699170,"score":6.7,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Defender is an updated version of the classic arcade game of the same name. The Manti bugs have invaded earth and the remaining human survivors now live in colonies throughout the solar system. As more swarms of Manti arrive, even the colonies are now in danger of being wiped out. You've been enlisted to help save the remaining colonists and destroy the Manti bugs! There are a total of six different ships to fly, each with its own flight characteristics and special weapons. Weapon and shield power-ups can also be found throughout the various missions. As in the original version of Defender, the Manti will try to capture any humans they can find to change them into mutants to increase their attack force. To increase chances of success you will need to rescue captured humans before this happens and bring them to a safe landing zone. Saving colonists will also earn you some credits, which can later be used to buy improved weapons or shields for your ship. Also included are several video extras detailing the historical perspective of and the making of Defender.</p>"},{"name":"Delta Force: Black Hawk Down","year":2005,"developer":"NovaLogic, Inc.","url":"microsoft_xbox_d_part1/Delta%20Force%20-%20Black%20Hawk%20Down%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6235639972,"score":7,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Direct control > Africa > Contemporary > Historical events > Regional differences","desc":"<p><em>Delta Force: Black Hawk Down</em> is a first-person action game that takes place in Somalia, where the famous Mogadishu operation took place. The game is based on real events that were also depicted in a book and a movie \"Black Hawk Down\". First half of the game consists of varied missions that Delta Force soldiers had to engage into, like defending UN food convoys, rescuing hostages or destroying weapon shipments.</p><p>Second half of the game covers the events of the mission Irene on October 3rd, 1993. Its goal was to capture two lieutenants of the Somali warlord Mohamed Farrah Aidid and was expected to last less than 30 minutes, but after two Black Hawk helicopters were shot down, it took US soldiers more than 16 hours to return to safety. 18 US soldiers, 1 Malaysian and hundreds of Somalis were killed. A 19th SFC. Matt Rierson died two days later in an mortar attack.</p><p>On most missions the player works as a member of a small Delta Force team, working in co-operation with US Army Rangers or UN forces. Some missions include the player riding as a machine-gunner on a Humvee or a helicopter (including Black Hawks).</p>"},{"name":"Dennou Taisen DroneZ","year":2004,"developer":"Zetha Gamez BV","url":"microsoft_xbox_d_part1/Dennou%20Taisen%20-%20DroneZ%20%28Japan%29.zip","filesize":6490158050,"score":"","genres":"Action > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p><em>DroneZ XL</em> is a single-player futuristic shooter. The player is guiding a male or female avatar through a virtual reality, representing the future world for humans living in suspended animation vats while their bodies are being cared for by insects and their minds are prevented from leaving the virtual world by its dominant AI.</p><p>The task is for the character to jump/travel on discs representing memory bits in an organic computer, while avoiding wall mounted cannons, electrical fields and various aliens trying to stop you from escaping the virtual reality into the real world. The graphics are reminiscent of the movie <em>TRON</em> with a bright, neon style.</p><p>You travel from room to room in a somewhat confusing environment, sometimes on a one-way path, sometimes on alternate paths, with some guidance from a character described as a hacker, offering advice on what is up ahead. If you fail to defeat the obstacles in a room, you restart from the beginning of the room, or the one before. At some locations, boss fights occur whith larger enemies, requiring you to hit them in weak spots, or using special power-ups to defeat them.</p><p>The game was initially only available as a demo and benchmark for NVIDIA's GeForce 3 graphics card and it was shipped as a shorter OEM version with many GeForce3 cards, using the name <em>DroneZ</em> or <em>DroneZMark</em>. The full length game was released as <em>DroneZ XL</em> in Russia (PC) and <em>Dennou Taisen DroneZ</em> in Japan (Xbox).</p>"},{"name":"Destroy All Humans!","year":2005,"developer":"Pandemic Studio Pty Ltd","url":"microsoft_xbox_d_part1/Destroy%20All%20Humans%21%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6748503345,"score":7.2,"genres":"Action > Behind view > Sci-fi / futuristic","desc":"<p>Greetings earthlings! I, Cryptosporidium 137 of the Furon Empire, happened upon your planet on the way back from destroying the martians. Due to some experiments with atomic weaponry, we lack genitalia and the quality of our clones has degraded. Since you pathetic humans all carry Furon DNA in your genetic code, I have been instructed to collect fresh samples. Survival is not an option, but you should be honoured to support the legacy of the Furon Empire!</p><p><em>Destroy All Humans!</em> is a humorous action game with winks to the era of the goofy fifties' sci-fi movies. Crypto can hypnotize and scan people, and lift objects using psychokinesis. He can also control humans using the Hypno Blast to impose his commands. Extracted DNA can be exchanged in your mothership for new weapons and ability upgrades. Furon weaponry includes a Zap-o-Matic, disintegrator ray, abducto beam, quantum deconstructor and even the famous anal probe. Not to be overpowered, you have to disguise yourself using the Holobob. There are different alert levels, similar to the Grand Theft Auto games and if you are not careful, you will be hunted down by the police, military or the government.</p><p>You are constantly in contact with the mothership, where you can purchase upgrades, save the game and apply for new missions. Crypto does not have to run all the time, he can also use his flying saucer to abduct humans or animals, cause havoc or face bigger threats. Next to the story-based missions, you will also be instructed to collect specific samples or kill a certain amount of humans in a race against time.</p>"},{"name":"Destroy All Humans! 2","year":2006,"developer":"Pandemic Studio Pty Ltd","url":"microsoft_xbox_d_part1/Destroy%20All%20Humans%21%202%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6591882178,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Direct control > Sci-fi / futuristic","desc":"<p>Our \"hero\", Crypto 137, is back. Earth is under attack again in another alien invasion. The setting is now the 1960s. You go around hunting Humans with your Zap-o-Matic, Ray Gun, or brand new weapons. Occasionally, there are probing missions where you can hypnotize a Human to do something to carry out your plans for the Furon Empire. There are also missions where you trick humans into being abducted by your ship. </p><p>Crypto also has new weapons: the Dislocator, a gun that shoots purple discs and grabs anything (including tanks) to beat them up; the Meteor Strike, a gun that can rain down meteor showers upon the enemy... and another gun called Gastro, which is a hologram on a hovership that helps out Crypto. </p><p>The side quests have fleshed-out stories now; in addition, there are cult missions where you convince humans to worship an Alien God. A Co-op mode has also been added. The entire game can be played through on a split-screen and the second player can join in or out of the action at any time through the pause menu.</p>"},{"name":"Deus Ex: Invisible War","year":2003,"developer":"Ion Storm Austin","url":"microsoft_xbox_d_part1/Deus%20Ex%20-%20Invisible%20War%20%28Europe%29.zip","filesize":6312595039,"score":7.4,"genres":"Action > 1st-person > Shooter > Stealth > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>Twenty years have passed after the events described in Deus Ex. The actions of JC Denton have eventually led to a period of economic depression, known as \"The Collapse\". The world is on the brink of chaos after the dismantling of the mighty biotech corporations, and multiple religious and political groups lust after power. </p><p>The city of Chicago is destroyed in a devastating energy blast by unknown terrorists. Two trainees of the Tarsus Academy, Alex D and Billie Adams, are evacuated to another Tarsus-controlled facility in Seattle. Shortly thereafter the facility is attacked by members of a religious organization called the Order. Billie admits that she has been collaborating with them, implying that Tarsus may be involved in a conspiracy. It is now up to Alex to find his or her place in the new world, and ultimately shape its fate.</p><p><em>Deus Ex: Invisible War</em> is a first-person shooter that retains many gameplay elements of its predecessor, such as conversations with characters, inventory management, exploration, and mixing various gameplay styles during missions. As in the original game, the style of play helps shape the game as it progresses, from how characters interact with the protagonist to the types of situations encountered. Each potential conflict can be resolved in a number of ways, through peaceful means or through violence, using stealth or a show of force. Hacking computer terminals and unlocking doors with special tools are prominently featured.</p><p>Weapons can be modified in a variety of ways, e.g. increasing their rate of fire, silencing the shots, allowing the weapon to shoot through glass, etc. Characters can once again outfit their bodies with an array of biotech parts, some of which include the ability to see through walls, disappear from radar, regenerate from critical hits, or jump forty feet in the air. Unlike the previous installment, there are no true role-playing elements in the game. The player must search for biotech canisters to install and upgrade biomods; however, no experience points are awarded for either completing missions or dealing with enemies. Inventory management has been simplified as well.</p><p>The sequel places more emphasis on decisions and different approaches to missions. From the beginning of the game the player has the freedom of performing missions for organizations and people of his or her choice. Like in the first game, several endings can be reached depending on the player's decisions.</p>"},{"name":"Die Hard: Vendetta","year":2003,"developer":"Bits Studios Ltd.","url":"microsoft_xbox_d_part1/Die%20Hard%20-%20Vendetta%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6111499209,"score":6.3,"genres":"Action > 1st-person > Shooter > Licensed > Regional differences","desc":"<p>John McClane is back. Many years have passed since his work in New York, and he now works for the Century City Police Department (CCPD) in Los Angeles.</p><p>You are in John's shoes as he must face a new threat. Piet Gruber, the son of Hans Gruber and McClane's old enemy, is up to no good at the Townsend Art Museum. He has stolen valuable art and kidnapped John's now-adult daughter and fellow CCPD police officer, Lucy.</p><p>This game is a First Person Shooter, but it also adds two features: Stealth Mode and Hero Time. Stealth Mode allows John to sneak around quietly, even being able to grab his foes and use them as hostages. This means it may not be best to go in guns blazing when they could be arrested. Hero Time allows John to react far more quickly, just like Bullet Time in Max Payne. Hero Time is earned by saving hostages and performing heroic tasks in the game.</p><p>There are several different weapons available in the game, ranging from a paintball gun for training to a sniper rifle. Most of the guns can also be used dually for the ultimate killing spree.</p>"},{"name":"Digimon Rumble Arena 2","year":2004,"developer":"Black Ship Games","url":"microsoft_xbox_d_part1/Digimon%20Rumble%20Arena%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6351947839,"score":6.8,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Platform > Martial arts > Licensed","desc":"<p>Pick your favorite Digimon and battle your way to the top in this arena-style fighter based on characters from the Digimon TV show.  You can play through various interactive (and dangerous) arenas for the championship, or you can rumble with your friends in 2-4 player multiplayer mode.  Collect pickups and learn special moves to gain the advantage over your friends, and for the ultimate upgrade, you can evolve (Digi-volve) into bigger and better versions of yourself.</p>"},{"name":"Digimon World 4","year":2005,"developer":"BEC Co., Ltd.","url":"microsoft_xbox_d_part1/Digimon%20World%204%20%28USA%29.zip","filesize":6289919637,"score":6.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Action RPG > Fantasy > Licensed","desc":"<p><em>Digimon World 4</em> is the second <em>Digimon</em> game for the GameCube, PlayStation 2 and Xbox consoles. Instead of a standard RPG like the previous games, it has action RPG gameplay with hack-and-slash and supports up to four players. It also contains elements of digital pet games where creatures can be trained to level up. It is loosely based on the events in the <em>Digital Monster X-Evolution</em> animated film. You can choose between Dorumon, Veemon, Guilmon, and Agumon as the playable characters. They are members of the Digital Security Guard and their mission is to save the DigiWorld from a computer virus, called X-virus, that invaded their world.</p><p>The Digimon can go through a digivolution based on a number of parameters. Magic skills are upgraded through training. There are several types of magic and each one has its own elements, type, and level. There are three difficulty levels: medium, hard, and very hard.</p>"},{"name":"Dino and Aliens","year":2005,"developer":"NevoSoft LLC"},{"name":"Dino Crisis 3","year":2003,"developer":"Hit Maker, Inc.","url":"microsoft_xbox_d_part1/Dino%20Crisis%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6407754996,"score":5.3,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Survival horror > Sci-fi / futuristic","desc":"<p><strong>Dino Crisis 3</strong> is the third game in the <em>Dino Crisis</em> series, and this time, it's futuristic.</p><p>The year is 2548. The colonist spaceship Ozymandias, which disappeared over 300 years ago, suddenly reappears, with no warning or reason to it's disappearance. Attempting to contact the ship results in nothing. The Interstellar Fleet Commander sends out the Special Operations and Reconnaissance (SOAR) squadron to investigate. Their shuttle is destroyed by a merciless and unknown assailant. Everyone manages to survive, and reach the ship intact. What they encounter is something they never would've thought of.</p><p>As Patrick, the leader of SOAR, you are tasked with exploring the ship, putting the pieces together, and rescuing any survivors you can find. The ship you are on, the Ozymandias, is a dynamically changing structure, which enables you to move hallways and re-position doors so that you can access new areas all the time.</p><p>During your search, you'll have to battle a number of various dinosaurs, from Raptors to the terrible Tyrannosauras Rex. Luckily, you have a variety of weapons at your disposal, from standard firearms and shotguns to sophisticated laser and beam-guided rifles. You may also find and use Wasps; little robotic bee-shaped critters that can attack enemies or open doors and other devices.</p><p>To aid you, you are equipped with a jetpack that you can use at any time to hover or speed through areas. It may also be used when in a tense firefight, taking the battle to the air. Many dodging and evading techniques are possible with the use of the jetpack.</p><p>Like the second game, Dino Crisis 2, you are awarded points for every dinosaur you kill. Kill some in rapid succession, you'll earn more points and double them as well. With enough points, you can buy new weapons, ammo, and health items at various terminal stations scattered throughout the ship.</p><p>With the aid of three of your best crew, find the survivors, figure out what the hell happened, and most importantly, get off the ship before you become dino dinner.</p>"},{"name":"Dinotopia: The Sunstone Odyssey","year":2003,"developer":"Vicious Cycle Software, Inc.","url":"microsoft_xbox_d_part1/Dinotopia%20-%20The%20Sunstone%20Odyssey%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6527740670,"score":6.1,"genres":"Action > Behind view > Flight / aviation > Mecha / giant robot > Fantasy > Licensed","desc":"<p><em>Dinotopia: The Sunstone Odyssey</em> is a 3D action game based on the Dinotopia books. The island of Dinotopia is a place where humans and sentient dinosaurs live side by side. The peace however is disturbed by a group known as the outsiders.</p><p>The player takes control of Drake Gemini who is to be the guardian of Dinotopia. Gameplay includes weapon-based combat, puzzle-solving as well as flying on a flying dinosaur, and operating a mechanical dinosaur-like machine. You fight a variety of human and dinosaur foes as you unravel the story through the 24 levels of the game.</p>"},{"name":"Disney Pixar Cars","year":2006,"developer":"Rainbow Studios, Inc.","url":"microsoft_xbox_d_part2/Disney-Pixar%20Cars%20%28Europe%29.zip","filesize":6479505997,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Motion control > Automobile > Off-roading > Track racing > Fantasy > Licensed","desc":"<p><em>Cars</em> is a racing game, based on the movie of the same name, that allows the player to explore the world of Radiator Springs and surrounding areas in an open world mission-based structure. The story revolved around racing rookie Lightning McQueen, who wants to become a famous racer and compete in the Piston Cup, the equivalent of NASCAR races. You can roam freely, talk to other characters, and accept race challenges to advance the story.</p><p>There are over 20 Road Races to choose from in the Story Mode as well as 5 Piston Cup Races and additional mini-games. The player is awarded bonus points in the Story Mode that can be used to unlock bonus content material such as boost abilities, new racers (10 in total), new environments, and mini-games, such as an obstacle course or a military training event. The game also features an Arcade Menu that allows quick access to races unlocked from Story Mode as well as a VS. Mode where the player can compete head-to-head.</p>"},{"name":"Disney Pixar Finding Nemo","year":2003,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_d_part2/Disney-Pixar%20Finding%20Nemo%20%28Europe%29.zip","filesize":6688528766,"score":6.5,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Guide Nemo and Marlin through their underwater adventure. Meet all of the characters from the Disney/Pixar movie, <em>Finding Nemo</em>, as you live all of the film's storyline. The search for Nemo is on, and it is up to you to find him. Dive in!</p><p>Features:* Live the film through the game and help reunite Nemo and his father Marlin.</p><ul><li>Over 15 levels of action and adventure with multiple unlockable mini-games in each level.</li><li>Play as all 3 of the main characters from the film: Nemo, Marlin, and Dory.</li><li>3-D underwater environments.</li><li>Interact with all the characters from the film including Bruce, Crush, and the Tank Gang.</li><li>Features film clips that capture the essence of the movie.</li></ul>"},{"name":"Disney Pixar Ratatouille","year":2007,"developer":"Asobo Studio S.A.R.L.","url":"microsoft_xbox_d_part2/Disney-Pixar%20Ratatouille%20%28USA%29.zip","filesize":6736598726,"score":6.5,"genres":"Action > 3rd-person (Other) > Platform > Licensed","desc":"<p><em>Ratatouille</em> is based on the Pixar film of the same name. The version by Asobo Studio is, like other versions, a 3D platform game, but has its own design, levels and missions.</p><p>The game follows the plot of the film only loosely, but has the main voice cast from the movie reprising their roles. The player controls Remy, a rat with a refined sense of taste. When Remy finds himself in Paris near the restaurant of the famous deceased chef Gusteau, he works on making his dream of becoming a chef himself come true, while helping out his fellow rats to procure food.</p><p>While many of the environments in the game are similar to those in the next-generation version, this version has almost none of the open world elements seen in the other title, with smaller levels and mostly linear progress. To get around in the various levels that include the sewers, streets and rooftops of Paris, the restaurant kitchen and a food market, Remy can jump and double-jump, swing along poles, balance on ropes, crawl on certain walls and defend himself with tail swipes or by using spoons as weapons. He can also engage his keen sense of smell, which displays the path to the next goal or objective. Sometimes, Remy must evade guards by hiding out of sight until their attention wanes. Other sequences in the levels involve sliding down pipes, rafting through water currents and fleeing from humans that chase Remy. Another large part are mini-games, many of which involve cooking, with Remy having to pick ingredients or peel potatoes.</p><p>There are some optional bonus missions, taking the form of dream sequences, in which Remy navigates landscapes made of foodstuffs. All levels include many collectibles. In most levels there will be up to 100 stars to collect. Special items in certain levels include batteries, darts or lightbulbs. Collecting all of a certain kind of item in an area awards bonus points, which can be spent in Gusteau's shop to unlock bonuses, including various kinds of artwork as well as the possibility to play the mini-games outside the main game, in both single and multiplayer modes.</p>"},{"name":"Disney Pixar: The Incredibles","year":2004,"developer":"Heavy Iron Studios, Inc.","url":"microsoft_xbox_d_part2/Disney-Pixar%20The%20Incredibles%20%28Europe%29.zip","filesize":6653253216,"score":6.3,"genres":"Action > Behind view > Platform > Licensed","desc":"<p>This game is based on the hit Pixar film of the same name and same plot.</p><p>The action game sees you controlling the Incredible family members, each with their own superpowers. Lift insanely heavy objects, bash through walls as Mr. Incredible, stretch to swing across chasms and grab enemies as Mrs. Incredible as well as taking control of their kids' Dash (run amazingly fast) and Violet (invisibility) in the 3D action game.</p>"},{"name":"Disney Pixar: The Incredibles: Rise of the Underminer","year":2005,"developer":"Heavy Iron Studios, Inc.","url":"microsoft_xbox_d_part2/Disney-Pixar%20The%20Incredibles%20-%20Rise%20of%20the%20Underminer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6606146102,"score":6.7,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Platform > Licensed","desc":"<p><em>The Incredibles: Rise of The Underminer</em> is the sequel to The Incredibles. </p><p>This game continues where the Pixar movie of the same name leaves off. The Underminer has risen from the ground and players can play as both Mr. Incredible and Frozone to defeat the Underminer and his army of robot minions. Mr. Incredible uses melee combat moves and strength to navigate the level while Frozone uses his freezing powers to defeat enemies. </p><p>Two players can play at the same time or the console can play one of the characters for the player.</p>"},{"name":"Disney's Chicken Little","year":2005,"developer":"Avalanche Software LLC","url":"microsoft_xbox_d_part2/Disney%27s%20Chicken%20Little%20%28USA%2C%20Europe%29.zip","filesize":6619807902,"score":6.5,"genres":"Action > 3rd-person (Other) > Arcade > Puzzle elements > Licensed","desc":"<p>Based on Disney's film, take part in Chicken Little's adventure as he and his friends, the Misfits, tries to save the world.</p><p>The game begins with Chicken Little missing his school bus and it's up to you to help him get to school. There are a total of 24 levels and you must complete a set of objectives in each one before being able to advance to the next. </p><p>By collecting Buck Cluck Trading Cards in each game level, you can purchase Minigames at the Minigame Store to play with a friend.</p>"},{"name":"Disney's Extreme Skate Adventure","year":2003,"developer":"Toys for Bob Inc.","url":"microsoft_xbox_d_part2/Disney%27s%20Extreme%20Skate%20Adventure%20%28Europe%29.zip","filesize":6817160544,"score":7.6,"genres":"Sports > 3rd-person (Other) > Skateboarding > Licensed","desc":"<p>Skateboard your way through the worlds of Toy Story, Tarzan, and The Lion King each including a variety of different levels and locals to visit. Play as characters from those universes or create your own from scratch. Each included character has their own look, board, moves, and collectible. Practice Modes and Freeskate moves provide the opportunity to try things out safely and freely and there are several \"pro moves\" and level-specific moves that can be done.</p><p>The game is 3D with a 3rd person perspective (usually behind the player) that uses the game engine from Tony Hawk's Pro Skater 4 and features a custom soundtrack with current bands.</p>"},{"name":"Disney's The Haunted Mansion","year":2003,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_d_part2/Disney%27s%20The%20Haunted%20Mansion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6710731891,"score":7.2,"genres":"Action > 3rd-person (Other) > Puzzle elements > Industrial Age > North America > Detective / mystery > Horror > Licensed","desc":"<p>In <em>Disney's The Haunted Mansion</em>, an action game based on a combination of the popular Disneyland attraction and the 2003 movie of the same name, players guide Zeke Holloway through the house of 999 happy haunts in order to solve a mystery, put the spirits to rest, and get out of the house alive. They are allowed full roam of the mansion, once they collect enough Shriveled Souls inside their Beacon of Souls, a special lantern designed to collect the various lesser ghosts throughout the rooms.</p><p>Though Zeke handles his quest alone, he is aided by Madame Leota and six friendly ghosts, who will provide hints and items throughout the journey. As Zeke solves puzzles, completes various tasks, and helps to rid the house of its evil spirits, these spiritual companions will provide Soul Gems, which amplifies the power of the Soul Beacon. Once fully charged, Zeke will have the ability to face the main spirit, Atticus Thorn, for the final showdown.</p>"},{"name":"Doom 3","year":2005,"developer":"id Software, Inc.","url":"microsoft_xbox_d_part2/Doom%203%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6529458603,"score":7.8,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Horror","desc":"<p>The third game of the DOOM series (now in full 3D) takes gamers through the depths of Hell, where technology and demons meet. But this time round, the game is more focused on horror elements than previous games in series.</p><p><em>Doom 3</em> is set in the year 2145, on Mars. You start as an unnamed marine soldier sent to the Red Planet, where a corporation named The Union Aerospace Corporation makes secret experiments based on ancient aliens' technology. People around the base are on the edge, &amp; something is not right. You receive your first simple mission and when you depart, the game really kicks off.</p><p>This third major release of the <em>Doom</em> series is especially based on single player experience. As in most First Person Shooter games, you aim, you shoot, &amp; you run... Enemies are zombified humans from the base or daemons straight from Hell. Doom 3 is much darker visually than previous games - you can use a flashlight in dark corridors, but you must choose between various weapons and the flashlight (the marine can't use them both in same time.)</p><p>The game has multiplayer with four game modes for four players.</p>"},{"name":"Doom 3 (Limited Collector's Edition)","year":2005,"developer":"id Software, Inc.","url":"microsoft_xbox_d_part2/Doom%203%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29%20%28Limited%20Collector%27s%20Edition%29.zip","filesize":6510139831,"score":"","genres":"Special edition > Digital extras > Extra content / game","desc":"<p>The <em>Limited Collector's Edition</em> has a metal box cover and includes:</p><ul><li>The Ultimate Doom</li><li>Doom II</li><li>Doom³</li><li>Interviews with the id Software crew</li><li>A behind the scenes featurette</li><li>Concept and production art gallery</li></ul>"},{"name":"Doom3: Resurrection of Evil","year":2005,"developer":"Nerve Software, LLC","url":"microsoft_xbox_d_part2/Doom%203%20-%20Resurrection%20of%20Evil%20%28USA%2C%20Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6620785365,"score":7.4,"genres":"DLC / Add-on > Game mode > Item > Map / level > NPC / enemy > Story / mission","desc":"<p>In this expansion pack for DOOM³, return to the devastated facilities on Mars (where the unexplained disaster took place two years prior) to find a beacon buried in the ruins. There are new enemies, weapons, locations and puzzles - and multiplayer for up to 8 players.</p><p>The Xbox version introduces new multiplayer maps for up to four players with various modes: Deathmatch, Team Deathmatch, Last Man Standing and Tournament, via System Link or Xbox Live. It also contains classic DOOM content: Ultimate DOOM, DOOM II and the DOOM's Master Levels version. You can play those in single player, cooperative or with deathmatch for up to 4 players on a split screen.</p>"},{"name":"Double S.T.E.A.L: The Second Clash","year":2005,"developer":"Bunkasha Games","url":"microsoft_xbox_d_part2/Double-S.T.E.A.L%20-%20The%20Second%20Clash%20%28Japan%29%20%28En%2CJa%29.zip","filesize":6856792010,"score":"","genres":"Action > Racing / Driving > 3rd-person (Other)","desc":"<p>Having already freed Hong Kong from the grip of the Yakuza in their last game, the Dragons of the Hong Kong Police Force fly to America to hand Tiger Takagi off to the CIA. Unfortunately Takagi is barely on American soil for five minutes before his Yakuza cronies spring him, and this time it's up to the Dragons alone to put him behind bars for good.</p><p><em>Double S.T.E.A.L: The Second Clash</em> has the same reckless vehicular smashing action of the first game, but this time set in the American city of Chicago. Missions can have varied objectives such as destroying a number of Yakuza targets or getting to a point in the city while being hounded by Yakuza cars. Missions have far more generous time limits compared to the first game, but they are also now rated, and earning a high rating on a mission with a quick time can unlock Extra Missions and cars. Most cars can earn multiple turbo boosts by destroying property and traffic, and if the boost bar is maxed out then it will be expelled all at once and stop time as well.</p><p>The free mode of the PlayStation 2 and GameCube versions of Wreckless makes a return, allowing Madoka and Mei to drive around the city without worrying about objectives or time limits. Boxes of car parts can be found hidden around Chicago, and for every five boxes found a new car will be unlocked. Extra Missions can be found as well that have non-Yakuza related objectives, such as winning a dirt race, reaching checkpoints, or delivering pizza in time.</p>"},{"name":"Dr. Muto","year":2002,"developer":"Midway Games West, Inc.","url":"microsoft_xbox_d_part2/Dr.%20Muto%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6627146506,"score":7.2,"genres":"Action > Behind view > Platform > Sci-fi / futuristic > Comedy","desc":"<p>Burnital Industries is causing an energy crisis on Planet Midway. In a desperate attempt to rectify the situation the mayor reluctantly asks the mad scientist, Dr. Muto, to use his Genitor 9000 machine. However, the machine winds up destroying the majority of Planet Midway. In order to restore the planet, Muto must go out searching for isotopes, Terra, and pieces of the Genitor 9000 that got scattered on the four planets that Burnital Industries owns.</p><p>Gameplay involves collecting the aforementioned items. While the isotopes can be found all over, the Terra pieces are collected by completing challenges. andthe Genitor pieces are earned by defeating a planet's boss. Each planet also holds seven scrap parts for Muto to find. Collecting the scraps will give Muto a new gadget to use such as rocket boots or an invisibility suit.</p><p>While Dr. Muto can jump and zap enemies, he is also able to morph into several different creatures by using his Splizz Gun. Muto can morph into a mouse, spider, gorilla, fish, or a pterodactyl. This is necessary as the creatures have unique abilities such as the mouse being able to fit into tight spaces and the pterodactyl having the ability to fly.</p>"},{"name":"Dr. Seuss' The Cat in the Hat","year":2003,"developer":"Magenta Software Ltd.","url":"microsoft_xbox_d_part2/Dr.%20Seuss%27%20The%20Cat%20in%20the%20Hat%20%28USA%2C%20Japan%29.zip","filesize":6488881299,"score":6,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Based on Dr Seuss's Cat in the Hat movie, you play as thecheeky cat. There are all the original characters including,Conrad, Sally, and Mr. Quinn who tricked Conrad, and Sallyinto opening the box the Cat was in, as he was released intothe outside world. The Cat must help Conrad and Sally to return the magic to the box the cat came in, and get all three pieces of the \"Crab Lock\" in order to lock the box for good. The game allows you to see rooms that where not included in the movie.</p>"},{"name":"Dragon Ball Z: Sagas","year":2005,"developer":"Avalanche Software LLC","url":"microsoft_xbox_d_part2/Dragon%20Ball%20Z%20-%20Sagas%20%28USA%29.zip","filesize":6644707433,"score":5.9,"genres":"Action > 3rd-person (Other) > Anime / Manga > Beat 'em up / brawler > RPG elements > Sci-fi / futuristic > Martial arts > Licensed","desc":"<p><em>Dragon Ball Z: Sagas</em> is an action game that tells how the story of Dragon Ball Z began. Players can choose between six different heroes from the show, such as Goku, Gohan, and Piccolo. Their mission is to recreate the elements of the Saiyan-Cell Games Sagas. Along the way, they must fight evil enemies, as well as collect Z-Coins, to achieve new abilities and moves, and Capsules, which give more fighting power and energy. Some areas end with a boss fight (Raditz, Nappa, Captain Ginyu, Frieza, and Cell). </p><p>The single-player mode features three difficulty levels. The game also has a co-op mode, where any chapter from the single-player mode can be selected, but with a higher difficulty level.</p>"},{"name":"Dragon's Lair 3D: Return to the Lair","year":2002,"developer":"Dragonstone Software","url":"microsoft_xbox_d_part2/Dragon%27s%20Lair%203D%20-%20Return%20to%20the%20Lair%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6429989722,"score":6.8,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Licensed","desc":"<p>The goofy, but courageous knight Dirk the Daring is on a quest to save the pretty princess Daphne. The princess was kidnapped by the evil dragon Singe and imprisoned in a medieval castle owned by an even more evil wizard called Mordroc. Now, it's only up to Dirk to use his courage and his quick reflexes to overcome the traps in the castle, if he wants to save the princess and his skin.</p><p><em>Dragon's Lair 3D: Return to the Lair</em> can be considered a re-imagining of the 1983 arcade game: gameplay-wise it deviates from it significantly, being a full-fledged action platformer with unrestricted character movement. Dirk has to battle enemies, jump across platforms and hazards, and solve a few puzzles on his way. Health and mana points can be upgraded over the course of the game. Dirk can also use a crossbow to combat enemies and solve some of the puzzles. Collecting Dragon Essences scattered through the castle grants him new powers.</p><p>The game features the familiar cartoon-like style of the original version (done with cel-shaded technique), as well as many familiar locations and boss enemies.</p>"},{"name":"Drake of the 99 Dragons","year":2003,"developer":"Idol FX AB","url":"microsoft_xbox_d_part2/Drake%20of%20the%2099%20Dragons%20%28USA%29.zip","filesize":6762575195,"score":4.2,"genres":"Action > Behind view > Shooter","desc":"<p>The clan of the 99 Dragons has been wiped out and the artifact they had been guarding has fallen into the wrong hands. One of the clan members, Drake, is brought back from the dead to avenge his clan and recover the lost treasure.</p><p>Dubbed as an interactive comic book of sorts, this 3rd person shooter has the player utilize a series of violent means to achieve his goals, which effectively equals to shooting at everything that moves with Drake's dual guns.</p>"},{"name":"Dreamfall: The Longest Journey","year":2006,"developer":"Funcom Oslo A/S","url":"microsoft_xbox_d_part2/Dreamfall%20-%20The%20Longest%20Journey%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6017625652,"score":7.6,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Direct control > Cyberpunk / dark sci-fi > Fantasy > Sci-fi / futuristic > Steampunk","desc":"<p><em>Dreamfall</em> is the sequel to The Longest Journey and is a third-person adventure game with a few action episodes.</p><p>The game begins in Casablanca, 2219. Zoë Castillo is about to get involved in a conspiracy that spans across two worlds: the one she grew up in, and a mysterious magical realm. There has been static interference that is disrupting technology, and it seems to be linked to a little girl seen only by Zoë. As Zoë begins her search for a lost friend, she discovers the truth about the two worlds and the search is now on for the one person who may help Zoë unravel the dangerous web she has become entangled in: April Ryan.</p><p><em>Dreamfall</em> puts the player in control of three characters. It also introduces the focus field feature, which allows the player to scan an entire visible environment as seen by the characters and also use it to eavesdrop into other people's conversations. There are a few fighting sequences in the game, and a few instances where the player can choose to fight a character or opt to solve the confrontation in a peaceful way. The game spans 13 chapters; like April in the previous game, Zoë keeps a diary of all the events that occur in the game.</p>"},{"name":"DreamWorks Madagascar","year":2005,"developer":"Toys for Bob Inc.","url":"microsoft_xbox_d_part2/DreamWorks%20Madagascar%20%28USA%2C%20Europe%29.zip","filesize":6639649866,"score":7,"genres":"Action > 3rd-person (Other) > Free-roaming camera > Platform > Puzzle elements > Direct control > Licensed","desc":"<p>Be a part of Dreamwork's animated adventure by guiding Marty the Zebra, Alex the lion, Melman the giraffe, Gloria the hippo and those stealthy Penguins as they escape the Central Park Zoo into the streets of New York and then into the wild jungle...err San Diego zoo.</p><p>The storyline is exactly the same as the movie itself and each chapter will bring you further in the story.  Every chapter will have various goals set.  Only one specific goal per chapter is required to complete the chapter so you can always replay the chapter later to try to complete all the goals. </p><p>Every stage will also require you to play as a different character and some will involve all characters. </p><p>Each character have their own unique abilities:  Marty can kick with his hind legs, sneak around his enemies slide and perform long-jumps.  Alex the lion can throw fruits, use his claws and roar at his enemies. Gloria can tumble, butt bounce and hip check her enemies.  And when she eats some chili peppers, she will be able to charge into her enemies. Melman can spin into, throw items at and head bash his enemies. He can also perform the Helicopter move which enables him to glide long distances. Finally the Penguin can slide, fish and attack with a Finishing move (something like a karate chop) to defeat their enemies.</p><p>Throughout the game there will be various items to collect including Life Tikis to replenish your Health Meter and Monkey Money that will enable you to buy special things at the Zoovenir Shop like mini games and special outfits for the Madagascar cast.</p>"},{"name":"DreamWorks Over the Hedge","year":2006,"developer":"Edge of Reality, Ltd.","url":"microsoft_xbox_d_part2/DreamWorks%20Over%20the%20Hedge%20%28USA%2C%20Europe%29.zip","filesize":6585830170,"score":6.3,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p><em>Over the Hedge</em> is based on the movie with the same name. Verne and his woodland family wake-up from their winter slumber to find an ominous green wall in neck of the woods. In their amazement to find out what this endless wall is about, RJ the raccoon is more than happy to help them. The woodland friends have never seen humans before so RJ is eager to show them what humans have to offer. RJ is quick to show them the valuable treasures humans - stockpiles of food.</p><p>Playing as RJ, Verne, Hammy, or Stella you go on missions to get FOOD. You also of course want to take back your neighborhood but that pesky Rancho Camelot Estates Homeowners Association President, Gladys Sharpe, is dead set on getting rid of you. She hires Dwayne the exterminator to use his tactics and gadgets to get rid of the likes of you. </p><p>Play by yourself or have a friend jump in and help at anytime to get the FOOD!!! There are dozens of puzzles and mini-games to keep you entertained.</p>"},{"name":"DreamWorks Shark Tale","year":2004,"developer":"Edge of Reality, Ltd.","url":"microsoft_xbox_d_part2/DreamWorks%20Shark%20Tale%20%28USA%2C%20Europe%29.zip","filesize":6700984253,"score":7,"genres":"Action > Racing / Driving > 3rd-person (Other) > Licensed","desc":"<p><em>Shark Tale</em> is inspired by the movie of the same name and follows the adventures of Oscar, a blue-streaked cleaner wrasse fish. Oscar seems to have got himself into a bit of trouble as he needs to earn money to pay off a loan shark.</p><p>The game consists of over 25 chapters with each chapter having three missions to perform. The three missions are broken into a regular one, a bonus one, and an elite one. Completing missions earn Oscar fame points which affect his fame rating. Also, depending on how well Oscar performs missions will determine how much money he earns to pay off his debt. Missions are varied including things like escaping a shark, erasing graffiti, and a dancing segment.</p>"},{"name":"Drihoo","year":2002,"developer":"Highwaystar Co., Ltd.","url":"microsoft_xbox_d_part2/Drihoo%20%28Japan%29.zip","filesize":6640282785,"score":"","genres":"Action > Behind view > Direct control > Fantasy","desc":"<p>Dunk the dwarf is a solo treasure hunter, left to his own devices after a cave-in separates him from the rest of his crew. The ground underneath the land is filled with ruins, treasures, and monsters, just waiting to be found. Luckily, he's armed with his trusty drill ready to explore the earth.</p><p>The core of Dunk's journey is digging. While underground, players can hold down the R trigger to rev up their drill and start drilling through dirt or stone. There are no preset maps and no pre-made tunnels: players make their own paths, digging in whatever direction they please. Their tunnels are persistent and will always stay in exactly the same position between play sessions, allowing players to slowly build an extensive tunnel network over time. Dunk will slowly get more tired over time as he digs, but luckily he can carry a supply of his favourite booze, \"beev\", with him; taking a swig of beev helps him recover his strength, and he can always refresh his supply of beev back at town.</p><p>Hidden throughout the world are tombs, filled with treasures - but also monsters. If Dunk runs into these, he can explore them to collect whatever treasures he finds while defending himself from monsters with his hammer. After collecting treasures, he can bring them back to the nearest settlement to decode ancient relics and sell valuable items, using the proceeds to find more supplies to keep him going.</p>"},{"name":"Driv3r","year":2004,"developer":"Reflections Interactive Limited","url":"microsoft_xbox_d_part2/Driv3r%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5946266627,"score":5.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Sandbox / open world > Shooter > Detective / mystery > Spy / espionage","desc":"<p>Continuing from the storyline of the previous Driver games, players reprise their role as the undercover cop Tanner, this time infiltrating a worldwide high-performance car theft ring.</p><p>Nothing is too dangerous or too risky for Tanner, as he'll hop into any car, truck, or motorcycle, and cruise the streets of three re-created cities (Miami, Nice and Istanbul) with over 156 miles of roads, in more than 25 storyline missions featuring some characters from the previous installments.</p>"},{"name":"Drive to Survive","year":2005,"developer":"Supersonic Software Ltd."},{"name":"Driver: Parallel Lines","year":2006,"developer":"Ubisoft Reflections Ltd.","url":"microsoft_xbox_d_part2/Driver%20-%20Parallel%20Lines%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5658108164,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Shooter > Automobile","desc":"<p>Driver: Parallel Lines is the fourth game in the Driver series, following the story of TK. In 1978, TK (who was then an 18-year-old driver-for-hire who had just graduated from high school) was sentenced to 28 years in prison for a crime he did not commit, and is released from prison in 2006. Now, with his driving skills, he seeks revenge against the police department for having to serve time for something someone else should've gone to prison for!</p><p>Unlike Driv3r, Driver: Parallel Lines mostly takes place behind the wheel, returning back to the formula that made the first game a classic. The game still has a GTA-style open-ended design, though, and you can still exit your vehicle for some on-foot action. However, there's no reason to exit your vehicle unless it's damaged and you can no longer drive it, as almost all of the game's missions involve cop car chases. If that's the case, then you can either go to the repair shop to repair your vehicle, or just steal someone else's vehicle! Until then, you can punch the cops with your fists and steal their weapons when they're dead, so that you can use them for future on-foot combat.</p><p>The game takes place in both 1978 (before TK went to prison) and in 2006. The 2006 setting has a much more modern soundtrack than the 1978 setting, which has a mostly disco soundtrack. Obviously, the 2006 setting has the architecture, technology, and cars of today.</p>"},{"name":"Dukes of Hazzard, The: Return of the General Lee","year":2004,"developer":"Ratbag Pty, Ltd.","url":"microsoft_xbox_d_part2/Dukes%20of%20Hazzard%2C%20The%20-%20Return%20of%20the%20General%20Lee%20%28USA%2C%20Europe%29%20%28En%2CFr%2CEs%29.zip","filesize":6573025826,"score":6.2,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>You play gold old boys Bo &amp; Luke Duke as you fight to rescue Uncle Jesse from jail and save Hazzard County from Boss Hogg's latest rotten scheme.</p><p>As Bo &amp; Luke you'll tour Hazzard County by car on back roads, race circuits, and country routes in a series of timed missions which range from racing to chasing to gathering parts to build their famous car, the General Lee.  Hazzard County's famous landmarks are all here, from the Duke Farm to Cooter's Garage to the Boar's Nest and all points between.</p><p>The slip-sliding, rally-style, third person action takes place exclusively behind the wheel.  Controls include steering, braking, rear view, etc.  Dixie Horn and \"Yee-HAW!\" buttons included.</p><p>Based on the original television series.  Surviving original cast members provide the voices.</p>"},{"name":"Dungeons & Dragons: Heroes","year":2003,"developer":"Atari, Inc.","url":"microsoft_xbox_d_part2/Dungeons%20%26%20Dragons%20-%20Heroes%20%28Europe%29.zip","filesize":6517208047,"score":7.4,"genres":"Role-playing (RPG) > Diagonal-down > Action RPG > Licensed","desc":"<p>Raised from the dead, four heroes gather. Together they pledge to defeat an ancient and evil power. Existence itself is threatened -- the ultimate showdown awaits.</p><p>Dungeons &amp; Dragons: Heroes is an Xbox-exclusive RPG title based on the D&amp;D 3.0 Edition ruleset. Play as a fighter, cleric, rogue or wizard in the quest to defeat the evil wizard Kaedin. </p><p>Venture solo or have up to three friends join for co-operative multiplayer gameplay.</p>"},{"name":"Dynasty Warriors 3","year":2002,"developer":"Omega Force","url":"microsoft_xbox_d_part2/Dynasty%20Warriors%203%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%29.zip","filesize":6278542659,"score":7.3,"genres":"Action > Strategy > 3rd-person (Other) > Real-time > Arcade > Hack and slash > Real-time strategy > China (Ancient / Imperial) > Historical events","desc":"<p>About 1800 years ago in China, there were three fearless warriors battling for ultimate control over the country. One who sought hegemony. One who sought ambition. One who stood up for righteousness. Veterans who shared the same swarmed under each leader. These stalwart souls waged war across the vast expanse of the land and, like blood thirsty demons, cut down any and all who stood in their way.</p><p>They followed their own rules, they were both revered and feared by millions... they are the Dynasty Warriors.</p><p><em>Dynasty Warriors 3</em> takes place over the 50 years of war recounted in <em>Romance of the Three Kingdoms</em>, from the first flames of battle in the Yellow Turban Rebellion to the final battle between Wei and Shu on the plains of Wu Zhong. Over 40 characters are playable, both from the three main sides as well as leaders of lesser armies along the way. Each character that belongs to either Wu, Wei, or Shu has their own series of levels where they will turn the tide of battle for their force to win. Each character has their own unique weapon type and magic ability, although they can share weaker variations of weapons with other characters who use the same style of weapon. Weapons and items are dropped randomly from boxes in levels as well as from defeated enemy generals, and each has a range of stats dependent on the difficulty level and the strength of the general. The most powerful weapons and items, however, can only be collected by completing hidden objectives as each character. Characters grow more powerful by collecting stat up items from defeated generals, and doing well in levels rewards points that level up the bodyguards who follow the player character.</p><p>Most completed levels can be replayed with any character and any side in free mode. An encyclopedia is included as well that details every event and character from the <em>Romance of the Three Kingdoms</em>, even those that never appear in <em>Dynasty Warriors 3</em>.</p>"},{"name":"Dynasty Warriors 4","year":2003,"developer":"Omega Force","url":"microsoft_xbox_d_part2/Dynasty%20Warriors%204%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":5739160335,"score":7.6,"genres":"Action > Strategy > Behind view > Arcade > Hack and slash > China (Ancient / Imperial) > Fantasy","desc":"<p>Take it to the battlefield and challenge multiple opponents at once as you fight against impossible odds. Developed by Omega Force, Dynasty Warriors 4 uses the most advanced melee-fighting engine to deliver the next evolution of tactical action.</p><p>Ancient grudge and new mutiny bring an end to the four hundred year reign of the Han dynasty. The once noble empire is divided into three warring states. Dynasty Warriors 4 covers a one hundred year cycle, from civil unrest to the reunification of China under the Jin dynasty.</p><p>Fourth in its series, this game's deep storyline incorporates a host of new features, character depth and insight into the turbulent events of the Three Kingdoms era. Can you succeed as a warrior of honor  and loyalty in the face of adversity? Your obligations to lords and allies guide your path as you fight to unify a divided empire.</p>"},{"name":"Dynasty Warriors 5","year":2005,"developer":"Omega Force","url":"microsoft_xbox_d_part2/Dynasty%20Warriors%205%20%28Europe%29.zip","filesize":5838520482,"score":6.9,"genres":"Action > Strategy > Behind view > Hack and slash > China (Ancient / Imperial) > Fantasy","desc":"<p>The series returns for yet another iteration removing majority of the features included in Empires and Xtreme Legends. The setting is again ancient China. This time there are 48 different characters to choose from in Musou mode. The majority of the 48 characters have to be unlocked and only 6 new characters have been added to the series. Each character has his or her own storyline.</p><p>There are more enemies to square up against on screen then any previous game in the series. The game uses the same graphics engine as the previous game. Changed for this edition are the bodyguards: they now do a better job of protecting the player character against the enemies. The stronghold system from <em>Dynasty Warriors 4: Empires</em> has been carried over, enabling players to take over an enemy base by killing its leader.</p>"}]