[{"name":"Ed, Edd n Eddy: The Mis-Edventures","year":2005,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_e/Ed%2C%20Edd%20n%20Eddy%20-%20The%20Mis-Edventures%20%28USA%29%20%28En%2CFr%29.zip","filesize":6743910393,"score":5.6,"genres":"Action > Behind view > Platform > Puzzle elements > Licensed","desc":"<p>Ed, Edd, and Eddy are three stupid friends obsessed with one thing and one thing only: jawbreakers! Eddy is the fearless leader, eager to make a quick buck; Ed is the tall, strong, and stupid one, while Edd (or Double-Dee) is the smart, polite neat-freak, who communicates with his family through sticky notes.</p><p><em>Ed, Edd n Eddy: The Mis-Edventures</em> allows you to play as the trio through a series of levels, called 'scams'. Each level is a get-rich-quick scheme dreamed up by Eddy, allowing the Eds to get some jawbreakers. Each level can be accessed via the hub world, the 'Cul-de-sac', where the Eds have their adventures and meet other neighborhood kids.</p><p>Players control all three Eds; more specifically, they're always in control of an Ed, and the other two tag along. You can switch your Ed at any time with the press of a button. Each Ed has their own abilities: Eddy can hurl stink bombs and form a tower to reach high objects, Ed can dig in sandpits, lift and throw objects, and charge at things to smash them, while Double Dee can use his slingshot, activate machines, and be thrown high into the air by the other two Eds.</p>"},{"name":"Egg Mania","year":2002,"developer":"HotGen Studios Ltd.","url":"microsoft_xbox_e/Egg%20Mania%20-%20Eggstreme%20Madness%20%28USA%29.zip","filesize":6773251542,"score":7.4,"genres":"Action > 3rd-person (Other) > Fixed / flip-screen > Arcade > Platform > Puzzle elements","desc":"<p><em>Egg Mania</em> is a puzzle game in which the player controls an egg-shaped character against either a computer opponent or another player via the link cable. The object of the main modes is to build a tower tall enough to reach a balloon at the top of the playfield before the opponent does. If the player tries to take a short cut and not build complete floors, the structure will start crumbling and the water will come up faster. There are plenty of obstacles, both from the game and from competing opponents. Falling meteors can knock the player down into the water, while bombs thrown by the opponent will destroy parts of the player's structure. The main modes include Over Easy and Hard Boiled, the difference being that in the latter a different difficulty can be chosen.</p><p>There are four extra modes: Survival, Solo, Time Trial, and Bomb. In Survival the player must survive as many rounds as possible, while the goal in Solo is to increase the overall score by completing rows and performing combos; Time Trial challenges the player to continually beat his or her own best time; finally, in Bomb, whoever destroys the opponent's tower first wins.</p><p>Compared to the GBA version, the console versions have improved graphics and sound, cutscenes at the beginning of each level, a play area that is wider by one block, two additional modes (8-player Tournament and Custom, where the rules can be customized by activating different options), but lacks the Time Trial mode. Otherwise, they are completely identical, both in gameplay and level design.</p>"},{"name":"Elder Scrolls III, The: Morrowind","year":2002,"developer":"Bethesda Game Studios","url":"microsoft_xbox_e/Elder%20Scrolls%20III%2C%20The%20-%20Morrowind%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6103184727,"score":8.3,"genres":"Role-playing (RPG) > 1st-person > Behind view > Action RPG > Sandbox / open world > Direct control > Fantasy","desc":"<p>Freed by the decree of Uriel Septim VII, the Emperor of Tamriel, a lone prisoner is transported to the province of Morrowind. It seems that the strange dreams this prisoner has been having lately may have a connection to equally strange events occurring there. The protagonist is given a simple assignment: join the Blades, a secret organization whose goal is to protect the safety of the Emperor. This leads to a discovery of an ancient prophecy and an evil scheme concocted by a powerful deity whom the protagonist alone is able to stop.</p><p>Conceived in the tradition of the <em>Elder Scrolls</em> series, <em>Morrowind</em> is a fantasy role-playing game with a vast world open for exploration. After being released from a prison ship at the shores of the island Vvardenfell, the protagonist may do more or less what he or she wants: follow the main quest and solve the mystery of an ancient prophecy, join any of roughly a dozen guilds and rise in their hierarchy by performing duties, or simply explore the gigantic island with its stylistically diverse cities, hundreds of dungeons and tombs, ancient ruins and mighty fortresses. </p><p><em>Morrowind</em> uses a two-stage skill system. The hero’s primary stats (strength etc.) increase with each level gained, while secondary abilities improve by use – for example, the more often the character jumps, the more proficient he or she becomes in the Acrobatics skill, etc. The action-oriented fights are simple exchanges of strikes or spells, until one combatant dies. The enemy's hit points and condition were not originally shown; however, at the request of customers a health bar was added for enemies as part of the first upgrade patch.</p><p>The protagonist's race and gender, but also his or her reputation influence the reactions of NPCs. If a character’s sympathy for the hero is low (rated on a scale from 1 to 100), he might refuse to answer questions; if it is high, the player will get more detailed information and better bargains in shops. Most quests involving other persons can be solved by persuasion, pick-pocketing, or simply by force.</p><p>The game's NDL 3D game engine is powerful in drawing wide, detailed outdoor landscapes as well as complex indoor environments. Transitions are not fluent; houses and dungeons must be loaded upon entering.</p>"},{"name":"Elder Scrolls III, The: Morrowind - Game of the Year Edition","year":2003,"developer":"","url":"microsoft_xbox_e/Elder%20Scrolls%20III%2C%20The%20-%20Morrowind%20-%20Game%20of%20the%20Year%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5856096965,"score":8.4,"genres":"Compilation","desc":"<p>This Game of the Year edition includes:</p><ul><li>The Elder Scrolls III: Morrowind (base game)</li><li>The Elder Scrolls III: Tribunal (expansion)</li><li>The Elder Scrolls III: Bloodmoon (expansion)</li><li>TES Construction Set (retail version only)</li></ul>"},{"name":"Enclave","year":2002,"developer":"Starbreeze Studios AB","url":"microsoft_xbox_e/Enclave%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6174944439,"score":7.2,"genres":"Role-playing (RPG) > 1st-person > Behind view > Action RPG > Hack and slash > Puzzle elements > Direct control > Fantasy","desc":"<p>During a great war, the land of Celenheim was separated into two sides; the light side and the dark side. On the side of the Light, the Enclave was protected from all sides by a wide rift, a bottomless abyss. On the Dark side, twisted forms struggled for survival, while slowly growing more powerful, preparing to invade the Light side once again.</p><p><em>Enclave</em> is a level-based action RPG game with a mix of shooting and puzzles, pitting the player as one of twelve different characters on either side in this medieval era. As a member of the Light side: a Knight, a Huntress, a Wizard, a Druid, an Engineer or a Halfling can be chosen. At the opposite end of the spectrum: a Berserker, an Assassin, a Sorceress, a Lich, a Bombardier, or a Goblin. The player needs to perform different tasks leading ultimately to one objective; protect the Enclave (Light) or invade the land (Dark). To accomplish these tasks, various weapons, such as swords, bows, staffs and spears, can be used. To aid the player, shields are readily available, as well as a select few potions. Armor is abundant and comes in many shapes and sizes.</p>"},{"name":"England International Football","year":2004,"developer":"Codemasters","url":"microsoft_xbox_e/England%20International%20Football%20-%202004%20Edition%20%28Europe%29.zip","filesize":6435378495,"score":"","genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>This is the only official game of the England soccer team and developed by the makers of the <em>Club Football</em> series, Kuju Entertaiment. <em>England International Football</em> allows the players to play for England as their official team. Simple enough, your goal in this game is to lead the England team squad to the international victory. As the official England football game, it features all the 25 members of the England's team including their Swedish coach. All of them are 3D modeled from their real life counterparts, resulting in some uncannily accurate virtual likenesses. The game uses an improved version of the <em>Club Football 2005</em> game engine. There are some minor improvements in the gameplay such as shooting and improved AI. In the game's menu you will find an European Championship mode where you can battle against twenty of Europe's top national teams. If this is not enough for you, there are extra 12 teams including Brazil, Argentina and Cameroon in another different mode called the World Cup--emulating International Cup mode.</p><p>In addition there is a Create-A-Player system where you get a chance to get involved in the on-pitch action. The game's reward system includes England Trophy Room which is a collection of unlockable rewards such as player profiles, photographs from over the years and even video clips - including England's infamous 5-1 triumph over Germany that can be unlocked if you preform well. Other features include crowd voices recorded from real life matches and commentary from Gary Lineker and Barry Davies. The game includes seven game modes, namely: European Championship, International League, International Cup, Exhibition, Quick Start, Custom Cup and Custom League.</p>"},{"name":"Enter the Matrix","year":2003,"developer":"Shiny Entertainment, Inc.","url":"microsoft_xbox_e/Enter%20the%20Matrix%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5428165426,"score":6.1,"genres":"Action > 1st-person > Behind view > Sci-fi / futuristic > Licensed","desc":"<p><em>In the war to save Zion, what part will you play?</em><em>Enter The Matrix</em> casts the player as Niobe or Ghost, captain and first mate of the rebel ship Logos, respectively. Niobe is a master combatant, capable of beating up everyone in her way. She is an excellent pilot, both in the real world and in the Matrix. Ghost is very adept at firearms, and his marksmanship is a mastery. Both characters are very athletic, and throughout the game the player will have to walk, run, jump, strafe, peek, run on walls, climb ladders and pipes, and fight various enemies.</p><p>Available weapons include a security pistol, an automatic pistol, a submachine gun, a machine gun, a shotgun, and grenades. Besides weapons, a variety of hand-to-hand moves are available, from punches, throws, and grabs to kicks and chokes. Throughout the game, the player will be called upon to utilize Focus moves, which is basically bullet time from the films. When Focused, time slows to a crawl, allowing the player to zoom around enemies, dodge bullets, and jump to avoid oncoming obstacles.</p><p>The game was written and directed by the Wachowskis, and its plot is intertwined with that of the second movie, <em>The Matrix Reloaded</em>.</p>"},{"name":"Eragon","year":2006,"developer":"Stormfront Studios","url":"microsoft_xbox_e/Eragon%20%28USA%2C%20Europe%29.zip","filesize":6326337346,"score":5.7,"genres":"Action > 3rd-person (Other) > Hack and slash > Fantasy > Licensed","desc":"<p><em>Eragon</em> is a third-person, fixed camera action adventure game based off of the plot of the movie of the same name. One or two players can fight as Eragon through the world of Alagaesia, with drop-in drop-out coop support. In addition to lots of fighting combos and team attacks, the player can unleash magical attacks on his enemies. There are also a number of dragon flying levels, with the player(s) controlling the powerful Saphira as she cleaves through hordes of enemies. The 360 version of this title contains additional levels and enemies.</p>"},{"name":"Escape 03","year":2003,"developer":""},{"name":"ESPN College Hoops","year":2003,"developer":"Kush Games, Inc.","url":"microsoft_xbox_e/ESPN%20College%20Hoops%20%28USA%29.zip","filesize":5555134703,"score":7.5,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>ESPN College Hoops</em> is the second of Sega's college basketball games and follow-up to NCAA 2K3, to which it adds several new gameplay modes and other enhancements. It also carries over several of ESPN NBA Basketball's improvements in controls and graphics.</p><p>Returning game modes include Quick Play, Exhibition, Season, Legacy, Tournament, Practice and Gym Rat. The Legacy mode has redesigned menus and adds full season recruiting via assistant coaches, scout visits of high school games and a new trophy room. New modes include Rival mode, which lets players set up quick games that feature classic school rivalries, and Slam Dunk Challenge. The Challenge offers five different dunk competitions: Beat the Clock, Style, Horse, Dunk-O-War (who can fire up the crowd the most, needs to be unlocked) and a Championship of all modes. Dunks are executed through QTE-style pressing of buttons in the correct order in quick succession. Players can create their own schools in the new Create-A-School mode, allowing for customization of mascot, fight song and even floor type.</p><p>On the court, major changes include IsoMotion controls similar to those seen in <em>ESPN NBA</em>, which allow a variety of new offensive moves and manual stealing on defense through use of the right thumbstick. Also new are ability icons, which quickly indicate a player's special skill (speed, 3-point-shots, defense or star quality).</p><p>The game features many unlockables in the Campus Store. Currency for the store is earned by completing challenges on the court, which can then be spent to unlock mascot teams, alternate uniforms, professional and fantasy courts and classic teams.</p>"},{"name":"ESPN College Hoops 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20College%20Hoops%202K5%20%28USA%29.zip","filesize":6194248395,"score":7.4,"genres":"Sports > 3rd-person (Other) > Isometric > Basketball > Licensed","desc":"<p>College Hoops 2K5 offers a comprehensive college basketball experience.  Go through Legacy Mode to bring a small college respect and eventually earn a job with a major program.  Go online to test your skills against players around the world.</p>"},{"name":"ESPN International Winter Sports 2002","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"microsoft_xbox_e/ESPN%20International%20Winter%20Sports%202002%20%28USA%29.zip","filesize":6748029307,"score":6,"genres":"Simulation > Sports > 3rd-person (Other) > Behind view > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p>While not officially endorsed by the Winter Olympics, the game is modeled closely to it with 10 events that include skiing, curling, bobsledding, figure skating among more. The gameplay for each event varies, but feature similar controls that require the player to tap a set of buttons when prompted for control, speed, etc. Depending on if the player hits the required buttons successfully and the timing will determine the outcome of these events.</p><p>There are four different gameplay modes that include <em>Championship</em> which lets the player compete in a series of events to win the coveted gold medal and <em>Head-to-Head</em> which allows two players to compete against each other. It also features the ESPN license which adds to the realism with a TV-style presentation along with announcers for in-game commentary.</p>"},{"name":"ESPN Major League Baseball","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20Major%20League%20Baseball%20%28USA%29.zip","filesize":6221331314,"score":7.4,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>ESPN Major League Baseball is the successor to Sega's World Series Baseball 2k3. Back are all of the game play modes from last years release:  exhibition, playoffs, season, and franchise. Additionally, gamecast, duel, situation and GM career have been added to the game.</p><p>In gamecast mode, you can manage and watch a game as it progresses, make substitutions and then jump into the action when you want to.</p><p>In duel mode, you'll pick a pitcher and hitter and duke it out against the computer to see who can get the most hits and who can throw the most strikes.</p><p>In situation mode, you can set the field up how you want to and change a number of settings like how many players on base to what inning it is and who is up to bat so you can figure out your ultimate 'what-if' scenario.</p><p>In GM career mode, you'll need to run a franchise while keeping your owner happy. Got an owner who is financially conscious? He'll want you to make sure you hire only moderately priced players and do reasonably well. Get a maverick, and you'll get a longer leash, a bit more money, but the added pressure of needing to take your team to the playoffs.</p><p>All 30 MLB teams are included with their stadiums along with 16 different all-star teams. It also has 6 classic stadiums and a team made up of the greatest players of all time. Each team also has a number of alternate and throwback jerseys. Also, new is the ESPN authentic feel in the form of graphics and play break downs. Get a particularly nice strike out and you'll get to see the trajectory with ESPN K-Zone. Strike someone out three times in a row and Rex Hudler and Jon Miller will applaud you for a job well done.</p><p>You can also use the X-box version to grab the latest roster or play against someone online in an exhibition game on either the PS2 or the X-box version.</p>"},{"name":"ESPN MLS ExtraTime 2002","year":2002,"developer":"Konami Computer Entertainment America, Inc.","url":"microsoft_xbox_e/ESPN%20MLS%20ExtraTime%202002%20%28USA%29.zip","filesize":6712234109,"score":"","genres":"Sports > Diagonal-down > Real-time > Direct control > Football (European) / Soccer > Licensed","desc":"<p>SOCCER, PERFECTLY.<br><br>* More accurate than ever - Refined soccer AI and on-field control deliver the game as it was meant to be.<br>* Authentic MLS - Get into the game with real MLS players and teams.<br>* MLS and beyond - Choose from over 100 teams, including over 60 national and 10 MLS squads.<br>* ESPN presentation - Jack Edwards and Luis \"Gooooaaaal!\" Tapia provide commentary over ESPN visuals, camera angles and sounds.<br>* Build a champion - Play as General Manager of your very own MLS franchise for up to 5 seasons.<br>* Smooth player control - Feel the action with 360 degree analog control of over 500 animations.<br>* Better your game - Training Mode offers beginners and experts alike ways to improve their skills.</p>"},{"name":"ESPN NBA 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20NBA%202K5%20%28Europe%29.zip","filesize":6121340428,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>New to this year's version is the \"Association\", which is a new feature of Franchise mode. With it, Franchise mode features new simulation models and allows you to manage key attributes of your team, such as weekly training and team chemistry.</p><p>Franchise mode also gives you the ability to play games on a play-by-play basis, like a management game, while letting you control everything and giving you replays to see what happened.</p><p>Control wise, the game features the same Iso Motion as found in last year's title, but also gives you options depending on your player. <em>2K5</em> uses a new momentum system which factors the player's ability in deciding what he can do. A short guy, who can't run very fast or jump very high, won't be able to score a lot of dunks.</p><p>24/7, the \"story\" mode of last year's game, has returned with some new features. You get over one hundred new items, a respect system, the ability to play multiplayer games, and new timed mini-games.</p><p>Like all of the <em>2K5</em> titles, this one has the standard ESPN presentation, which includes camera angles, follow-cams, stat overlays, and running commentary. Commentators include Michele Tafoya, who reports from the sideline, and Bill Walton, a hall of famer, as the commentator.</p><p><em>ESPN NBA 2K5</em> has online play over Xbox Live (Xbox only), as well as the PlayStation 2's online service.</p>"},{"name":"ESPN NBA 2Night 2002","year":2002,"developer":"Konami OSA Ltd.","url":"microsoft_xbox_e/ESPN%20NBA%202Night%202002%20%28USA%29.zip","filesize":6517820954,"score":6.1,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Another in a long line of basketball titles and a sequel to ESPN NBA 2Night. This game features updated rosters, new character animations and the obligatory game modes: exhibition, playoffs, season, franchise and also features a soundtrack with musicians like Pete Rock and DJ Hi-Tek. It can support up to four players and features the voice talents of ESPN Sportscenter newscaster Stuart Scott and not only is in conjunction with ESPN but also is endorsed by Tracy McGrady.</p>"},{"name":"ESPN NBA Basketball","year":2003,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20NBA%20Basketball%20%28Europe%29.zip","filesize":6464229332,"score":8.5,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p><em>ESPN NBA Basketball</em> is the follow up to last years NBA 2K3.</p><p>Using Sega's exclusive license with ESPN, the game's presented like you were watching an NBA broadcast. There are stat overlays, pre-game, half-time and end-game shows, action replays, and various other animations.</p><p><strong>ESPN NBA Basketball</strong> has all the standard game modes, from quick game to practice, as well as additional modes, such as one-on-one and street basketball, where you can compete in a variety of games, such as being the first player to score twenty-one. It also comes standard with franchise mode, which lets you lead a team of your choice to victory (or defeat) in multiple seasons.</p><p>The newest and biggest mode of the game is 24/7, which starts you off as a nobody basketball player in a local gym. You must win matches to improve your stats (scoring two three pointers in a row will increase your long shot stat, etc.), and you have to take on \"bosses\" to get further. Beat a \"boss\", and he'll give you his cell phone number, which you can then use to call him for help if you need a partner for a doubles game.</p><p>The game introduces the IsoMotion control systems, which is designed to help you pull off certain moves. By moving the right analog stick, you can perform more advanced dekes, spins and fakes. The IsoMotion moves also have an opposite effect, and using it too much may result in you being charged with a personal.</p><p>Both systems offer online play. The PlayStation 2 lets you play on a narrow or broadband connection, and has PS2 only leagues you can take part in.</p><p>There are a ton of specials to unlock by completing various tasks. If you make a total of fifteen double-double's, you can unlock a new team, or score five hundred points total to unlock some new music or background colors.</p><p><strong>ESPN NBA Basketball</strong> features all the standard NBA teams, including the New York Knicks and the Toronto Raptors. There are also special teams, and the game gives you the ability to create your own player or team.</p>"},{"name":"ESPN NFL 2K5","year":2004,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20NFL%202K5%20%28Europe%29.zip","filesize":5931014165,"score":8.7,"genres":"Sports > 1st-person > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p><em>ESPN NFL 2K5</em> has a ton of new features for the new season.</p><p>To start off, the ESPN presentation has been greatly expanded. Chris Berman, who did voiceover for the half-time show in 2K4, returns for this season. Instead of just voice, there is a virtual Chris Berman, who does an introduction to each game, a half-time report, and a post-game show. To illiustrate certain points, he uses replays from each game. Every move you pull off of every quarter of every game is saved and used in these replays (Xbox only). Suzy Kobler gives reports from the sideline.</p><p>One new feature is the V.I.P. system, which keeps track of how you play the game. If you pass 80% of the time, and run 20% of the time, your V.I.P. profile will reflect this. At a later time, you can play against your V.I.P., and the AI will play as if it were you.</p><p>ESPN celebrates it's 25th anniversary this year, and as such, a special 25th Anniversary Mode has been added. This mode allows you to play moments from classic football games, including The Heidi Bowl and The Immaculate Reception.</p><p>The Crib has an overhaul this year. Instead of earning specific items by completing tasks, you earn points, which you can use to buy items of your choice. New to the Crib is a dart board, as well as a phone, which you will use to answer calls from celebrities. You may get a call from Steve-O, Carmen Electra, Jamie Kennedy, David Arquette or Funkmaster Flex, challenging you to a game.</p><p>Franchise mode also gets an overhaul. New to 2005 is the ability to schedule weekly preps for your team. You can choose to have players work out, play practice games, watch tapes, all in an effort to gear your team up for the next game.</p><p>ESPN NFL 2K5 can be played over Xbox Live, with future support for leagues. The game is also \"always connected\", as long as you have an internet connection. This allows it to keep buddy lists up to date, see friends, receive requests, all the time, whether you're actually playing an online game or not. Roster updates will be available in the future.</p>"},{"name":"ESPN NFL Football","year":2003,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_e/ESPN%20NFL%20Football%20%28Europe%29.zip","filesize":6032116052,"score":8.5,"genres":"Sports > 1st-person > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>While the title of this game boasts the ESPN license, this is actually the next game in Sega's NFL 2K series.</p><p>ESPN NFL Football has many gameplay modes that include quick game, franchise, season, tournament, practice, first-person football, and online play. The most extensive mode in the game is the franchise mode. This mode allows you to play one season after another and comes complete with a draft and off-season player dealings, like signing and releasing players, governed by the real rules of the NFL, where trade deadlines and salary caps are standard.</p><p>Another new feature in ESPN NFL Football is a virtual apartment called 'The Crib.' The Crib serves as a showcase for all of the bonus items and awards you win by completing objectives. The objectives range from simple accomplishments, like looking at certain things in the game's menu, playing for one hour, and playing for five hours, to big play accomplishments, like returning a punt or kick for 99 yards or completing a game without dropping any passes. With every completed objective, you earn a trophy or item that you can use to decorate your crib. The items range from different-looking furniture, like couches and bar stools, to bobble heads and in-game cheats. You can also find hidden free agents, like Michael Irvin, and posters and soundtracks from old Sega games, like Jet Set Radio and previous NFL 2K games.</p><p>Another feature added to this game is first-person football.  This setup was created to give you a virtual experience of what it's like playing on the field.</p><p>Chris Berman again adds ESPN style commentary for the audio track.</p>"},{"name":"ESPN NFL Primetime 2002","year":2002,"developer":"FarSight Technologies Inc.","url":"microsoft_xbox_e/ESPN%20NFL%20PrimeTime%202002%20%28USA%29.zip","filesize":6809573987,"score":5.9,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>ESPN NFL Primetime 2002 is the first football game to combine the NFL license with the ESPN license.  This NFL adaptation boasts a comprehensive franchise mode that introduces some innovations in this standard mode.  One of these is a draft ticker, which puts your team on the clock each time it selects a player in the draft. With the draft ticker on, it is important to scout college players beforehand and analyze draft positions and team needs in order to preselect your team's draft candidates. In simulated games, NFL Primetime gives a variety of coach options. Here you can customize your team's aggressiveness level in offense and blitz tendencies and even set spies on more mobile quarterbacks for simulated games. Naturally, there are also obvious franchise mode options such as the ability to draft, trade, and sign/release free agents over multiple seasons.</p><p>The game also provides the standard football modes of exhibition and season play.</p><p>The cutscenes between plays give the game a TV-style presentation, which borrows graphics from the ESPN Primetime show.</p><p>Chris Berman and his Primetime sidekick, Tom Jackson, provide the commentary during games.</p>"},{"name":"ESPN NHL 2K5","year":2004,"developer":"Kush Games, Inc.","url":"microsoft_xbox_e/ESPN%20NHL%202K5%20%28Europe%29.zip","filesize":6092985809,"score":8.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><em>ESPN NHL 2K5</em> is the second hockey game using Sega's partnership with the worldwide leader in sports, ESPN.</p><p>As with any sports game, you get the standard game modes. 2K5 has a vastly improved Franchise mode over last year's game. In addition to the e-mail system that was introduced, you have the ability to hire several coaches. You can choose a head coach, offensive coach, defense coach, scouting coach, a goaltending coach and more. When it comes time to hire and fire players, you use actual money, and not points to negotiate contracts.</p><p>There are a few special game modes as well. You have access to the skills mode, which was also found in last year's game. You can choose accuracy shooting, puck control, hardest shot, fastest skater, and a few more. There is also a Party Mode, which is set up for one to four players (you and friends or you and the computer), which pits you in fast action games. An example is a free-for-all, where you have to get the puck and score it in the net while the constantly moving cinder wall, which blocks the net, is down.</p><p>Like last year's game, 2K5 features multiplayer hockey over Xbox Live (Xbox) and PlayStation 2's network service. You can jump into a game, or create or join a league of friends and foes.</p><p>The Skybox is back, and it's been slightly improved. Like in <em>ESPN NFL 2K5</em>, you earn points by completing tasks, such as scoring five goals in a single period, winning ten faceoffs, etc. You then use these points to purchase unlockables which will adorn your Skybox or allow you to play as special teams. You can also unlock retro jerseys. Once you win a trophy, it's added to your Skybox, with the Stanley Cup being the center of attention. There are three mini-games you can play from your Skybox; air hockey, shuffleboard, and a trivia machine.</p><p>For those who have an Xbox, you will have the ability to import the music on your harddrive and set songs (or bits of songs) to play for various events. You can choose to play something like Ozzy Osbourne's \"Crazy Train\" for the stadium intro, something uplifting for when you score or something insulting for when you get scored on. If you like doing a lot of work, you can even set different events depending on the stadium, so if you want \"Crazy Train\" to play in Anaheim for the stadium intro, but want \"Dragula\" in Detroit, you can.</p>"},{"name":"ESPN NHL Hockey","year":2003,"developer":"Kush Games, Inc.","url":"microsoft_xbox_e/ESPN%20NHL%20Hockey%20%28Europe%29.zip","filesize":5951031882,"score":8.2,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>ESPN NHL Hockey is the latest addition in Sega's NHL 2K series of games that just happens to add an ESPN license to the graphics and title.</p><p>As in the previous version (NHL 2K3), you can once again perform checks into the benches, pin opponents on the boards, and design penalty killing and power-play strategies.  </p><p>ESPN NHL Hockey adds a revamped franchise mode. This year's franchise mode includes an e-mail system that sends you notices about team injuries, current playoff statuses, and trade deadlines. Even simple words of encouragement are emailed from the team owner.</p><p>The skybox mode acts as a hub for the game's unlockables, stat tracking, and other random features.  There are two new gameplay modes in this year's game: skills and mini-games. Skills mode is a re-creation of the exhibition competitions held during the NHL All-Star weekend. You find a number of different competitions, including the hardest-shot competition, a shoot-out relay, a puck-control challenge, a fastest-skater competition, and a shooting-accuracy challenge. The roster of mini-games include pond hockey, mini-rink, shootout, and super-speed hockey.</p><p>ESPN NHL Hockey has plenty of unlockables, including classic jerseys, teams, and goalie masks. There are even a couple of unlockable mini-games.</p>"},{"name":"ESPN Winter X Games Snowboarding 2002","year":2002,"developer":"Konami OSA Ltd.","url":"microsoft_xbox_e/ESPN%20Winter%20X%20Games%20Snowboarding%202002%20%28Japan%29.zip","filesize":6313217749,"score":6.8,"genres":"Sports > Behind view > Direct control > Snowboarding / skiing > Licensed","desc":"<p>This is the sequel to the previous year's incarnation, ESPN Winter X-Games Snowboarding. This one features 13 professional snowboarders along with 20 authentic tracks sponsored by the Winter X Games. Not only can players compete in authentic events, they can also garner sponsors in order to buy better equipment and can make their own video highlights and show off to friends as well. Players can pull of combos with the \"linking system\", producing wild stunts and gaining higher scores.</p>"},{"name":"Evil Dead: A Fistful of Boomstick","year":2003,"developer":"VIS Entertainment Limited","url":"microsoft_xbox_e/Evil%20Dead%20-%20A%20Fistful%20of%20Boomstick%20%28USA%2C%20Europe%29.zip","filesize":6563871760,"score":6.2,"genres":"Action > Behind view > Shooter > Horror > Licensed","desc":"<p>Ash returns for another round of killing, slashing and destroying the undead.</p><p>On this occasion, with a brand new story based on the world created in the Evil Dead films, Ash can teleport to 4 distinct eras of Dearborn, to not only see how the invasion of the dead took place all those years ago, but to watch in horror as they multiply and control the world they now live in.</p><p>As Ash, you must use his chainsaw for a hand, as well as the trusty shotgun and pistol, new magic abilities (call down a rain of fire or possess the enemy to do the dirty work for you), plus a host of other weapons (grenades, shovels, etc.) to destroy the dead.</p><p>Once you complete a level in story mode, you can go back into that level in arcade mode and attempt to complete a range of challenges (for example, taking down a certain amount of evil in a set amount of time).</p>"},{"name":"Evil Dead: Regeneration","year":2005,"developer":"Cranky Pants Games","url":"microsoft_xbox_e/Evil%20Dead%20-%20Regeneration%20%28Europe%29.zip","filesize":6677464669,"score":6.7,"genres":"Action > Behind view > Shooter > Horror > Licensed","desc":"<p>Taking place right after the events depicted in the movie,<em>Evil Dead 2</em>, Ash is arrested for the murder of the Deadite bodies found at the cabin and convicted. Found psychopathic, Ash is sentenced to Sunny Meadows, an institute for the criminally insane. Though free from the madness that plagued him in the woods, Ash learns that the Necromonicon Ex Mortis, the Book of the Dead has fallen into the hands of Dr. Vladamir Reinhard, the person in charge of the asylum. In the basement, Dr. Reinhard experiments on unlocking the secrets of the Necromonicon. Using a helpless inmate named Sam as a test subject, the mad doctor frees the evil and once again Ash must live the nightmare as evil forces break free and inmates are turned into zombie deadites!</p><p>Evil Dead Regeneration is a third person action game like The Suffering. Players control Ash, who fights with a variety of collectable weapons, which include the trademark chainsaw-hand and shotgun, as well as a pistol, flamethrower, grenade launcher and a harpoon gun to pick up. For the most part, Ash will need to hack and shoot at various zombie creatures until their bodies become weak. At that point the player can press a button to have Ash unleash a finishing move using his weapons. Ash can also collect \"evil essence\" in order to turn himself into \"Evil Ash\", a more powerful version of himself.</p><p>Also along on the quest is Sam, turned into a half-Deadite by Dr. Reinhard, he acts as Ash's sidekick in a quest for revenge. Sam can be controlled after finding certain \"possession\" symbols in the game. Ash can also kick Sam in order to attack enemies and activate puzzles.</p><p>Ash is still voiced by Bruce Campbell while Sam is voiced by Ted Raimi.</p>"},{"name":"Exaskeleton","year":2003,"developer":"Production I.G, Inc.","url":"microsoft_xbox_e/Exaskeleton%20%28Japan%29.zip","filesize":5510422532,"score":"","genres":"Action > 3rd-person (Other) > Visual novel > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>Joe is a competitor in the I.G-1, a mechanized combat sport game. One day, however, reality intrudes on his life, and he and his friends must leave the safety of home to fight on the blasted surface of Earth. His skills from the games, and his Exaskeleton, are the only things that can protect him now.</p><p><em>Exaskeleton</em> is a linear mech-combat game. Each mission in the game is book-ended by long, talking-head dialogue scenes between the various members of Joe's party. Before each mission the model of Joe's (as well as allies, if available) frame can be selected, either the nimble and weak Light Frame, the armored and slow Heavy Frame, or the in between Middle Frame. Two weapon slots are taken up by small arms, either a pistol, machine gun, or grenades, while the other two slots are taken up by more powerful weapons, like missile launchers, sniper riffles, and Gatling guns, with the most powerful only able to be equipped by a Heavy Frame. Weapons have limited ammo and overheat if fired continuously. Each body part of a frame is armored, and after the armor on a part is destroyed any additional damage to that part will damage the frame itself, until eventually the frame is destroyed.</p>"}]