[{"name":"F1 2001","year":2001,"developer":"Image Space Inc.","url":"microsoft_xbox_f/F1%202001%20%28USA%29.zip","filesize":6489687694,"score":7.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Officially licensed Formula 1 racer for the 2001 GP season featuring every car, driver, and track featured in the real life Formula 1 season. </p><p>The game boasts new physics and graphics engines which actually model and take into account track irregularities and bumps, and add some extras like fully animated 3D pit crews. Game modes available are the same as in last year's edition (Quick Race, Test Day, Multiplayer, Grand Prix and Championship) with the addition of the new \"Driving School\" mode, plus a series of brand new driving aids.</p>"},{"name":"F1 2002","year":2002,"developer":"Image Space Inc.","url":"microsoft_xbox_f/F1%202002%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6419769389,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Oceania > Licensed","desc":"<p>Every track, driver, team, and pit crew from the official F1 2002 competition are included in this, the '02 version of the long-standing EA F1 series.</p><p>Drive in a full season, a single race, test sessions (where you can modify your car's setup to increase your cars speed, handling, etc and test them under normal racing conditions) and training, where you can learn the basics and more advanced areas of Formula 1 racing.</p>"},{"name":"F1 Career Challenge","year":2003,"developer":"Visual Sciences Ltd.","url":"microsoft_xbox_f/F1%20Career%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6768380573,"score":7.4,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>F1 Challenge '99-'02</em> spans four entire championship seasons and features accurate team, vehicle, and driver data for each.</p><p>Across the four racing seasons, <em>F1 Challenge '99-'02</em> features 14 different teams, 44 different vehicles, and 17 of the world's most famous racing circuits--some of which have slightly different configurations, depending on the year. The level of detail on the visuals looks to be second to none, with each circuit boasting its own real-life structures, bumps in the track, motion-captured pit crews, animated grid girls, and planes and helicopters in the sky above.</p><p>The cars in the game feature realistic driving physics and damage models that take into account the materials that the various components are made of. Fortunately, players have access to the same kind of data telemetry that real drivers and their teams do, so it should be possible to devise car setups that are appropriate for each circuit and so minimize the chances of crashing.</p>"},{"name":"Fable","year":2004,"developer":"Big Blue Box Studios Ltd.","url":"microsoft_xbox_f/Fable%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":6360096563,"score":7.9,"genres":"Role-playing (RPG) > Behind view > Action RPG > Fantasy","desc":"<p>At the town of Oakvale, in the land of Albion, a boy is sent on an errand by his father to get his sister a birthday present. When the deed is done, destiny unravels: the once peaceful town is suddenly under attack by bandit raids. The frightened child soon discovers his world crumbling in a matter of moments. Lying beside the body of his dead father, the boy is attacked by the gang, but is fortunately saved by a hero called Maze. He is then taken to the Heroes Guild where he is raised. Time has passed and the child has grown, and is ready to take up his own quest to rid the land of monsters and discover who was responsible for the deaths of his family.</p><p><em>Fable</em> is a third-person action role-playing game that casts the player as \"the child\" or \"the hero\" who must perform various deeds to graduate from the Heroes Guild and define himself. The story progresses when the hero chooses \"main quest items\" from the Guild. Alternatively, there are also other quests that the player may complete in order to obtain gold and fame. Some quests allow the hero to \"boast\" in front of his fans. Boasting before a quests adds added difficulty, such as \"completing the quest naked,\" however will allow additional gold and fame to be obtained.</p><p>The game introduces a \"good and evil\" morality system, similar to that of Knights of the Old Republic. Various situations - for example coming across a child being bullied - will force the player to make decisions which ultimately shape the main character. Making decisions deemed \"good\" earns the player good points, while being selfish and \"bad\" earns evil points instead. These decisions not only alter character stats, but also the hero's appearance and even the environment around them. \"Evil\" characters tend to look the part; growing horns, receiving scars and having a swarm of flies buzzing around him. A \"good\" character, on the other hand, might receive a halo and have butterflies swarming. However, other actions such as receiving wounds in combat or casting large amounts of magic also affect the player's appearance.</p><p>Actions also end up impacting the player's reputation, including actions that might be relatively unimportant in other games. For instance, if a player kicks a lot of chickens, various people might start referring to them by the title of \"Chicken Chaser\"; using \"good\" alignment magic might cause people to start calling the hero \"Runemaster\" instead.</p><p>There are three main modes of combat in <em>Fable</em>: melee, ranged and magic. The hero can equip any number of weapons, from swords to axes, and a variety of spells to either harm or help. What the hero wears also determines how people interact with them. Bright, saintly armor tends to make townspeople more willing to talk, while carrying a large axe and blood-red, darkened armor might cause them to be more apprehensive.</p><p>An experience upgrade system allows the player to specialize in one area, or spread throughout, to give the hero a more all-around set of abilities. There are three areas in which experience is gained: Physical, Skill and Will. Physical experience is earned primarily by using melee weapons and can be used to upgrade the hero's strength or health. Skill experience is primarily gained through archery or trading and boosts archery prowess, speed or guile. Will experience is gained through magic usage and is spent on new spells or upgrading old ones.</p>"},{"name":"Fable: The Lost Chapters","year":2005,"developer":"Big Blue Box Studios Ltd.","url":"microsoft_xbox_f/Fable%20-%20The%20Lost%20Chapters%20%28USA%29%20%28En%2CEs%29.zip","filesize":6337533446,"score":8,"genres":"Role-playing (RPG) > Behind view > Action RPG > Fantasy","desc":"<p><em>Fable: The Lost Chapters</em> is a version of Lionhead's Xbox-exclusive Fable, featuring enhancements to storyline and gameplay.</p><p>The game expands the main plot of the original release, continuing it beyond the final confrontation as well as adding nine new areas and sixteen quests. A few characters from the earlier version participate in the storyline more actively and have their own quests. Additional content includes new buildings, monsters, weapons, spells, items, and armor. The protagonist also has more expressions and ways of communicating with people at his disposal. In the computer versions players have the ability to create their own tattoo designs and import them into the game.</p>"},{"name":"Fairly OddParents!, The: Breakin' da Rules","year":2003,"developer":"Blitz Games Ltd","url":"microsoft_xbox_f/Fairly%20OddParents%2C%20The%20-%20Breakin%27%20da%20Rules%20%28USA%29.zip","filesize":6666432222,"score":6.4,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Comedy > Licensed","desc":"<p><em>The Fairly OddParents: Breakin' da Rules</em> is a 3D platformer game based on <em>The Fairly OddParents</em> cartoon. The game starts with Timmy’s parents leaving for a seminar weekend leaving the babysitter Vicky in charge. Timmy accidentally wishes he doesn’t have to follow the rules from Cosmo and Wanda’s fairy rulebook anymore. Cosmo grants this wish with the rulebook falling to the floor, but soon a news bulletin arrives that states that the first person touching the book will gain Cosmo and Wanda’s powers. Moments later Vicky picks up the book spelling trouble for Timmy and the fairies. Cosmo, Wanda, and Timmy are then summoned to the Fairy court. They are found guilty for losing the rulebook and are sentenced to retrieve the rulebook within 49,5 hours or lose their Fairy license forever.</p><p>In the game, you take control of Timmy Turner and have to retrieve the pages from the rulebook through a variety of environments ranging from cyberspace to a medieval castle. Gameplay includes platforming, defeating enemies, and puzzle-solving. As well as collecting wish stars (5 stars for a wish) and crowns (100 crowns for another chance at a failed task). All levels are accessed from different objects in the house.</p>"},{"name":"Fallout: Brotherhood of Steel","year":2004,"developer":"Interplay Entertainment Corp.","url":"microsoft_xbox_f/Fallout%20-%20Brotherhood%20of%20Steel%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6021397813,"score":5.7,"genres":"Action > Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Shooter > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>In a post-apocalyptic future, a society known as the Brotherhood of Steel is born, wielding powerful weapons and armor from the time before the war, they seek to bring some form of order to the wastelands of what used to be the United States. As a new member(s) to the Brotherhood, you'll soon find yourself separated from your comrades and forced to contend with a variety of missions and challenges alone. Radscorpions, Super-Mutants and Deathclaws are all in the Brotherhood's way, and bringing an end to their tyranny will certainly make the wasteland a safer place.</p><p><em>Brotherhood of Steel</em> is an action game set in the <em>Fallout</em> universe. The Brotherhood members are well armed and carry full clips of ammo (which does run out). New weapons of various nature can be found and equipped to bring new tactics. Shooting down enemies earns experience points and these points are used to improve the attributes of various individual skills. Additionally, your character will have to contend with finding keys and other objects, protecting NPCs and jumping over bottomless pits.</p>"},{"name":"Family Guy Video Game!","year":2006,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_f/Family%20Guy%20-%20Video%20Game%21%20%28USA%2C%20Europe%29.zip","filesize":6262148164,"score":5.5,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Shooter > Stealth > Direct control > Licensed","desc":"<p>The Griffin family from Fox's animated TV series makes its way to video gaming for the first time.</p><p>In this action-adventure, which runs like an episode from the show, players control Peter, Brian and Stewie through various goals and adventures.</p><p>After being hit on the head by a satellite dish, Peter wakes up in a hospital believing that Mr. Belvedere (from the 1980's sitcom) has kidnapped his family, and everyone in town is an accomplice.  Peter makes his way through town beating up anyone who gets in his path, in a side-scrolling beat-em-up fighting mode.</p><p>Brian is falsely accused of impregnating Carter Pewterschmidt's prized racing dog Seabreeze.  Brian must escape the police station without being seen and collect evidence proving that he is not the father.  Brian's game mode relies heavily on stealth/espionage gameplay.</p><p>Stewie's battle against his half-brother Bertram continues as Stewie must destroy everything in his path to infiltrate a hospital and the inside of Peter in order to find Bertram's lair and stop him from taking over the world.  Stewie's adventure takes place as a platformer action game with shooting elements.</p><p>Much like the show, there are segues which translate into mini-games that will yield power-ups for each mission if completed successfully.</p>"},{"name":"Fantastic 4","year":2005,"developer":"7 Studios, Inc.","url":"microsoft_xbox_f/Fantastic%204%20%28USA%2C%20Europe%29.zip","filesize":6667136093,"score":6.7,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>This game is a licensee of the 2005 movie \"Fantastic 4\". Unlike many licensed titles, this third-person action game in the vein of the Onimusha or Devil May Cry series only takes the base of its plot from the actual movie, then liberally changes it to make for better gameplay.</p><p>Generally, the game brings in more content from the comic books than the movie, particularly considering the villains that appear. While the movie pretty much only concerned itself with Victor von Doom aka \"Doctor Doom\" as its supervillain of choice, the game brings in various characters from the comic books as well - the Mole Man, the Puppet Master, or Diablo, to name a few.</p><p>The gameplay usually consists of walking the heroic title characters around a level and beating up the various enemies that cross their path. There are mission objectives, but usually, the only way to achieve them leads through the enemies, and just, as usual, the only way to fail them is to be overwhelmed by the Bad Guys. Beating up enemies yields points, which can be used to upgrade characters with new special moves or unlock various bonus materials.</p><p>To spice it all up, developer Seven Studios have also thrown in a co-op mode that allows for playing the normal single-player mission in a tag team with a second player.</p>"},{"name":"Far Cry: Instincts","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_f/Far%20Cry%20Instincts%20%28USA%2C%20Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6245044255,"score":8.3,"genres":"Action > 1st-person > Shooter > Direct control","desc":"<p><em>Far Cry Instincts</em> is an Xbox remake of the original Far Cry PC shooter, but with many changes and enhancements by Ubisoft Montreal, who collaborated with Crytek on this title. The main storyline has not been changed: you are still the charter-boat businessman Jack Carver, who is suddenly attacked while escorting journalist Valerie Cortez to a tropical island. While rescuing Valerie, you get revenge on the soldiers and scientists, and investigate the strange events on the island.</p><p>The Xbox version is true to the original, but adds small twists to the plot (already in the opening scenes) and enhances the game with new gameplay elements. Jack has both offensive and defensive attacks. He can use boats, gliders, water scooters, ATV's and even a hovercraft to move around, and the weapons range from a butterfly knife to rocket launchers. While sneaking, you can use backstab, or branch whips and claymore mines as traps.</p><p>New gameplay elements for the Xbox version are introduced when you are injected by doctor Richard Crowe. His serum gives you predator-like abilities. By killing enemies, resting, or taking physical damage, an adrenaline meter is filled, which can be used to activate feral abilities that enhance your instincts (hence the title) such as feral speed (extreme movement), feral vision (much like night vision), feral smell (trace enemies by odour) and feral strength to blast through doors.</p><p>There are extensive multiplayer options, from split-screen behind a single console to system link with up to 16 consoles connected. Also on Xbox Live, the following modes are available:<em> </em>Chaos*: FFA with a fraglimit.</p><ul><li><p><em>Team Chaos</em>: TDM with a fraglimit.</p></li><li><p><em>Steal the Sample</em>: CTF where the player carrying the stolen sample cannot shoot, but is allowed to toss it to a team mate and then use a weapon.</p></li><li><p><em>Predator</em>: Predators versus a group of mercenaries. The mercs need to activate a transmitter triggering a sonic alarm that kills the creatures. The predators on the other hand (no more than two per game) have a complete set of skills including feral abilities, regeneration and unlimited respawns, while the mercs remain dead when killed.</p></li></ul><p>A map editor has been included as well. You can create, edit and save maps, and then share them with friends.</p>"},{"name":"Far Cry: Instincts - Evolution","year":2006,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_f/Far%20Cry%20Instincts%20-%20Evolution%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6211700337,"score":7.6,"genres":"Action > 1st-person > Shooter > Stealth > Direct control","desc":"<p>In this sequel to Far Cry: Instincts, Carver again finds himself in trouble in paradise. He is approached by a dangerous and seductive woman who recruits him to assist her in pulling a small heist inside a nest of Southeast Asian islands. When the job goes wrong, Jack is framed for the murder of a corrupt local magistrate, and is hunted down by rebel pirates. As Carver tries to find out the truth, he gets deeper and deeper into a conspiracy revolving around the local government, pirates, and rebels - all of whom intend to hunt him down.</p><p>The game features 14 new single and multiplayer missions and new weapons including poisonous darts, Molotov cocktails, pipe bombs, and heavy machineguns as well as new vehicles such as pirate sampan boats, armored technical pickup-trucks and heavy transport trucks. Evolution includes a enhanced and upgraded map editor backwards-compatible with previous versions, a new \"Seek and Secure\" multiplayer mode and the classic multiplayer modes of Chaos, Team Chaos, Steal the Sample and Predator.</p>"},{"name":"Fatal Frame","year":2002,"developer":"Tecmo, Ltd.","url":"microsoft_xbox_f/Fatal%20Frame%20%28USA%29.zip","filesize":6644580267,"score":7.4,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Horror","desc":"<p><em>Fatal Frame</em> is an updated port of Fatal Frame. It adds the following additional content:</p><ul><li>An additional ending</li><li>Eleven new ghosts (only one of which must be fought)</li><li>New unlockable costumes</li><li>A new harder difficulty level</li></ul>"},{"name":"Fatal Frame II: Crimson Butterfly - Director's Cut","year":2004,"developer":"Tecmo, Ltd.","url":"microsoft_xbox_f/Fatal%20Frame%20II%20-%20Crimson%20Butterfly%20-%20Director%27s%20Cut%20%28USA%29.zip","filesize":6496217188,"score":7.8,"genres":"Action > 1st-person > 3rd-person (Other) > Puzzle elements > Survival horror > Horror","desc":"<p><em>Fatal Frame II: Crimson Butterfly - Director's Cut</em> for Xbox is an updated port of the PlayStation 2 game Fatal Frame II: Crimson Butterfly. It is the first version of the game for Xbox. It has the same story and includes all the elements from the PS2 version, but includes these new features not available previously:* Additional ending scene</p><ul><li>New difficulty level</li><li>Optional first-person control/view style</li><li>Several extra unlockable cosmetic accessories</li><li>Six additional unlockable pairs of costumes for Mio and Mayu</li><li>Unlockable survival mode with an additional ghost type</li></ul>"},{"name":"FIFA Soccer 06","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Soccer%2006%20%28USA%29.zip","filesize":6475051291,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p>Featuring a brand new engine (replacing the one used in five titles since <em>FIFA 2003</em>), FIFA 06 features new controls and gameplay, the most visible being more animations and better-detailed ball and player physics and animation, the removal of the unpopular <em>Off the Ball</em> controls implemented in their <em>2004</em> version and remaking the free-kick interface so it's no longer obvious if the player decided for a shot on goal or a pass to a forward. Also new is the concept of \"Team Chemistry\" which affects how well a team plays collectively. </p><p>Featuring 26 leagues from 19 countries, 29 real stadiums and over 10'000 players with data for the 2005-06 seasons, as well as international teams, the game kept the \"Create a player\" feature as well as the many managing options untouched from previous versions. Career mode, the 15-year long climb to the top of the game, features new options such as sponsorships (which will only accept good results), player contracts and more weight on the player morale: a demoralized player (usually from not playing or possible influence from random events) is more likely to underperform as well as pressuring the \"Team Chemistry\" values downwards and might refuse attempts to renew his contract, leaving on a free transfer.</p><p>While there are still many unlockables in the game (mostly third kits), the way to earn points changed. Instead of gaining points from completing tasks (from entering the EA Trax or creating a player to winning the Champions League or completing a career), the player has over 100 scenarios to way in five difficulty levels.</p>"},{"name":"FIFA Soccer 07","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Soccer%2007%20%28USA%29%20%28En%2CEs%29.zip","filesize":6399575713,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>Enhancing the engine debuted with the previous game and official 2006 World Cup game, FIFA Soccer 07 includes enhanced ball and player collision physics and more player animations adding to the 16 trick moves and first touch ball reception introduced to the game engine with the previous games in the series. Players can choose between 2 and 10 minutes halves in three different game speeds and four different difficulty levels. Over 510 teams are accurately represented in the game. 27 leagues from 20 nations are included, along a \"Rest of the World\" for the best teams in championships left outside the game and international teams. Spain, England (with two), France, Germany, and Italy also feature second divisions. Players can also create two clubs, customizing their badge, kits and home stadium, selecting players from anywhere in the game, along with the starting budget in manager mode. The player creation tool remains mostly unchanged, with the ability to customize everything, from faces (with a complete set of options, from jaw width to eyebrow shape) to the appearance and playing abilities.</p><p>While the focus of this yearly update was on the game engine, the Manager mode was also enhanced: players now also improve their playing ability from being active members of the squad, forcing the player to choose between keeping his celebrated stars near retirement in the starting eleven or give the benefits of the youth system a chance to shine. Another new feature, in what is now the primary mode of the series, is the ability to watch the game in a simplified text mode, with the ability to jump into action to turn the events still available. The points system was replaced by a less abstract currency model (with the ability to choose between Pounds, Euros or Dollars). Other game modes include Tournaments (including the creation of custom tournaments) and Challenges. By completing challenges (similar to the Global Challenges mode in World Cup 2006) the player can spend points in the Fanshop with items such as new teams, a special overhead camera, new balls from Adidas (including all original World Cup balls from 1974 to 2002), stadiums, third kits and special celebrations for created players.</p><p>Finally, online gaming received a new mode: Interactive Leagues. These are online-only leagues based on the fixtures of their real counterparts (English Premier League, French Ligue 1, German Bundesliga, and Mexican 1st division). Then, online players go head-to-head with their favorite teams with a victory counting one vote for their favorite team. Once the week is over, the team with more votes is declared the winner of the week, getting three points. The number of weekly matches a player can do in this mode is unlimited.</p>"},{"name":"FIFA Soccer 2003","year":2002,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Soccer%202003%20%28USA%29.zip","filesize":6638501135,"score":7.8,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Direct control > Multiple units/characters control > Football (European) / Soccer > Licensed","desc":"<p>FIFA 2003 continues the trend of improving each year's new release by keeping the formula that worked, while also adding new features to make the game more enjoyable.</p><p>Some of these new features including a \"Freestyle\" control, which is activated by the right thumbstick, causing you to do special moves, such as a deke, or kick the ball a fair length forwards to gain some speed.</p><p>New and improved \"dead ball\" control makes corner kicks, free kicks, etc. more controllable and gives you more options.  The passing game has been improved to allow better passing by kicking directly to a teammate, passing to nowhere in particular, or open passing to allow anybody to take it.</p><p>FIFA 2003 includes all FIFA clubs, leagues, and players.</p>"},{"name":"FIFA Soccer 2004","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Soccer%202004%20%28USA%29.zip","filesize":6080225560,"score":7.6,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>FIFA Soccer 2004</em> features eighteen leagues, with thirty-five national teams and over ten thousand players. Take them into a multi-season career, or individual tournaments or matches.</p><p>Like EA's other 2004 games it has an in-depth career mode, where you must manage your budget and team. Promote players, demote players, and renegotiate contracts, all in an effort to get your team to the finals again and again.</p><p>The skills to master range from kicked passes and headers to lob passes and bicycle kicks. You can take control of players before the ball reaches them, which makes it easier to find space to take the ball. Like other 2004 titles, <strong>FIFA</strong> uses the right analog stick for it's Freestyle gameplay.</p><p>Console versions use the EA Sports Bio, whereby you can continue to improve your gamer level and unlock rewards by playing other 2004 titles, such as Madden NFL 2004 or NBA Live 2004.</p>"},{"name":"FIFA Soccer 2005","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Soccer%202005%20%28USA%29.zip","filesize":6532681514,"score":7.6,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer > Licensed","desc":"<p>Released only a few months after <em>Euro 2004</em>, FIFA 2005 brings several features to the franchise, such as the return of a player creation tool, where a player can be created from scratch from customizing the face (while it's not possible to define the texture like in previous EA Sports games such as <em>NHL 2000</em>, the player can customize the facial features such as shape of the eyes or the cheeks, in a way similar to RPGs such as Neverwinter Nights), accessories and playing abilities. It's also possible to create all kinds of competitions. The Career mode was also extended, allowing now up to 15 seasons, and giving the player the chance to turn the tide of a simulated match anytime. This mode is a \"light\" managerial mode, where the player not only plays, but also signs new players and increases the club's abilities in trainers, medical staff, and other club staff).</p><p>The main gameplay change was the addition of \"First Touch\" controls. By performing one of the \"trick\" moves before the player gets possession of the ball it's possible to do a number of moves, such as touching the ball forward to gain a few yards ahead of the defenders or touch the ball to one side, and roll to the other of a rushing defender, and then pick up up the ball a bit ahead leaving the opponent stranded, and the inclusion of a fake shot move, which allows forwards to sit a goalkeeper before scoring in style or make defenders jump from their positions, opening room for a through pass or a run into the goal. Other aspects of the game, such as the \"Off The Ball\" controls (allows the control of players that aren't in possession, moving them into an open position) remain unchanged.</p><p>Another new feature is the FIFA Shop, where the player can trade points earned in many ways, from simple tasks like having a peek at the Jukebox to obtaining 10 victories in a row in Career mode, for several items, such as third jerseys, additional music, more balls and night stadiums.</p><p>As it became the norm with the series, the game features 18 leagues and 38 national teams (some of these, due to licensing problems feature only generic kits and logos), summing up to around 11,000 real footballers.</p>"},{"name":"FIFA Street","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Street%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6620913110,"score":6.4,"genres":"Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (European) / Soccer > Licensed","desc":"<p>As a spin-off of the FIFA lineage, <em>FIFA Street</em> combines arcade action with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flair, and individual style.</p><p>Leading this movement are the world's top professional players, showing off their skills and individual style in 4-on-4 match-ups against the backdrop of global venues that represent the true culture of street soccer. In the game's dynamic 1-on-1 encounters, beating your opponent will require skill, technique, and the careful selection of specific moves. Take on the best and earn their respect, gradually building your reputation and team into an unstoppable force, that leads the tide of street soccer.</p>"},{"name":"FIFA Street 2","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20Street%202%20%28Europe%29%20%28En%2CFr%2CDe%2CNl%29.zip","filesize":6445489011,"score":6.6,"genres":"Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (European) / Soccer > Licensed","desc":"<p>Take your skills out of the stadium and into the street in EA's second installment of the FIFA Street franchise. <em>FIFA Street 2</em> includes a new trick stick control mechanic, improved tricks, and a skill-testing juggle mechanic. You can dupe your opponent, juggle the ball on your knees and shoulders, and there are various new combos to show off. Pick from 20 teams from around the globe and watch over 300 of your favorite football stars duel it out in 4-on-4 match-ups. Select from 10 playable venues ranging from London's Westway Leisure Center to the sandy beaches of Brazil.</p><p>You can do quick matches (Play Now), change the looks and skills of players in the Creation Zone, and design your own venue. The main game modes include Friendly, Rule the Street (the career mode), and Skills Challenge where you can show off your football tricks. The career mode adds new goals in this version, based on acquiring a certain amount of skill points, scoring lots of goals, or scoring only with gamebreakers. You can select a radio station to play during the matches, mixing music with commentary.</p>"},{"name":"FIFA World Cup: Germany 2006","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/FIFA%20World%20Cup%20Germany%202006%20%28Europe%29.zip","filesize":6564141445,"score":7.4,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (European) / Soccer > Europe > Licensed","desc":"<p>Released one month before the actual World Cup 2006, this game lets players play all the matches before they even started. Featuring 12 official German stadiums and all the teams that qualified for the World Cup 2006 in Germany, plus additional teams and unlockable classic players. The playable modes let you try any of the qualifying stages or skip right to the world cup mode assuming as one of the qualified teams. Additional modes include Global Challenge where you can replay 40 historical moments in football history to change the outcome and various multiplayer matches.</p>"},{"name":"Fight Club","year":2004,"developer":"Genuine Games, Inc.","url":"microsoft_xbox_f/Fight%20Club%20%28USA%2C%20Europe%29.zip","filesize":6613768331,"score":4.1,"genres":"Action > 3rd-person (Other) > Fighting > Licensed","desc":"<p><em>Fight Club</em> is based on David Fincher's film adaption of Chuck Palahniuk's novel of the same name. Fed up with consumerist American culture, a fight club is founded as a new type of therapy through bare-knuckle fighting. The game focuses on the fights and uses many characters and environments from the original story. You can create a new fighter or clone one of the generated characters. There are three general fighting styles to choose from: grappling, kung fu or brawling. The moves range from basic punches to devastating moves with broken bones, ripped clothes and real-time facial deformation. After each successful fight, you earn Character Development Points (CDP's) which can be used to upgrade or heal your character.</p><p>Aside from the regular arcade, survival and training mode, there is a story mode in which you need to work your way up as a rookie to become a key player in Project Mayhem in a storyline very loosely based on the original plot. Both the PS2 and Xbox version have an online multiplayer mode as well.</p><p>The game music has tracks by famous bands such as The Dust Brothers, Limp Bizkit, Korn and Queens of the Stone Age.</p>"},{"name":"Fight Night 2004","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_f/Fight%20Night%202004%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6552281405,"score":7.8,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p><em>Fight Night</em> is EA Sports' new boxing series, replacing the previous <em>Knockout Kings</em> line of games.</p><p>You have the option of creating your own personalized boxer, and entering a career mode, where you start off on the lowest rung in dirty, rundown gyms, as you make your way up the ropes to become the undisputed champion. Throughout your career you will have to battle many enemies, all vying for the same title. As you play, you will be able to train, improving your boxer's stats. You can hit a punching bag to increase power and speed, spar with an opponent for more stamina and agility, attack the dummy to improve chin and body, or hit the mitts to improve heart and cut. Besides career mode, you have access to the standard modes.</p><p><em>Fight Night 2004</em> features the \"Total Control\" system, which utilizes both sticks to give you complete percision over your boxer's moves. The right analog stick controls all the punching, and the left stick controls movement and defense/blocks.</p><p>There are several unlockables available, all of which must be earned through career mode. You can buy new clothes, entrance music, even new girls to accompany you to the ring.</p><p>The PlayStation 2 version of <em>Fight Night 2004</em> supports online play via EA Sports' online network.</p><p>As with all other EA Sports titles, <em>Fight Night 2004</em> utilizes the EA Sports Bio, which tracks your progress through all EA Sports games. The more games you play, the longer you play them, and the better you do translates into a higher Gamer Level. When you reach certain levels, you can unlock special rewards.</p>"},{"name":"Fight Night Round 2","year":2005,"developer":"Electronic Arts Chicago","url":"microsoft_xbox_f/Fight%20Night%20Round%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6614847727,"score":8.2,"genres":"Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>EA's Fight Night returns in its second installment. Once again, you can create a new boxer and start a career that begins as an amateur in a shady gym somewhere in Queens, NY, and fight your way up to the top. Alternatively, you could relive the careers of some legendary boxers.</p><p>Of course, you could go for a simple match with either a computer or a live opponent.</p><p>Round 2 offers many new features, like fancy particle effects that show blood and sweat spraying into the camera in ultra slow-motion. The \"Total Boxer Control\", which lets you throw punches by making certain movements with the analog stick, has been improved. There are also many ways to customize the appearance of your character, up to the shaping of the cranium and ears.</p><p>The soundtrack consists of a dozen contemporary (but unfortunately edited) hip-hop tracks.</p><p>All the previous features are still there too: You can play online (now on Xbox too), and you can unlock more moves, clothes, and equipment as you proceed in career mode.</p><p>Also, included in the GameCube version is a port of the SNES game Super Punch-Out!!</p>"},{"name":"Fight Night Round 3","year":2006,"developer":"Electronic Arts Chicago","url":"microsoft_xbox_f/Fight%20Night%20Round%203%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6458192840,"score":8.3,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing","desc":"<p>EA Sports' <em>Fight Night Round 3</em> from EA Chicago lets you make your own fighter, train them up, and literally take on the world. </p><p>Start by creating your own champ and customizing how they look, what equipment they have, their fighting style, their weight class, their signature move, and even their own illegal hit. Get equipment and trainers for your fighter to enhance his look and performance.</p><p>Then take your fighter to career mode where you'll play fight your way up from the local gym all the way up to five-star venues. Get trainers to enhance your training and boost your speed and power. Play against randomly generated fighters all the way up through the ranks till you beat them in points or to a pulp. Certain fights may get you a bit of extra money as an incentive, or give you a promotional deal, but pick your fights carefully because strategy inside the ring won't matter if you mismanage your fisher outside.</p><p>Fight smart during the fight by using the total punch control system to throw the punches you want to by using the analog stick. The total punch control system maps your fists to the analog stick getting rid of the need for senseless button mashing.</p><p>You can also play in historical fights like Taylor vs. Hopkins, Gatti vs. Ward, or Robinson vs. Lamotta in the ESPN Classic mode to play in the fights that made boxing history.</p><p>Once you've got the computer down for the count, you can play with any fighter or user created fighters or any of the ESPN Classic fights in local multiplayer with a friend. You can also take the fight online and prove your the real champion of the world against any opponent anytime, anywhere.</p>"},{"name":"Fila World Tour Tennis","year":2002,"developer":"Hokus Pokus","url":"microsoft_xbox_f/FILA%20World%20Tour%20Tennis%20%28Europe%29.zip","filesize":6784899939,"score":6.1,"genres":"Sports > 3rd-person (Other) > Isometric > Tennis > Licensed","desc":"<p><em>Fila World Tour Tennis</em> is a tennis simulation with a focus on fast-pace matches. The heart of the game is the career mode where the player creates his character and starts on place 100 of the world ranking. To become number one he has to win matches and tournaments - but he is on a very limited budget. Every participation costs money and if the first match is no success the career is practically over. </p><p>The player character also has stats which have an influence on the performance. These can be improved by buying better equipment or absolving costly training sessions which are mini games like hitting balls through rings. Other playing options are instant matches or single tournaments.</p><p>The game features 50 pre-created player characters and 24 courts which have to be unlocked in the career mode. The license is restricted to the sportswear.</p>"},{"name":"Final Fight: \"Streetwise\"","year":2006,"developer":"Capcom Studio 8, Inc.","url":"microsoft_xbox_f/Final%20Fight%20-%20Streetwise%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6187353936,"score":4.6,"genres":"Action > Behind view > Beat 'em up / brawler","desc":"<p>The player takes the role of Kyle Travers, an underground pit fighter and brother of Cody Travers from the original Final Fight series. Cody has been kidnapped and, as a new drug plunges modern day Metro City into chaos, Kyle must rescue his older brother. </p><p>The game itself is non-linear 3D beat-em-up. Unlike the previous games, players can interact with NPCs as well as pursue new side missions. An all-new combo system has also been incorporated in which the player can buy new moves to expand Kyle's moveset as the game progresses. Like the previous games, players can pick up various objects like pool cues, shotguns, and lead pipes to use in combat.</p>"},{"name":"Fireblade","year":2002,"developer":"Kuju Entertainment Ltd.","url":"microsoft_xbox_f/FireBlade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6519753505,"score":6.9,"genres":"Action > 3rd-person (Other) > Shooter > Helicopter","desc":"<p>An elite anti-terrorist force, Fireblade has been mobilized to take care of a dangerous terrorist group known as \"United Eastern States\", who are plotting to develop weapons of mass destruction.</p><p>Piloting the powerful attack helicopter through various missions, you must take out a range of enemy units, from military bases hidden in the middle of nowhere to other attack craft (both air and ground-based). The Fireblade includes a range of weapons to use during each mission, such as swarm missiles, cannons, and homing missiles.</p>"},{"name":"First Battalion","year":2006,"developer":"ZootFly, LLC."},{"name":"FlatOut","year":2004,"developer":"Bugbear Entertainment Oy","url":"microsoft_xbox_f/FlatOut%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6800162714,"score":7.4,"genres":"Action > Racing / Driving > 1st-person > Behind view > Tricks / stunts > Direct control > Automobile > Off-roading > Track racing > Regional differences","desc":"<p>FlatOut is a driving game where crashing your car can be more fun than racing it. You drive muscle cars around dirt tracks, battle them on destruction derby arenas, and take part in Ragdoll Olympics. That last one may need some explanation. When you crash in FlatOut, your driver (the Ragdoll) is flung through the windscreen, very much like in Rekkaturvat. This feature is used in the Ragdoll sports where the task is to propel the hapless driver as far, as high, or as accurately as possible. On the demolition arena the goal is to wreck other cars before yours is. Simple as that.</p><p>The bulk of the game is racing though and it can be performed in typical quick race and time trial modes in addition to the proverbial career mode. There are also two different handling modes for the cars. Normal mode gives arcade type handling, suitable for gamepads. Professional mode seems to be designed for steering wheel owners and provides very challenging simulator-type handling. Not surprisingly since Bugbear's previous racing title Rally Trophy was considered to be very challenging, even demanding, simulation.</p><p>Bugbear's experience with simulation dynamics shows in FlatOut. Almost everything on the track can be run into and it behaves as it should in real life. Or at least as in a car-chase movie. Stuff that cars scatter around are there on the next lap too and cars are gradually dismantled when hit to other cars or solid objects around the track.</p><p>Multiplayer modes are of course great party hits. Depending on platform, FlatOut has hotseat, split screen, LAN, and/or online multiplay modes.</p>"},{"name":"FlatOut 2","year":2006,"developer":"Bugbear Entertainment Oy","url":"microsoft_xbox_f/FlatOut%202%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6713542237,"score":7.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Tricks / stunts > Automobile > Off-roading > Track racing > Regional differences","desc":"<p>As in FlatOut your goal is to drive as reckless as you can and still win the race. But contrary to its predecessor, <em>FlatOut 2</em> is now a complete arcade-racing game.</p><p>The core of the game is the career mode which features 3 different racing-classes: Derby, Race and Street. Every class is also divided into 3 levels. You begin your career in the derby class level 1. Here you drive old, wrecked cars straight from the dump. As you progress to the race class and finally to the street class you can buy better and faster cars which you can then also tune to your needs, like installing a new engine.</p><p>Inside the classes you find different kinds of events: from normal races over Destruction Derbies to stunt events. All of the events feature a fully destructible environment. This is not only eye-candy but is also required to fill up your nitro and handicap your enemies.</p><p>If you get bored of that, you can play one of the 12 mini-games. Like in FlatOut your goal here is to do all kinds of crazy stuff with your driver. You can use him as a football, throw him through burning rings and more. These mini-games can also be played with up to 8 players on one PC in a hot-seat mode.</p>"},{"name":"Flight Academy","year":2002,"developer":"Aqua System Co., Ltd.","url":"microsoft_xbox_f/Flight%20Academy%20%28Japan%29.zip","filesize":6723614758,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Flight / aviation","desc":"<p><em>Flight Academy</em> is a civil aircraft flight simulator. In the game you can fly various passenger planes and fly over Japan and a large portion of the pacific. You can land and take off from multiple Japanese airports.</p><p>In the game you first have to get your flying license before tackling one of the 17 available missions.</p><p>The game world is build up from satellite pictures and features real time day and night changes and changing weather conditions.</p>"},{"name":"Ford Bold Moves Street Racing","year":2006,"developer":"Razorworks"},{"name":"Ford Mustang: The Legend Lives","year":2005,"developer":"Eutechnyx Limited","url":"microsoft_xbox_f/Ford%20Mustang%20-%20The%20Legend%20Lives%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6727270133,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>The Ford Mustang is featured in its very own game, as players can choose from 40 different models ranging from the original 1964 Mustang all the way up to the 2005 version. Career mode and \"coin-op\" Challenges provide a test of driver skill as you unlock new cars and tracks, all while racing against AI drivers and dealing with traffic. New York City is one of seven U.S. cities you will race through, with 22 different layouts overall. Multi-player is supported for 2 players.</p>"},{"name":"Ford Racing 2","year":2003,"developer":"Razorworks","url":"microsoft_xbox_f/Ford%20Racing%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6889638271,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>If you love Fords and racing, you'll get a chance to live out your fantasies in <strong>Ford Racing 2</strong>.</p><p>Drive Mustangs, Thunderbirds, concept cars, stock cars, exotic sports and race cars - even F-Series pick-up trucks. Choose from 32 models, legendary classics as well as futuristic supercars, like the Ford GT (classified under these categories in the game: Living Legends, Movie Stars, SVT, Concept, Off Road, Custom and Stock Car).</p><p>The 16 graphically detailed venues include road race tracks, off-road (over desert and jungle terrain), high speed oval speedways and race circuits. There are different competition types to test your driving skills including: Time Attack, Elimination, Racing Line, Driving Skills and more.</p><p>You select the amount of driving control you want. Standard gives you automatic transmission, anti-lock brakes and traction control. Choose Advanced for more precision driving with a manual transmission and more option selections. Learn the controls of the game in \"Quick Race\" which automatically selects a car for you and puts you on a pre-selected track. Then choose the \"Single Player\" to race with computer opponents or \"Multi Player\" for head-to-head competition with a friend. Select from different background music types (rock, funk etc.) to further customize your experience.</p><p>Views can be toggled between 1st and 3rd person perspective. On screen in the first person view, the speedometer, tachometer, rear view mirror, are shown as well as a map on left side showing your current location and nearby competitors. Classic car dash panels differ from more modern cars, too. Depending upon your perspective, you'll see your lap times, overall position, rpms and speed.</p>"},{"name":"Ford Racing 3","year":2004,"developer":"Razorworks","url":"microsoft_xbox_f/Ford%20Racing%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6875375314,"score":6.4,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>Ford Racing 3 is the sequel to Ford Racing 2.</p><p>Now there are 55 Ford models available (Ford GTs, Thunderbirds, concepts, SVT vehicles, Mustangs and Trucks) and you unlock them as you win the races.</p><p>Twenty six tracks are available, including road, off-road and oval ones, in different environments (snow, mud, water, mountain trails, beach, race tracks and more).</p><p>It has 2 play modes: Ford Competition and Ford Challenge. In Ford Competition you run 14 thematic cups. In Ford Challenge, you run single races in different game modes: boost, relay, overtake, elimination, duel, drafting, driver skills, seconds out, race line and time attack. As you win the races, you collect Ford cars, tracks and race types.</p><p>The multiplayer mode allows you to play via LAN (only for PC) and split screen mode (on PS2 and Xbox).</p>"},{"name":"Ford Vs. Chevy","year":2005,"developer":"Eutechnyx Limited","url":"microsoft_xbox_f/Ford%20vs.%20Chevy%20%28USA%29.zip","filesize":6701294087,"score":"","genres":"Racing / Driving > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Pick from one of the 48 accurately modeled classic and contemporary Ford and Chevy vehicles to try and win the Westington Cup. </p><p>Pick your side, either Ford or Chevy, and compete in circuit races, point to point races, time trials, drag races, and other events. Work with your teammates to gain a leg up on your opponents by choosing when to play aggressively and ram them to gain position and when to block them from trying to steal your position. Tweak your car to get the most performance possible by getting over a hundred parts from over twenty manufacturers. </p><p>Play against a friend in split screen mode or up to 5 other people either online or via system link.</p>"},{"name":"Forgotten Realms: Demon Stone","year":2004,"developer":"Stormfront Studios","url":"microsoft_xbox_f/Forgotten%20Realms%20-%20Demon%20Stone%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6098865719,"score":6.9,"genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Centuries ago two unspeakably evil forces were entrapped in a Demon Stone while battling each other. Now three adventurers happen to meet by chance and discover the Demon Stone just as it breaks and releases the two spirits: a Githyanki general and a Slaad lord. Now only these three can prevent a war that will sweep over all Faerun.</p><p><em>Forgotten Realms: Demon Stone</em> is an action RPG set in the world of <em>Dungeons &amp; Dragons: Forgotten Realms</em>. Take control of three heroes, Rannek the fighter, Illius the sorcerer, and Zhai the rogue, as they try to destroy the evil unleashed by the breaking of the Demon Stone. </p><p>The player only controls one character at a time but can switch between them on the fly with the direction pad. Each character has his/her own attack and can perform combos by pressing certain button combinations, e.g. B + B or A + B + A, and even perform team attacks and a team super attack. As they gain experience they will gain levels and can purchase new moves (combos) or upgrade old ones with experience points. They also collect gold with which they purchase new weapons, armor, and accessories at the end of each chapter.</p>"},{"name":"Forza Motorsport","year":2005,"developer":"Turn 10 Studios","url":"microsoft_xbox_f/Forza%20Motorsport%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CPt%2CZh%2CKo%29%20%28Rev%201%29.zip","filesize":6625585142,"score":8.9,"genres":"Racing / Driving > 1st-person > Diagonal-down > Direct control > Automobile > Street racing > Licensed","desc":"<p><em>Forza Motorsport</em> is a racing game with extensive customizability, similar to the Gran Turismo series. There are 30 tracks and over 230 cars with a unique feel that can be modified to the smallest details, from spoilers to decals, and the option to create your own shapes with 100 different layers for a single car. Every single part influences the car behaviour - even the G-forces are taken into account, with a realistic damage model.</p><p>The game modes include a career mode with different classes, time trials, free runs and arcade races. In the career mode, winning races unlocks manufacturer relationships and you can earn money to buy new cars or customize your vehicles. This mode is expanded over Xbox Live with human opponents.</p><p>Forza also includes Drivatar technology, where you can train the computer AI to copy your driving skills (the way you approach corners, the amount of brake applied) and then let the AI race for you to move quickly past certain courses. Over Xbox Live, you can organize your own competitions, start a car club with a team of drivers, exchange cars, download ghost cars to improve your race times, compete on over 1400 leaderboards and acquire new car setups.</p>"},{"name":"Freaky Flyers","year":2003,"developer":"Midway Home Entertainment, Inc.","url":"microsoft_xbox_f/Freaky%20Flyers%20%28Europe%29.zip","filesize":6445814282,"score":6.1,"genres":"Action > Racing / Driving > Behind view > Arcade > Flight / aviation","desc":"<p>This cartoon style racing game replaces the usual kart formula with planes (and all sorts of flying technology, such as UFOs, flying carpets, and plenty more). </p><p>Choose from one of the many different, and wacky, characters and take to the sky over various locations, each with its own set of obstacles and shortcuts. Each character has a different level of ability (for example, one may be highly accurate in cornering but slow, while another is much faster but less responsive in turning).</p><p>Apart from the usual race modes, you can also take on a 4 player race (split-screen only).</p>"},{"name":"Freedom Fighters","year":2003,"developer":"Io-Interactive A/S","url":"microsoft_xbox_f/Freedom%20Fighters%20%28Europe%29.zip","filesize":6476755414,"score":7.8,"genres":"Action > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p>The Soviet Union has invaded New York City! Chris Stone is just a plumber, and he was willing to live out his life normally even after the occupation until the Soviets picked up his brother Troy and charged him for being a terrorist (i.e. freedom fighter). Now Chris must contact the real freedom fighters, get his brother out, and eventually, drive the invaders out of New York.</p><p><em>Freedom Fighters</em> is a third-person shooter with squad-based tactics, with a variety of typical weapons such as pistol, revolver, assault rifle, submachine gun, shotgun, rocket launcher, grenade, and so on. As you proceed further in the game, you can control more and more people in your squad, until you end up with up to a dozen different freedom fighters all fighting alongside you in your quest to drive out the invaders.</p>"},{"name":"Freestyle MetalX","year":2003,"developer":"Deibus Studios Ltd.","url":"microsoft_xbox_f/Freestyle%20Metal%20X%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6752146687,"score":7,"genres":"Racing / Driving > Sports > 3rd-person (Other) > Tricks / stunts > Motorcycle > Licensed","desc":"<p><em>Freestyle MetalX</em> is, as the name implies, a motocross stunt game. It contains 9 pro riders and twelve licensed bikes to begin with, plus some secret ones. It is structured somewhat like the Tony Hawk series with a career mode that is a succession of levels, each one containing goals like doing specific tricks, finding gaps and finding things, which could take the form of breaking windows, running people over, etc. In this case, there are also racing goals. Each goal gives you money, which can be used to unlock new riders, bikes, and levels.</p><p>Controls consist of an accelerator, brake, and clutch along with jump, trick and trick modifier buttons. The modifier can be used to turn a superman into a nothing superman, for instance. Wheelies are controlled with the right analog stick.</p>"},{"name":"Freestyle Street Soccer","year":2003,"developer":"Silicon Dreams Studio Ltd.","url":"microsoft_xbox_f/Freestyle%20Street%20Soccer%20%28USA%29.zip","filesize":6700003035,"score":5.7,"genres":"Sports > Diagonal-down > Football (European) / Soccer","desc":"<p><em>Freestyle Street Soccer</em> known as <em>Urban Freestyle Soccer</em> in Europe is, as the name implies, a Freestyle soccer-game in an urban setting. The game focuses on action and fun instead of realism. You play four on four in five game modes: Turf War, Home Turf, Street Challenge Cup, Exhibition and Multiplayer. The first requires you to conquer neighborhoods in the city by winning soccer matches against rival gangs. Street Challenge Cup allows you to play an entire competition.</p><p>Each player can perform a large variety of moves beyond the typical soccer game moves, such as scissor kicks, midair juggles, and bicycle kicks. Performing said moves allows you to gain skill points that can be used to unlock new game modes, teams, courts, and cheats. Next to these special moves, you can also interact with the environment. Your players can pick things up and throw them around or manually hit your opponents.</p>"},{"name":"Frogger Beyond","year":2002,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_f/Frogger%20Beyond%20%28USA%29.zip","filesize":6433343942,"score":5.6,"genres":"Action > Top-down","desc":"<p>Frogger just got back from his adventure at the Temple of the Frog and is enjoying life in the swamp. Before long, it's his birthday, and he is summoned to the Elder Council. Frogger has come of age, and it is time for him to complete his rite of passage. Each of the 8 council members will send Frogger to a different world, where he will be tested to prove his readiness to be a teenage frog.</p><p>This game follows the gameplay model seen in the Game Boy Advance Frogger games. You play the game from an overhead view and must move Frogger to the end of many maze-like, trap ridden levels.</p>"},{"name":"Frogger: Ancient Shadow","year":2005,"developer":"Hudson Soft Company, Ltd.","url":"microsoft_xbox_f/Frogger%20-%20Ancient%20Shadow%20%28USA%29.zip","filesize":6685698608,"score":5.9,"genres":"Action > Diagonal-down > Arcade > Puzzle elements","desc":"<p>While his friend Lumpy is away, Frogger learns from his girlfriend Lily that the evil crocodile Dr. Wani is threatening Firefly Swamp.  He must save his home by solving puzzles, collecting gold coins and dodging hazards. In addition to running and jumping, Frogger can also manipulate objects with his tongue. The game's single-player story mode spans seven worlds and twenty-eight levels. The story levels can also be played in a timed challenge mode, and there is a multiplayer battle mode with a variety of scenarios. It is also possible to unlock the original Frogger arcade game.</p>"},{"name":"Full Spectrum Warrior","year":2004,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_f/Full%20Spectrum%20Warrior%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.zip","filesize":6304548884,"score":7.6,"genres":"Action > Strategy > 3rd-person (Other) > Shooter > Tactical shooter > Contemporary","desc":"<p>In <em>Full Spectrum Warrior</em>, you take on the role of commander of two squads of the United States military, Alpha and Bravo, as you guide them in the fictional country of Zekistan on a mission to capture or kill the terrorist Al Afad.</p><p>In this game, you don't directly control your troops. You don't take aim at a target and shoot, and you don't circle-strafe around enemies. Instead, you tell your squad what to do, and they'll do it. It's like a real-time strategy game. You can tell your two squads to do numerous things, such as hide behind a wall, take cover behind a car, lob a grenade, fire off a rocket, or attack a target. You will need to utilize both squads to be successful. For example, you can have Alpha squad hide behind a car and lay down covering fire at a target that you can't directly kill, giving Bravo squad cover so they may cross open terrain, and get into a position where they will be able to kill the enemy.</p><p>The game takes place in one location, a Middle Eastern country, that is split up into several areas. You will have to make your way through parks, an airport, city streets, and even some buildings. Throughout the country are many terrorists, all of whom are trying to kill you. You have four members on each squad; the team leader, automatic rifleman, grenadier and rifleman, each playing a unique role.</p><p><em>Full Spectrum Warrior</em> supports Xbox Live, where two players can play through the single player campaign. Instead of controlling both squads, one player controls Alpha while the other controls Bravo.</p>"},{"name":"Full Spectrum Warrior: Ten Hammers","year":2006,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_f/Full%20Spectrum%20Warrior%20-%20Ten%20Hammers%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6546224423,"score":7.1,"genres":"Action > Strategy > Behind view > Shooter > Contemporary > Regional differences","desc":"<p><em>Full Spectrum Warrior: Ten Hammers</em> is the successor of Full Spectrum Warrior.</p><p>Although you killed the tyrant of Zekistan in the first game, the situation hasn't improved. A civil war begins to unfold and various insurgencies fight against the Western forces. Even ethnic hostilities erupt in violence. So once again squads of US Light Infantry are send into the country to secure the Tien-Hamir (or \"Ten Hammers\") Province. But this time they can call upon the assistance of the British elements of the Coalition Forces.</p><p>Like in Full Spectrum Warrior you are the commander of two Fire Teams called Alpha and Bravo. But now you can brake down a Fire Team to a Buddy Team consisting of the Team Leader with the Automatic Rifleman and the Grenadier with the Rifleman. In some missions you also have now access to a Bradley Fighting Vehicle which you control just like you control a fire team. In some missions you'll also find tanks or APCs which your Fire Teams can enter and use.</p><p>You can now also give orders to a specific teammate. So if you want to breach a door, you order the Grenadier to unpack the rocket launcher and make a nice hole. It is also possible to give orders to the Fire Team you don't control right now.</p><p>Unlike the first game, Ten Hammers doesn't feature a separate tutorial but you rather learn how to play in the very first mission.</p><p>The twelve missions of the campaign feature several different objectives like reaching a convoy or destroy a street barrier. Since your squads can now enter buildings you have a whole new tactical layer to use against the many foes that hide in the shadows ready to kill you. To support this new feature, you can now also deploy a sniper in a building and activate the sniper mode in which you can take out the enemies one by one.</p><p>The multiplayer-mode also got updated and features now the ability to play cooperatively with four friends or do a few 2-on-2 objective based missions.</p>"},{"name":"Furious Karting","year":2003,"developer":"Babylon Software","url":"microsoft_xbox_f/Furious%20Karting%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5414645106,"score":"","genres":"Racing / Driving > Behind view > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>Furious Karting is a kart racing game. Choosing from one of two racer clans, players race across tracks ranging from seedy slums to shopping malls. While the game in itself plays very much like a whimsical and cartoony kart racer, it includes several elements not seen in other kart racing games, such as the usage of a aluminum bat to knock off enemies, which impacts your karma meter and is used in how other racers will treat you in future races, this can be countered with apologizing. There's also a trick system, if used correctly, can give you a temporary speed boost. Typical kart racing powerups such as speed boosts and rockets can be used to stall or slow down other racers. </p><p>There are two multiplayer modes that can be played up to 4 players on the Xbox system, such as the \"classic\" mode, which is the base single player game and \"Jam\" mode, where players must acquire a CD and hold onto it for a limited time to be declared the winner.</p>"},{"name":"Futurama","year":2003,"developer":"Unique Development Studios AB","url":"microsoft_xbox_f/Futurama%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6201857575,"score":6.5,"genres":"Action > 3rd-person (Other) > Behind view > Platform > Puzzle elements > Shooter > Comedy > Licensed","desc":"<p>The <em>Futurama</em> series, winner of a 2002 Emmy Award for Best Animated Program, has been recreated on gaming consoles. The game has been developed in close cooperation with the people behind the TV series and is presented as a 3D platform game with an authentic cartoonish look. All famous characters make an appearance and the story is guided with animations and original advertisements with the look and feel of the TV series.</p><p>Mom has bought Planet Express Deliveries from Professor Farnsworth and has gained control over planet Earth. It's up to the player's crew (Fry, Leela, Dr. Zoidberg, Bender, ...) to stop her evil plans.</p>"},{"name":"Future Tactics: The Uprising","year":2004,"developer":"Zed Two Game Design Studio","url":"microsoft_xbox_f/Future%20Tactics%20-%20The%20Uprising%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6854173206,"score":6.1,"genres":"Strategy > 3rd-person (Other) > Turn-based > Turn-based strategy > Fantasy","desc":"<p>Future Tactics: The Uprising is a turn-based tactical game by developer Zed Two. The world of Pillage has been taken over by alien creatures and the player has to stop this, taking the role of Low and his little sister Pepper, along with other characters they meet along the way. </p><p>The battle system in Future Tactics combines tactics with a few reflexes. By firing a gun you have to play some sort of mini-game. The better you play, the more accurate your shot will be. Future Tactics uses cartoon-like 3D graphics with completely deformable terrain.</p>"},{"name":"Fuzion Frenzy","year":2001,"developer":"Blitz Games Ltd","url":"microsoft_xbox_f/Fuzion%20Frenzy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5474255005,"score":6.3,"genres":"Action > Diagonal-down > Board game > Mini-games > Sci-fi / futuristic","desc":"<p><em>Fuzion Frenzy</em> is a party game with six arenas and more than 45 different mini-games for up to four players to partake in. <em>Fuzion Frenzy</em> provides real-time play for all players in both the main game and the mini-games, no waiting for your opponent to take their turn.</p><p>More features to add replay value include scalable rules for all of the mini-games, secret games to unlock, support for your own custom soundtrack and dynamic environments to change up the levels each time.</p>"}]