[{"name":"Half-Life 2","year":2005,"developer":"Valve Corporation","url":"microsoft_xbox_h/Half-Life%202%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6508848967,"score":8.6,"genres":"Action > 1st-person > Puzzle elements > Shooter > Direct control > Post-apocalyptic > Sci-fi / futuristic > Regional differences","desc":"<p>Following the period of instability caused by the events described in Half-Life, an interdimensional organization known as the Combine invades the Earth, defeating the human forces in the Seven Hour War. A Combine Citadel is erected in City 17, a town in Eastern Europe reminiscent of World War II ghettos. Dr. Wallace Breen, a human scientist, rules the city on behalf of his new masters. An energy field prevents humans from procreating, and no new children are born. Earth is turning into a grim, oppressive police state.</p><p>Meanwhile, Gordon Freeman, the man who was at the center of the events that took place shortly before the rise of the Combine, awakens from his stasis and is inserted into a train to City 17 by the mysterious G-man. Gordon is soon brought into a resistance group and makes a seemingly futile attempt to bring down the Combine and liberate the Earth. </p><p><em>Half-Life 2</em> is a linear first-person shooter with light puzzle-solving elements and many setpieces, similar to its predecessor in concept. The player guides Gordon Freeman through City 17 and the wilderness that surrounds it. On his way, he'll encounter a few friendly characters, but also fight dangerous foes. The game features a realistic physics system: Gordon can pick up objects and toss them freely, and many of the puzzles are physics-based - for example, at one point the player has to weigh down a seesaw with bricks at one end to turn it into a ramp. </p><p>Gordon's enemies, apart from alien wildlife which found their way to Earth, are mainly Combine forces, which utilize a variety of firearms, gadgets, and vehicles. Policemen and foot soldiers work along with helicopters, gunships, and gigantic walking machines to hunt him down. To defend himself, Gordon has a range of weapons available: from the iconic crowbar for close-quarter fighting, through pistols and rifles, up to grenades and a rocket launcher. One of the most notable weapons is the gravity gun, with which Gordon can pick up objects, hold them in the gun's anti-gravity field, then hurl them at the enemy with great force. </p><p>Setpieces in the game include coordinated assaults on enemy bases, fighting gigantic boss enemies, bringing down aircraft with the rocket launcher, and others. A few levels require the player to navigate buggy-type vehicles. Some of the more exotic stages involve the player summoning an army of antlions to unleash on unsuspecting foes.</p><p>Included with the game is Counter-Strike: Source, a version of Counter-Strike made with the new Source engine which powers <em>Half-Life 2</em>, and Half-Life 2: Deathmatch, an online multiplayer game featuring the same physics and weapons as the single player game.</p>"},{"name":"Halo 2","year":2004,"developer":"Bungie Studios","url":"microsoft_xbox_h/Halo%202%20%28USA%2C%20Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CZh%2CKo%29.zip","filesize":5434988324,"score":8.1,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Flight / aviation > Tank > Sci-fi / futuristic > War","desc":"<p>In the sequel to Halo, Spartan-117, better known as the Master Chief, has returned to Earth, where he is promptly needed: despite all precautions taken, the Covenant have discovered the location of humanity's homeworld and are launching their attack. For some reason, however, their fleet is much smaller than expected. To solve this mystery, the Chief must return to the stars, learning more about the mysterious Halo rings and their constructors.</p><p>Meanwhile, the Covenant Elite who commanded the fleet at the Halo construct is blamed for the destruction of the ring and branded a heretic. The High Prophets grant him another chance, however: he is made the Arbiter, a special operative for the Prophets, ordered to carry out impossible missions. He will be dealing with dissent and rebellion among the Covenant - a conflict where he might find himself to be on the wrong side.</p><p>The player controls both the Chief and the Arbiter in <em>Halo 2</em>, a first-person shooter in the same style as the first game. Its main gameplay characteristics are the same: only two weapons can be carried at a time (leading to a tactical choice as to which are to be taken), instead of a standard health points system there is the recharging energy shield (leading to an emphasis on finding cover during firefights), AI-controlled teammates will fight along with the protagonist, and there are lots of sections involving vehicles.</p><p>New features include the ability to double-wield certain weapons, doubling the firing rate at the expense of accuracy, and the ability to execute melee attacks or throw grenades. Part of the weapon arsenal is unchanged from the first game, but there are also some additions. The human projectile weapons are mostly new and include a pistol, shotgun, SMG, and battle rifle. Returning are the sniper rifle and the rocket launcher. The Covenant energy-based weapons (still prone to overheating) from Halo all return, and new additions include several heavy hitters like the Brute Shot and Fuel Rod Gun along with the projectile-based Carbine and the Beam Rifle, both useful for sniping. The Energy Sword is a powerful melee weapon, able to kill most enemies with a single strike.</p><p>All vehicles from the original game also return: Warthog jeeps and Scorpion tanks for the Humans, Banshee fliers, Ghost gliders, and Wraith tanks for the Covenant. A new addition is the Covenant Spectre, which with its rear-mounted cannon wielded by a dedicated gunner is comparable to the Warthog. A new player ability concerning vehicles is to board them while in use and either kick off the driver and take over or in the case of heavy tanks, throw in a grenade.</p><p>The multiplayer component of the game has been greatly expanded. On the Xbox, Xbox Live is now supported in addition to split-screen and system link. The campaign can be played by two players on split-screen. Competitive game types include Slayer and Team Slayer (standard free-for-all deathmatch), Capture the Flag, Assault (planting a bomb in the enemy base), Territories (controlling sections of a map for a certain amount of time), Oddball (finding a skull on the map and then holding on to it as long as possible) and more. All types have several built-in variants and can also be customized further. Players can choose from Spartan and Covenant Elite skins. The PC version comes with a map editor.</p>"},{"name":"Halo 2: Multiplayer Map Pack","year":2005,"developer":"","url":"microsoft_xbox_h/Halo%202%20%28USA%29%20%28Multiplayer%20Beta%29.zip","filesize":6647297830,"score":8.1,"genres":"DLC / Add-on > Map / level > Other","desc":"<p>This pack is an add-on for Halo 2 with a collection of multiplayer maps for gamers who do not have access to Xbox Live. It contains 9 new maps (Containment, Warlock, Turf, Sanctuary, Gemini, Relic, Elongation, Terminal and Backwash), an auto update that brings the game to the latest version, with cheating countermeasures, and all prior Live updates.</p><p>The disc also contains a bonus cinematic that showcases unseen side events during the Old Mombasa mission of Halo 2 and a behind-the-scenes documentary containing interviews with the designers about the inspiration for the new maps.</p>"},{"name":"Halo Triple Pack","year":2005,"developer":""},{"name":"Halo: Combat Evolved","year":2001,"developer":"Bungie Studios","url":"microsoft_xbox_h/Halo%20-%20Combat%20Evolved%20%28USA%29%20%28Rev%202%29.zip","filesize":6884752659,"score":7.8,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Flight / aviation > Tank > Sci-fi / futuristic > War","desc":"<p>Humanity is in the midst of a long war against an alien alliance called the Covenant which has been wiping out colony after colony. Your hero is Master Chief, who is given no name beyond his rank in the game itself. He is stationed on the Pillar of Autumn, a ship which, per protocol makes a jump in a random direction to retreat to avoid revealing the location of Earth. They find themselves at the titular Halo, a planet-sized ring of mysterious origin, and function with the Covenant on their heels. Master Chief must repel the Covenant assault and discover the secrets of Halo with the assistance of the female AI Cortana who lives in his suit and gives missions.</p><p><em>Halo: Combat Evolved</em> is a sci-fi first-person shooter with considerable driving elements. Features include friendly NPCs who fight alongside the Chief, squad-based AI where enemies groups work together to flank you under the direction of a leader unit and can be demoralized by his death. They also use cover, set ambushes, etc.</p><p>Only two weapons may be carried at a time: one active and one on backup. There are five human weapons and three Covenant with distinct art styles for the two groups. Human weapons look basically like real guns and fire projectiles. Covenant are sleek and purple and fire energy. For the most part, weapons are not just left around the environment and must be procured from fallen enemies though there are supply points.</p><p>Your life is armor and health as in most games of the genre, however, rather than armor being an item that is picked up, it is a force field which quickly recharges itself after several seconds without taking damage, which emphasizes finding cover.</p><p>One of the most significant features is vehicles. You can drive a variety of vehicles in both single-player and multiplayer, some of which have additional seats for passengers or gunners which can be used by AI characters. Vehicles also come in distinct human and Covenant varieties with their design philosophies. Human vehicles roll around the ground on wheels and covenant vehicles hover or fly.</p><p><em>Halo</em> also has a significant multiplayer component with basic deathmatch (called slayer here), capture the flag with the unusual addition that the flag takes your weapon spot while you are holding it, so shooting your way in and out of the base on your own is not an option, territories, and some options unique to the game, such as oddball, where you must hold onto a skull for the longest time, race where you score points by getting to checkpoints and juggernaut, where one super-powered player must get points by killing the others and the other players try to kill him to steal his powers. There is also a game editor which allows you to set custom rules for all the basic game types. All the playable weapons and vehicles from the campaign mode are available in the multiplayer maps with the ability for members of the same team to share the game's distinctive Warthog vehicle, which is essentially a small truck with a mounted gun on the back.</p>"},{"name":"Hardwood Solitaire III","year":2004,"developer":"Silver Creek Entertainment"},{"name":"Harry Potter and the Chamber of Secrets","year":2002,"developer":"Electronic Arts UK Ltd.","url":"microsoft_xbox_h/Harry%20Potter%20and%20the%20Chamber%20of%20Secrets%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6269808490,"score":6.8,"genres":"Action > Behind view > Mini-games > Puzzle elements > Licensed","desc":"<p><em>Harry Potter and the Chamber of Secrets</em> follows the exploits of Harry during his second year at the Hogwarts School of Witchcraft and Wizardry. During his time there, Harry's classmates are coming under a mysterious paralysis and Harry must get to the bottom of what is happening.</p><p>The game involves Harry being given objectives to complete along with him having to go to class to learn spells. The game also has some mini-game diversions such as playing Quidditch, dunking gnomes in water, and collecting wizard cards.</p><p>Occasionally Harry will find himself in a combat situation. Harry can be equipped with up to three different spells at a time. If the player can make Harry cast a spell with correct timing, the spell will be more powerful than normal.</p><p>The PlayStation 2 version was ported internally by Electronic Arts instead of by Eurocom who developed the other console versions, hence the PS2 version sporting some noticeable differences. but otherwise keeping the majority of the game the same. Some differences include the PS2 version of the game having an overall lower difficulty level plus when Harry is riding a broom he can land it anywhere instead of only in designated landing spots. Speaking of platform differences, the GameCube version has an exclusive feature that allows the player to connect to the GBA game and unlock a new Wizard Card.</p>"},{"name":"Harry Potter and the Goblet of Fire","year":2005,"developer":"Electronic Arts UK Ltd.","url":"microsoft_xbox_h/Harry%20Potter%20and%20the%20Goblet%20of%20Fire%20%28Europe%29%20%28En%2CNl%2CSv%2CNo%2CFi%29.zip","filesize":6477903533,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Licensed","desc":"<p><em>Harry Potter and the Goblet of Fire</em> is an action-adventure game that follows the story of the fourth movie and book of the same name. In addition to the usual challenges and dangers that Harry, Ron, and Hermione need to face, the Triwizard Tournament will be held at Hogwarts and mysteriously Harry is in the tournament!</p><p>One to three players control Harry, Ron, and Hermione (the computer controls the remaining characters for one and two-player games). Played with a third-person view, you will need to complete numerous game levels which feature a variety of action and puzzle-solving as well as completing the three tasks in the Triwizard Tournament and facing Lord Voldemort. Each character has magic spells that can be used to help out, and additional spells can be learned as you make your way through the game. Occasionally all three characters will need to work together to complete a task, such as moving a particularly large object or defeating a tough opponent. During the game you will come across Bertie Bott's Every-Flavor Beans; collecting these can help out by restoring stamina or magic powers. Additionally, at the end of each level, the Beans can be used to purchase collector cards; these are used to increase a character's abilities.</p>"},{"name":"Harry Potter and the Prisoner of Azkaban","year":2004,"developer":"Electronic Arts UK Ltd.","url":"microsoft_xbox_h/Harry%20Potter%20and%20the%20Prisoner%20of%20Azkaban%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6337034492,"score":6.5,"genres":"Action > 3rd-person (Other) > Puzzle elements > Fantasy > Detective / mystery > Licensed","desc":"<p>Based on the third book and movie of the series, players now take control of Harry, Ron, and Hermione in this 3D adventure as they face the dangers of their third year of Hogwarts, avoiding the soul-stealing Dementors, and trying to solve the mystery of escaped convict Sirius Black. </p><p>Players will navigate through the castle of Hogwarts and beyond, as they learn new spells and how to work together as a team, solving multiple puzzles and avoiding traps that will either require teamwork, or one of the kid's particular skills.  Harry can leap across chasms and climb ropes.  Ron can sense secret areas.  Hermione, being the smallest, can fit into areas where the others can't.  Players can also control Hedwig the owl, or Buckbeak the hippogriff to accomplish other tasks and overcome obstacles.</p><p>Survive the year, learn new spells, and discover the truth of Sirius Black's role during the night Harry became known as \"The Boy Who Lived\".</p>"},{"name":"Harry Potter and the Sorcerer's Stone","year":2003,"developer":"Warthog Games Ltd.","url":"microsoft_xbox_h/Harry%20Potter%20and%20the%20Sorcerer%27s%20Stone%20%28USA%29%20%28En%2CEs%29.zip","filesize":6642577038,"score":6.4,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Two years after versions on other platforms, the then-current consoles got their own adaptation of the first Harry Potter book and film. Like in the computer and PlayStation versions, Harry Potter's first year at school of magic Hogwarts is presented as a 3D action-adventure title.</p><p>After a tutorial at Ollivander's Wand Shop and an introductory first night at Hogwarts, the game is organized into distinct days and nights. Days mostly consist of lessons, where usually Harry will learn new spells. The more interesting stuff happens at night, of course, when Harry sneaks around the castle to do things like meeting Draco Malfoy for a duel, fighting a troll in the dungeons, and other important scenes from the film and book.</p><p>Most tasks involve platform sections, where Harry has to jump over chasms and balance along edges. Often, creatures will be in the way that have to be fought using the correct spells, and magic must also be used to solve the occasional puzzle. At night, Harry must watch out for prefects patrolling the floors of the castle to avoid getting sent back to the common room. There's also broomstick flying in the game, including a Quidditch match against Slytherin.</p><p>After classes, Hogwarts can be freely explored. At any time, it is possible to revisit school lessons to get better grades, often only possible after some more advanced spells have been learned. Also, lots of collectibles can be found both in the open and hidden areas: collecting 20 wizard cards increases Harry's health and Every Flavour Beans can be traded in Fred and George's shop for more cards and some other useful items.</p>"},{"name":"Harry Potter: Quidditch World Cup","year":2003,"developer":"Electronic Arts UK Ltd.","url":"microsoft_xbox_h/Harry%20Potter%20-%20Quidditch%20World%20Cup%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6504231630,"score":6.6,"genres":"Sports > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Quidditch, the broomstick and ball “sport” of the Harry Potter world comes to life in this simulation.  For those unfamiliar with the game, two seven-player teams of flying wizards attempt to score goals with one ball while dodging more flying balls and each other.  For those who are familiar with the game, you will be happy to know that the players, positions, and “strategies” of Quidditch are faithfully recreated.</p><p>The game starts with a player selecting which of the four Hogwarts school teams he or she wishes to play for.  Following some tutorial events, they are launched into the competition for the Hogwarts Cup against the other three teams.  As the player wins games and completes specific challenges (such as “score 120 points in one game”) they collect Quidditch cards which unlock special combo moves.  Once a player has won the school championship, they can go on to play as one of nine international teams competing for the Quidditch World Cup each with its own style and special combo moves.  After winning the cup once, there are still more cards to be collected by playing and winning as different teams.</p><p>People familiar with actual sports know that the rules of Quidditch (as described in Rowlings' books) are fundamentally flawed and that the only meaningful part of the game is the 1 on 1 competition between the two seekers trying to catch the golden snitch.  Quidditch World Cup alleviates this problem with the “golden snitch bar”.  As the game progresses, completing action combos and performing special moves adds to a team progress bar.  Eventually, when the snitch appears, the team with better positioning on the bar will start with an advantage in the chase.  Ironically, this system rewards things other than actual scoring so in-game goals still remain mostly meaningless (except on lower difficulty levels where it is very easy to build a 160+ point lead and make the snitch inconsequential).</p><p>Because it is designed for younger audiences, Quidditch World Cup lacks most of the advanced features you would expect in an EA sports game (league play, team management, etc…).  It also lacks any multiplayer options other than two-player (same machine) exhibition matches</p>"},{"name":"Headhunter: Redemption","year":2004,"developer":"Amuze AB","url":"microsoft_xbox_h/Headhunter%20-%20Redemption%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6598189044,"score":6.7,"genres":"Action > 1st-person > 3rd-person (Other) > Sci-fi / futuristic","desc":"<p>In the 21st century, a dreadful virus wiped out millions. The vaccine was found, but at the time the world was engulfed into chaos. A new world order emerged, splitting the world into two distinct yet dependent worlds: Above and Below.</p><p>The world Above reflects a chrome city, a high-rise, high-tech metropolis served by elevators and elevated freeways. A place for hardworkers and law-abiding people. On the contrary to Above, the world Below, which is the product of earthquake damages, is a subterranean network of labour colonies. Those who are not wanted Above for one reason or another are sent Below.</p><p>One day, now veteran Headhunter, Jack Wade, took a call to investigate an intrusion to the upper levels. Facing the trespasser, Jack saw a potential in the girl and instead of turning her in, he gave her a second chance... to become his apprentice. Jack is back, but this time, he's not alone but accompanied by his sidekick Leeza X. Together, they will face whatever threat lurks from the world Below.</p><p>The gameplay is set in 3rd-person view with ability to rotate camera or set it behind your back at the single click. Headhunter's main accessory is IRIS (Intelligent Realtime Information Scanner). Once you get the IRIS, you'll be able to scan every item just by pointing the gun at it, or use the scanner in 1st-person view which will let you examine the surroundings in more detail. Also, IRIS will provide you with a full 3D map info even displaying the enemies so you can avoid them or use stealth if necessary. Enemies will hear you running and shooting, so if you decide to take an action, be aware that they will surround you and launch a team strike at you from all the sides. You only effective aid against them, beside your weapon, of course, is the ability to perform a roll or lean against the walls and fire from the corners, although aiming itself may not be easy as your hand will not be steady while on the move or panicking.</p>"},{"name":"Hello Kitty: Roller Rescue","year":2005,"developer":"Typhoon Games (Hong Kong) Ltd.","url":"microsoft_xbox_h/Hello%20Kitty%20-%20Roller%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6383718986,"score":6.5,"genres":"Action > 3rd-person (Other) > Anime / Manga > Platform > Puzzle elements > Licensed","desc":"<p>When Sanrio Town is invaded by the evil King Block and his minions, only one skating kitten can save the day! Hello Kitty must battle the villainous block troops that have kidnapped Hello Kitty's friends and family.</p><p><em>Hello Kitty: Roller Rescue</em> is an action platform game where the player controls Hello Kitty and battle through various captured levels of Sanrio Town. The player also gets the option of a computer-controlled partner to help battle the villains. Partners include My Melody, Purrin, and Monkichi. Each partner has their own special attack or ability that can help Hello Kitty out.</p><p>As they progress through the game, players can unlock movie clips and music from the game. They can also unlock character bios on various characters in the Hello Kitty Universe, as well as different outfits for Hello Kitty to wear and new weapons for her to use.</p>"},{"name":"Heroes of the Pacific","year":2005,"developer":"IR Gurus Interactive Pty Ltd.","url":"microsoft_xbox_h/Heroes%20of%20the%20Pacific%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6390018961,"score":7.4,"genres":"Action > Simulation > Behind view > Flight / aviation > Asia > Historical events > North America > Oceania > World War II","desc":"<p><em>Heroes of the Pacific</em> is an arcade flying game set in the Pacific theatre of World War II. Heroes has six game modes including Campaign Mode, Mission Mode, Instant Action, Training, Historical Missions and Multiplayer.</p><p>In the Campaign mode, the player is William Crowe, a young pilot who survives the Japanese attack on Pearl Harbor, but loses his brother. Crowe vows to avenge his bother's death, pursuing the squadron responsible though the major battles in the Pacific. The game follows the player's quest from Pearl Harbor, to Wake Island, Marshall Islands, Coral Sea, Midway, Guadalcanal, Gilbert Islands, Marianas, Philippines, and finally Iwo Jima.</p><p>As players progress through the campaigns, they earn new planes, including fighters, dive-bombers, torpedo-bombers, and medium bombers. Early in the game the player only has the most basic fighters; like the Warhawk and Wildcat. As they complete missions and progress through the campaign, they are awarded new planes.</p><p>The game features over thirty famous planes including: F6F Hellcat, P-38 Lightning, TBF Avenger, F4U Corsair, B25 Mitchell, P-51 Mustang, Seafire, A6M Zero \"Zeke\", J2M Raiden \"Jack\", Ki-84 Hayate \"Frank\", ME262 and FW190.</p><p>The war in the Pacific and William Crowe's personal quest for revenge both come together in the final assault on Iwo Jima, the volcanic fortress-island under Japanese control.</p>"},{"name":"High Heat Major League Baseball 2004","year":2003,"developer":"The 3DO Company","url":"microsoft_xbox_h/High%20Heat%20Major%20League%20Baseball%202004%20%28USA%29.zip","filesize":6489563218,"score":7.7,"genres":"Action > Sports > 3rd-person (Other) > Managerial / business simulation > Baseball > Licensed","desc":"<p>Bringing High Heat to a new level, this 2004 version takes all the best from previous versions and adds more to give you a top-notch baseball game.</p><p>This new version brings you improved graphics thanks to a new graphics engine.  You also get new career and franchise modes so you can manage your own team and build up multi-year stats for it.  Recruit from all the minor leagues (A through AAA) to help your team become the best.</p><p>Play the 2-on-2 Showdown and select a pitcher and batter to compete against another pitcher and batter.  This does not include competing against another human player in the PC version, which has no multiplayer support.</p><p>Also, experience a more realistic audio environment as you hear people yelling and cheering, and vendors selling hot dogs, not to mention the return of the two-man announcer team.</p><p>Watch realistic player movements, including jumping and diving for the ball, sliding, and even shaking fists when hit by the ball.</p>"},{"name":"High Rollers Casino","year":2004,"developer":"Cinemaware, Inc.","url":"microsoft_xbox_h/High%20Rollers%20Casino%20%28USA%29.zip","filesize":6818805739,"score":"","genres":"Gambling > Strategy > 3rd-person (Other) > Cards / tiles","desc":"<p>In <em>High Rollers Casino</em>, you navigate a Las Vegas style casino environment with a male or female character you create from pre-selected options (head, hair, etc.), or you may create a character with the mix and match generator. Along with the character parts, the character's voice is also pre-set. Creating a character is required to play, and only one player may play at a time. Once a character is generated, you may enter the casino, which you navigate by walking around, and is viewed from a third person perspective of your character.</p><p>Table games (where you play against a dealer) include Blackjack (including Blackjack, Spanish 21, Double Exposure, and Triple-7), Caribbean Stud Poker, Craps, Let It Ride, Mini Baccarat, Pai Gow Poker, Roulette, Sic-Bo (similar to Roulette, except with three dice in a cage), and Three Card Poker. Machine games include Slots, Video Keno, Video Poker and Video Slots. Poker games include 5 Card Draw, 7 Card Stud, Omaha, Omaha 8's or Better, Razz, and Texas Hold 'Em. You may play the table and machine games by going directly to them to start, but you must go to the Poker Manager to play the poker games.</p><p>In addition to the Poker Manager, other features available in the casino include the Bartender, who is responsible for explaining the rules for the games, and providing tutorials for playing them. The Cashier will help you when you are out of money by providing markers, or letting you sell prizes won in tournaments. The Elevator lets you access your game play statistics, clothing options, prizes, and VIP status, and the Casino Manager provides information about prizes, handles VIP access, and allows you to enter tournaments. Competing in tournaments requires an entry fee of differing amounts, but if won, you gain all of the other player's entry fees. If you win consecutive tournaments, you win Tournament Bonus prizes which may be cashed in at the Cashier.</p><p>As your bankroll increases, you gain VIP status and corresponding VIP cards (Silver, Gold, and Platinum) which increase your ranking and unlocks an additional costume for your character. Gaining the High Rollers card just gives you the High Roller Ranking. These are collected at the Casino Manager's booth. You may access the menu at any time to go directly to a game, change system settings like music and sound volume, game settings and clearing game statistics, help to get detailed game rules and betting options, and to save and load your game.</p>"},{"name":"Hitman 2: Silent Assassin","year":2002,"developer":"Io-Interactive A/S","url":"microsoft_xbox_h/Hitman%202%20-%20Silent%20Assassin%20%28Europe%29%20%28Rev%201%29.zip","filesize":6832764698,"score":8,"genres":"Action > 1st-person > Behind view > Shooter > Stealth > Direct control > Crime > Spy / espionage > Thriller","desc":"<p>The perfect hitman, Agent 47, tries to distance himself from his violent past and becomes a humble church gardener. But he is tricked into returning to his trade when his friend, a priest, gets kidnapped by an Italian mafioso. <em>Hitman 2: Silent Assassin</em> is a third-person stealth game. As a titular hitman, you have to complete a number of missions all over the world. Each mission generally involves assassinating someone and possibly fulfilling a couple of other objectives. </p><p>Typically, your target will be protected by numerous guards. While there's a large arsenal of weapons available to you - ranging from stealthy weapons such as a garrote or a silenced pistol, up to machine guns and sniper rifles - your main weapon will be stealth. Agent 47 can sneak around to remain undetected, and he can disguise himself in clothes from killed or stunned guards. </p><p>The guards aren't completely stupid, however, as they will investigate suspicious noises, and they'll react if they see you waving around a gun. They'll get suspicious if they see you running around, raise alarm upon finding a corpse, and if you hang in a disguise around them too long, they'll eventually realize you're not one of their buddies. </p><p><em>Hitman 2: Silent Assassin</em> brings something new to the series: depending on your stealthiness, you are given a rating upon completing a mission. Going trigger-happy on everyone will result in being called a \"Mass Murderer\", while only the most patient and skilled players will manage to receive the \"Silent Assassin\" rating, which generally involves stealthily eliminating the target without raising any suspicion.</p>"},{"name":"Hitman: Blood Money","year":2006,"developer":"Io-Interactive A/S","url":"microsoft_xbox_h/Hitman%20-%20Blood%20Money%20%28USA%2C%20Europe%29.zip","filesize":6602476408,"score":8,"genres":"Action > 1st-person > Behind view > Shooter > Stealth > Direct control > Crime > Thriller","desc":"<p>Agent 47 the assassin returns in the 4th installment of the <em>Hitman</em> series. This time he goes on a trip around America, undertaking missions in major cities such as Las Vegas, New Orleans, Los Angeles and other exotic locations. This time, he better watch his back, as his long-time employer, the International Contract Agency, is threatened by a mysterious rival. </p><p>Gameplay in <em>Hitman: Blood Money</em> is generally similar to the previous installments. Once again, your job will be to complete several assassination missions. You can sneak around in disguise to avoid the suspicious guards, or you can instead open fire on everyone you see. When you complete your mission, you're given a rating - from \"Mass Murderer\" up to the coveted \"Silent Assassin\". </p><p><em>Blood Money</em> introduces a lot of new features, however. A new notoriety system will track every single one of your moves, which in turn will demand utmost calculation in order to successfully accomplish your objectives. For those of you who are tired of a direct approach, you will be given the opportunity to stage accidents and should you be suspected, bribes and \"other\" accidents will always be at hand. <em>Blood Money</em> also gives the player the opportunity to customize weapons.</p>"},{"name":"Hitman: Contracts","year":2004,"developer":"Io-Interactive A/S","url":"microsoft_xbox_h/Hitman%20-%20Contracts%20%28Europe%29.zip","filesize":6635244509,"score":7.5,"genres":"Action > 1st-person > Behind view > Stealth > Crime > Spy / espionage > Thriller","desc":"<p><em>Hitman: Contracts</em> is a third-person stealth game. Players take the role of \"47\", a hitman who is unlucky enough to get shot, and falls to the floor dying. The whole game takes place in \"flashbacks\", where 47 is reminiscing about past missions, some of which were previously seen in Hitman: Codename 47, the first game from the <i>Hitman</i> series.</p><p>Gameplay in <em>Hitman: Contracts</em> is similar to the previous installments. Your job will be to complete several missions which involve assassinating targets all over the world. You can sneak around in disguise to avoid the suspicious guards, or you can instead open fire on everyone you see. When you complete your mission, you're given a rating - from \"Mass Murderer\" up to the coveted \"Silent Assassin\". If you manage to complete a mission with a \"Silent Assassin\" rating, you receive a reward: a special weapon (such as dual sawed-off shotguns), and you can try playing a previously completed mission using one of the special weapons.</p>"},{"name":"Hobbit, The","year":2003,"developer":"Inevitable Entertainment, Inc.","url":"microsoft_xbox_h/Hobbit%2C%20The%20-%20The%20Prelude%20to%20the%20Lord%20of%20the%20Rings%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6320766363,"score":6.4,"genres":"Action > 3rd-person (Other) > Fantasy > Licensed","desc":"<p>Third-person platformer adapted from J.R.R. Tolkien's famous book.Players control Bilbo as he's taken from his safe little hole in the Shire by a band of Dwarves to confront the dragon Smaug while picking up a glowing sword, an invisibility ring, and coins and crystals.</p>"},{"name":"Hot Wheels: Stunt Track Challenge","year":2004,"developer":"Climax (Brighton) Ltd","url":"microsoft_xbox_h/Hot%20Wheels%20-%20Stunt%20Track%20Challenge%20%28Europe%29.zip","filesize":6849383423,"score":6.4,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Top-down > Tricks / stunts > Automobile > Licensed","desc":"<p>Hot Wheels meets Fear Factor. Players can play this game with 30 different Hot Wheels race cars through 24 challenges, 12 race tracks, and 12 mini-games. They can collect many decals, wheels and race cars as the try out six different worlds with Ryan Storm (your host) guiding them through all these events to race for the number one spot.</p>"},{"name":"House of the Dead III, The","year":2002,"developer":"Wow Entertainment, Inc.","url":"microsoft_xbox_h/House%20of%20the%20Dead%20III%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6768514617,"score":6.7,"genres":"Action > 1st-person > Rail shooter > Horror","desc":"<p>Twenty years after the events of The House of the Dead II, Lisa Rogan and Agent G are desperately searching for Lisa's father, Thomas. Eventually they find themselves at a local corporate office, which is over-run with all kinds of deadly and evil creatures of the afterlife.</p><p>It's up to you (or a friend) to blast your way through the evil dead to rescue Lisa's father. Included are multiple gameplay paths (you choose which way to go), the new auto-reloading shotgun, and 2 player support.</p>"},{"name":"Hulk","year":2003,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_h/Hulk%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6518503828,"score":6.4,"genres":"Action > 3rd-person (Other) > Cinematic camera > Beat 'em up / brawler > Direct control > Licensed","desc":"<p>Taking place after the events of the blockbuster movie (starring Eric Bana), you play Dr. Bruce Banner and his alter ego, green giant The Hulk. After fighting his way through the first year of his new identity, Bruce and The Hulk must now face a new enemy, The Leader, who wants to use the same gamma technology that created The Hulk in Bruce to develop an army of giants.</p><p>Levels in the game have you controlling either Bruce or The Hulk. Bruce must use his smaller size to sneak around areas 'Splinter Cell' style, while The Hulk can bash and blast his way through enemy territory in every way possible, with over 40 different attacks to use.</p>"},{"name":"Hummer: Badlands","year":2006,"developer":"Eutechnyx Limited","url":"microsoft_xbox_h/Hummer%20Badlands%20%28USA%29.zip","filesize":6718812972,"score":5.8,"genres":"Action > Racing / Driving > Sports > 3rd-person (Other) > Off-roading > Licensed","desc":"<p>Get down and dirty in this hummer racing game. Drive and choose from 19 different hummer models, as you race to win in different races through all the modes of the game: Championship, Tug'O'war, and Extreme Off-road where you race to the top of a mountain through intense weather over fallen trees, bushes and tall grass. As you win, you unlock custom hummers, tracks, and customizations to upgrade your vehicle. Multiplayer includes 2-player head-to-head races on split-screen.</p>"},{"name":"Hunter: The Reckoning","year":2002,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_h/Hunter%20-%20The%20Reckoning%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rerelease%29.zip","filesize":6116892051,"score":7.3,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Direct control > Contemporary > Fantasy > Horror > Licensed","desc":"<p>You have been chosen to join the reckoning—you are to step into the World of Darkness where humanity is ravaged by vampires and marauding monsters. As a Hunter, you are immune to these beasts' illusions, but with your power comes a daunting destiny: to destroy these evil beings before mankind is massacred.</p><p><em>Hunter</em> takes place over 23 different stages in which you and up to three of your friends can wield up to twenty different weapons against a horde of enemies. Each player chooses from one of four classes: the Avenger, Martyr, Defender, or Judge. Each one possesses different strengths and weaknesses along with their own individual set of spells. Gameplay can very much be compared to the Gauntlet games, where you face innumerable odds while building up your own characters in order to take down the ultimate evil.</p>"},{"name":"Hunter: The Reckoning - Redeemer","year":2003,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_h/Hunter%20-%20The%20Reckoning%20-%20Redeemer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5976005168,"score":7.1,"genres":"Action > Role-playing (RPG) > Diagonal-down > 2D scrolling > Real-time > Action RPG > Direct control > Contemporary > Fantasy > Horror > Licensed","desc":"<p><em>Hunter: The Reckoning - Redeemer</em> takes place 10 years after the original Hunter: The Reckoning in the same sleepy town of Ashcroft. In the original game, the Hunters saved an innocent orphan named Kaylie. After Father Esteban realized she had been imbued that day, he decided to be her caretaker and train her to use her new-found powers the best way possible. Now 19, Kaylie has matured into a confident and independent young Hunter. </p><p>Five playable Hunter Characters; each with their own unique weapons, edges and supernatural abilities; Single and multi player cooperative play.</p>"},{"name":"Hustle, The: Detroit Streets","year":2006,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_h/Hustle%2C%20The%20-%20Detroit%20Streets%20%28USA%29.zip","filesize":6365659951,"score":6,"genres":"Sports > Isometric > Pool / snooker","desc":"<p><em>The Hustle: Detroit Streets</em> takes you through the pool halls and clubs of Detroit, as you prove yourself against the masters of the game. Take on the role of either Jack Stone or Kat Hudson as they make their way to the top of the pool circuit through two different game modes. Players hone their pool skills in their quest for respect and cash, alone or in tough AI competition.</p><p>Once you've mastered the AI, you can hook up your network adapter and play against up to 9 friends, or take it online and challenge players around the world.</p><p>The game features over 180 different pool sharks, 200 variations on the game of pool, trick shots, 9 unique venues, character customization and a bevy of non-player characters.</p>"}]