[{"name":"I-Ninja","year":2003,"developer":"Argonaut Games PLC","url":"microsoft_xbox_i/I-Ninja%20%28USA%29.zip","filesize":6562210411,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Martial arts","desc":"<p>A robot army led by Master O-Dor has destroyed the ninja clan. As the last of your kind, you must take on the robot army and defeat Master O-Dor. You play a cartoon ninja with a big head in a level-based 3D platform game. Each level is packed with new skills to master, challenges to beat, and grades to earn.</p><p>Various power-ups can be acquired as you progress, including sword upgrades, shurikens, darts and a ninja revive move which boosts your health.</p>"},{"name":"Ice Age 2: The Meltdown","year":2006,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_i/Ice%20Age%202%20-%20The%20Meltdown%20%28Europe%29%20%28En%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6627423475,"score":6.7,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p><em>Ice Age 2: The Meltdown</em> is loosely based on the movie of the same name. The game takes place in prehistory - you play as Scrat, the hapless (but not totally helpless!) proto-squirrel, helping your friends escape the coming of a huge flood.</p><p>In the Windows version the WASD keys move you forward and back, left and right, and the mouse controls camera movement and some actions. Scrat has a few special moves as well, such as sniff, his spin attack, a double jump, a ground stomp (useful for breaking ice), and a roll attack. Much of the game consists of hunting down acorns and other special nuts for health renewal or for unlocking bonuses. There are a few mini-games within the game - you can play as Sid, zipping along an ice slide while avoiding obstacles; there's also penguin-bowling and a mini-game where you \"shoot\" at monkeys to regain a walnut that was whisked out from under your nose.</p>"},{"name":"IHRA Drag Racing 2004","year":2003,"developer":"Super Happy Fun Fun, Inc.","url":"microsoft_xbox_i/IHRA%20Drag%20Racing%202004%20%28USA%29.zip","filesize":6739485899,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Behind view > Managerial / business simulation > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>An upgrade of Bethesda's earlier IHRA Drag Racing titles.  Implemented on the Xbox with improved graphics and gameplay and the ability to download updated cars via Xbox Live.</p><p>A large part of the game is allowing a player to significantly customize and tune their car.  Adjustments can be made in virtually every aspect of the engine, tire, and suspension, including bore and stroke, valve lift and timing, tire compounds and sizes, springs and damper rates, etc.</p><p>Then the player can race their car against another player or the CPU using accurate IHRA Drag Racing rules.  The player can select and race individual tracks, or they can try to win the championship in Season mode.</p>"},{"name":"IHRA Drag Racing: Sportsman Edition","year":2006,"developer":"Bethesda Game Studios","url":"microsoft_xbox_i/IHRA%20Drag%20Racing%20-%20Sportsman%20Edition%20%28USA%29.zip","filesize":6719127518,"score":"","genres":"Racing / Driving > 3rd-person (Other) > Behind view > Real-time > Direct control > Automobile > Track racing > Licensed","desc":"<p>Experience the next generation of drag racing action with IHRA Drag Racing Sportsman Edition, featuring intense bracket racing between cars of all makes and models.</p><p>Choose the Arcade Mode for instant action in a single event or two-player split screen race. For more in-depth play, select the Season Mode to experience the excitement and challenge of an IHRA Sportsman 12-event season.</p><p>* Official IHRA Bracket Racing rule set of the Sportsman Series - featuring Top Sportsman and Top Dragster car classes.<br>* Customize, tweak, and tune 60 cars in the Garage's Paint Shop or Parts Store.<br>* 22 total tracks to race and unlock, including 11 officially licensed IHRA tracks and 11 original tracks.<br>* Customizable controls and DUALSHOCK® analog controller support.<br>* Split-screen multiplayer support.</p>"},{"name":"IHRA Professional Drag Racing 2005","year":2004,"developer":"Bethesda Game Studios","url":"microsoft_xbox_i/IHRA%20Professional%20Drag%20Racing%202005%20%28USA%29.zip","filesize":6321043534,"score":"","genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>As with the 2004 edition, <em>IHRA Professional Drag Racing 2005</em> is a simulation of drag racing. However, the 2005 edition has been radically changed to be more accessible and is built on an entirely new code base. The controls have been modified and many functions have been automated. The graphics have also been improved, along with a new physics model.</p><p>Included is an arcade mode, in both singleplayer and multiplayer, as well as a new simulation mode. In the simulation mode, there is a series of racing tests/tutorials to teach the basics, then purchasing and customizing a car, then going drag racing. The game contains 24 official drivers and 11 official tracks. There are 35 vehicles and 70 vehicle components to customize, from tires to transmissions to electronics.</p><p>The game features the official endorsement of the International Hot Rod Association.</p>"},{"name":"Incredible Hulk, The: Ultimate Destruction","year":2005,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_i/Incredible%20Hulk%2C%20The%20-%20Ultimate%20Destruction%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6365871408,"score":8,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > RPG elements > Sandbox / open world > Licensed","desc":"<p>The Incredible Hulk faces against his greatest adversary - the Abomination - in a free-roaming, open-world action-adventure.  Every object is interactive, plus you can also wield the power of 'weaponization', whereby you can create new weapons from everyday objects.  As the most powerful creature on earth, take the battle from the city to the badlands, smash six classic Marvel bosses and finally defeat the Devil Hulk inside your mind.</p>"},{"name":"Incredibles, The","year":2004,"developer":"Heavy Iron Studios, Inc.","url":"microsoft_xbox_d_part2/Disney-Pixar%20The%20Incredibles%20%28Europe%29.zip","filesize":6653253216,"score":6.3,"genres":"Action > Behind view > Platform > Licensed","desc":"<p>This game is based on the hit Pixar film of the same name and same plot.</p><p>The action game sees you controlling the Incredible family members, each with their own superpowers. Lift insanely heavy objects, bash through walls as Mr. Incredible, stretch to swing across chasms and grab enemies as Mrs. Incredible as well as taking control of their kids' Dash (run amazingly fast) and Violet (invisibility) in the 3D action game.</p>"},{"name":"Incredibles, The: Rise of the Underminer","year":2005,"developer":"Heavy Iron Studios, Inc.","url":"microsoft_xbox_d_part2/Disney-Pixar%20The%20Incredibles%20-%20Rise%20of%20the%20Underminer%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6606146102,"score":6.7,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Platform > Licensed","desc":"<p><em>The Incredibles: Rise of The Underminer</em> is the sequel to The Incredibles. </p><p>This game continues where the Pixar movie of the same name leaves off. The Underminer has risen from the ground and players can play as both Mr. Incredible and Frozone to defeat the Underminer and his army of robot minions. Mr. Incredible uses melee combat moves and strength to navigate the level while Frozone uses his freezing powers to defeat enemies. </p><p>Two players can play at the same time or the console can play one of the characters for the player.</p>"},{"name":"Indiana Jones and the Emperor's Tomb","year":2003,"developer":"The Collective, Inc.","url":"microsoft_xbox_i/Indiana%20Jones%20and%20the%20Emperor%27s%20Tomb%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5560859363,"score":7.2,"genres":"Action > Behind view > Puzzle elements > Interwar > Licensed > Regional differences","desc":"<p>Indiana Jones is at it again. This time, he must travel his way through-out Asia to recover an artifact that, according to those who required his assistance, is the most powerful in the world. As usual, Indy isn't the only one who is out to find the treasure, with the Nazi's right on his tail.</p><p>Along with a heavy dose of exploration, whip cracking and platform jumping, you will also control Indy through fighting elements against a range of enemies. Hand-to-hand combat and a collection of weapons (from guns to table legs) can be used to defend yourself.</p>"},{"name":"Indigo Prophecy","year":2005,"developer":"Quantic Dream SA","url":"microsoft_xbox_i/Indigo%20Prophecy%20%28USA%29.zip","filesize":6142219186,"score":8,"genres":"Action > Adventure > 1st-person > 3rd-person (Other) > Quick Time Events (QTEs) > Sci-fi / futuristic > Adult > Detective / mystery > Horror > Thriller","desc":"<p>January 2009. On a cold, snowy night in New York City, an ordinary citizen named Lucas Kane, under the control of an unknown force, unwillingly murders a complete stranger in a diner. Once he comes to senses, Lucas realizes he must escape while leaving as little evidence as possible behind. Barely managing to accomplish that, Lucas contacts his brother and tries to understand what has caused him to commit the crime, recalling the events of his own past in the process. Meanwhile, two police detectives investigating the murder, Carla Valenti and Tyler Miles, are determined to find the perpetrator, at the same time trying to deal with the personal problems of their lives.</p><p><em>Indigo Prophecy</em> (<em>Fahrenheit</em> in Europe) is a psychological thriller in which the player is able to control different characters on both sides of a murder - the killer and those who are trying to find him. The game's core gameplay style is adventure. The three protagonists explore various locations, talk to other characters, and interact with the environment in order to advance. However, the game is heavy on various action-oriented sequences, from tasks that must be completed within a limited amount of time to quick time events, which require the player to press the correct button during a scene.</p><p>The game emphasizes realism in the player's interaction with the environment. For example, picking up a rag and cleaning the floor requires the player to move the mouse or the analog stick back and forth, imitating the actual movements of the object. Dialogue with character often imposes time limits on the player; failure to choose the optimal response in time will prompt the game to choose another, not always the optimal one. The player's choice will sometimes influence the subsequent events and the outcome of the entire story, eventually leading it to one of the three possible endings.</p><p>Cinematic treatment is evident in the game's handling of action-based gameplay and cutscenes, which are often seamlessly integrated into each other. An example of this is the split-screen technique, which is often used during the game's most dramatic moments: while the player is trying to complete the required action in time on one screen, another one displays what is happening around the controlled character.</p>"},{"name":"IndyCar Series","year":2003,"developer":"Brain in a Jar Ltd.","url":"microsoft_xbox_i/IndyCar%20Series%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6668405405,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>IndyCar Series</em> is the official game of the 2002 Indy Racing League season, including the world-famous Indianapolis 500. It's a fast-paced racing sim with up to 33 cars racing on track at a time, at speeds well over 220 mph. The game features commentary by Bob Jenkins, and a Masterclass training mode taught by Indy 500 winner Eddie Cheever Jr.</p>"},{"name":"IndyCar Series 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_i/IndyCar%20Series%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6649190807,"score":6.8,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Following in the footsteps of the previous game, <em>IndyCar Series 2005</em> once again puts players inside the world of high-speed racing.</p><p>Choose Quick Race to get straight onto the speedway, IndyCar Series to race the entire Indy circuit, or Indy 500 to experience the thrills of the Indianapolis 500 from qualifying to race day.</p><p>The game includes 4 skill levels (Easy, Normal, Pro and Custom), 15 race tracks, a long list of famous professional drivers to choose from, garage tweaking and tuning, driver profile customization, and the \"Masterclass Course\" tutorial. The \"Trading Card Album\" contains the unlockables attained by accomplishing certain feats in the game, such as finishing a race in its entirety. The unlockable content includes the ability to create a custom driver, car accessories, car skins and more.</p><p>In any single player game it is possible for as many as 33 competitors to be onscreen at one time. Friends can play against each other offline in split screen. Multiplayer can be by direct system link or over the internet.</p>"},{"name":"Innocent Tears","year":2002,"developer":"Global A Entertainment","url":"microsoft_xbox_i/Innocent%20Tears%20%28Japan%29.zip","filesize":5989431690,"score":"","genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Anime / Manga > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>The events of \"Innocent Tears\" take place in the 22nd century. In this post-apocalyptic world, Earth has turned into an battle arena on which two powerful races, the Angels and the Fallen Angels, fight each other, deciding the destiny of humans and the world. You take control of the leader of Fallen Angels, and fight to protect the human race from the manipulations of the Angels. </p><p>The game is an animé-style strategy RPG. It consist mainly of large strategic battles, during which you navigate your characters on a battle field and perform various attacks. You can command a large party and customize each character in a RPG fashion. The game features hand-drawn animé cut-scenes and fully 3D battles.</p>"},{"name":"Inside Pitch 2003","year":2003,"developer":"Indie Built, Inc.","url":"microsoft_xbox_i/Inside%20Pitch%202003%20%28USA%29.zip","filesize":5672913715,"score":6.6,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>Play as all major teams and players of the Major League Baseball in a full season, single game and home run derby. Championship Challenges has you playing out actual events from the 2002 season and trying to break some of the records set during the year and Training Track will get you up-to-date with all the moves in the game with a range of drills for pitching, batting and fielding.</p><p>Xbox Live is also supported, allowing you to download new stadiums and update your rosters, play against other games around the world and keep track of their win/loss stats.</p>"},{"name":"Intellivision Lives!","year":2003,"developer":"Realtime Associates, Inc.","url":"microsoft_xbox_i/Intellivision%20Lives%21%20%28USA%29.zip","filesize":6870077628,"score":6.5,"genres":"Compilation","desc":"<p><em>IntelliVision Lives!</em> is a compilation of over sixty games that appeared on the IntelliVision game system in the early 1980's. You get over sixty games in several categories, and they are:</p><p><strong>Combat and Sorcery</strong>  </p><ul><li>Armor Battle  </li><li>Battle Tanks  </li><li>Biplanes  </li><li>B-17 Bomber  </li><li>Hover Force  </li><li>Sea Battle  </li><li>Sub Hunt  </li><li>Thunder Castle  </li><li>Tower of Doom  </li><li>Utopia</li></ul><p><strong>Unreleased Titles</strong>  </p><ul><li>Number Jumble  </li><li>Space Cadet  </li><li>Demo Cartridge (not a game, but a demo showcasing IntelliVision games)  </li><li>Hypnotic Lights  </li><li>Takeover  </li><li>Magic Carousel</li></ul><p><strong>Space</strong>  </p><ul><li>Astrosmash  </li><li>Space Armada (think Space Invaders)  </li><li>Space Battle  </li><li>Space Hawk  </li><li>Space Spartans</li><li>Star Strike</li></ul><p><strong>Kids</strong>  </p><ul><li>Crosswords  </li><li>Factor Fun  </li><li>Frog Bog  </li><li>Math Master  </li><li>Memory Fun  </li><li>Sharp Shot  </li><li>Word Hunt  </li><li>Word Rockets</li></ul><p><strong>Sports</strong>  </p><ul><li>Baseball (Baseball, World Championship Baseball)  </li><li>Basketball (Basketball, Slam Dunk: Super Pro Basketball)  </li><li>Bowling  </li><li>Boxing  </li><li>Football (Football, Super Pro Football)  </li><li>Golf (Golf, Chip Shot: Super Pro Golf)  </li><li>Hockey (Hockey, Slap Shot: Super Pro Hockey)  </li><li>Racing (Auto Racing, Motocross, Stadium Mudbuggies)  </li><li>Skiing (Skiing, Mountain Madness: Super Pro Skiing)  </li><li>Soccer  </li><li>Tennis  </li><li>Track &amp; Field (Super Pro Decathlon)  </li><li>Volleyball (Spiker: Super Pro Volleyball)  </li><li>Wrestling (Body Slam: Super Pro Wrestling)</li></ul><p><strong>Arcade</strong>  </p><ul><li>Bomb Squad  </li><li>Buzz Bombers  </li><li>Racing Cars  </li><li>Night Stalker  </li><li>Pinball  </li><li>Shark! Shark!  </li><li>SNAFU  </li><li>Thin Ice  </li><li>Vectron</li></ul><p><strong>Gaming and Strategy</strong>  </p><ul><li>Backgammon  </li><li>Checkers  </li><li>Horseracing  </li><li>Las Vegas Poker &amp; Blackjack  </li><li>Reversi  </li><li>Las Vegas Roulette  </li><li>Royal Dealer</li></ul><p>The game also features two video features; one is the history of the IntelliVision, and the other is a collection of interviews with various game programmers who worked with the IntelliVision. You can also unlock bonus commercials for the games (as shown originally in the eighties) by completing goals in certain games (like scoring 20,000 points in Space Armada).</p>"},{"name":"International Superstar Soccer 2","year":2002,"developer":"Major A","url":"microsoft_xbox_i/International%20Superstar%20Soccer%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6132014052,"score":7,"genres":"Sports > Isometric > Football (European) / Soccer","desc":"<p><em>International Superstar Soccer 2</em> is a next-generation update of Konami's International Superstar Soccer, featuring a similar array of modes (friendly, international cup, league, training) to the original. This installment also makes use of an official FIFPro license, meaning that many of the 58 national teams include real player names.</p>"},{"name":"Iron Phoenix","year":2005,"developer":"InterServ International Inc.","url":"microsoft_xbox_i/Iron%20Phoenix%20%28USA%29.zip","filesize":6295101648,"score":5.7,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Fantasy > Martial arts","desc":"<p>Iron Phoenix is a Wuxia/Hong Kong Cinema style fighting game that allows Xbox Live battles with up to 16 players. The fighting system is based on the weapon and character selection, allowing hundreds of move combinations.</p><p>In the distant past, a meteorite fell to earth (the \"Iron Phoenix\") and was forged into seven powerful magical weapons by a master weaponsmith. They proved to be his doom, however, as the World of Martial Arts is nothing if not unkind to those without the power to protect what is theirs.</p><p>Combatants choose from 10 character models, each of which has 2 variations. There are also a variety of monster and undead models that can be used. Each character has different configurations of strength, speed and health, affecting their performance in a fight. These characters are combined with weapons (sometimes pre-selected, sometimes grabbed in a free-for-all during a fight) to allow for a wide variety of play styles.</p><p>The weapons are: Phoenix Wings (Hand Blades), Searing Dagger, Ember Sword (Longsword), Phoenix Tail (Long Spear), Ash Blade (Scimitar), Meteor Hammer, Flame of Heaven (2-Handed Sword), Phoenix Talons (Hand Claws), and the Feather Blade (Ninja-to sword). Players can also pick up a variety of darts which can poison or slow a target, in addition there is a variety of equipment that can grand special powers, such as increased strength, invisibility, and movement.</p><p>Movement in the game is based in the wire-fu, with leaps, flips, wall-running, etc. A move power meter governs this aspect of play, recharging over time.</p><p>The game is all-combat, all the time, either single player or Xbox Live. Single players can go up against a custom build out of bots, in a variety of game modes: Deathmatch, Team Deathmatch, VIP, Giant Kill, and Challenge Ring. These modes are available online as well, allowing up to 16 simultaneous players to engage in high-flying martial arts battles with exotic weaponry on Xbox Live.</p>"},{"name":"Italian Job, The","year":2003,"developer":"Climax Group Limited","url":"microsoft_xbox_i/Italian%20Job%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6804676618,"score":6.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator > Crime > Licensed","desc":"<p>Based on the movie remake of the 1969 film, <em>The Italian Job</em> is the story of a gang of thieves who stage the ultimate gold heist of all time. Little do they know that one of their gang members has double-crossed them, taking the gold and leaving them for dead.</p><p>As a member of the team, it is your job to stage the next big heist of all time, taking back the gold from your former friend. The game allows you to control a range of vehicles that you must drive to destinations before a certain time limit in order for the plan to work. Of course, the Mini comes into play as you escape from the police.</p><p>Apart from the movie based story mode, you can also drive the Mini's through a range of multiplayer modes, including stunt driving and circuit racing.</p>"}]