[{"name":"Jacked","year":2006,"developer":"Sproing Interactive Media GmbH","url":"microsoft_xbox_j/Jacked%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6677545329,"score":5.4,"genres":"Action > Racing / Driving > 3rd-person (Other) > Fighting > Motorcycle","desc":"<p>Reminiscent of the classic Road Rash, Jacked is a high-octane arcade motorcycle racer featuring over-the-top combat elements. In Jacked, the world's fastest and hottest motorbikes - including the gas turbine powered Marine Turbine Superbike - can be yours.</p><p>Race across the USA, from New York to LA, fulfill a variety of missions and steal your enemies' bikes at high speed while they are moving by \"jacking\" them.</p><p>Fight your enemies with baseball bats and tazers, flame them with Molotov Cocktails, shoot them off their rides with shotguns or blow them out of the way with frag grenades. When they are stunned you can jack their bikes - at any speed, on the road or in midair. In some missions you can even take your biker gang along to help you out in your endeavors.</p><p>Jacked features an extensive Single Player Mission Mode that includes a big variety of different Race- and Combat Missions. In the Multiplayer Mode you can challenge a friend to a Race or a Gang Battle on the tracks and bikes unlocked in the Mission Mode.</p>"},{"name":"Jade Empire (Disc 1)","year":2005,"developer":"BioWare Corporation","url":"microsoft_xbox_j/Jade%20Empire%20%28USA%2C%20Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":5732646210,"score":8.4,"genres":"Role-playing (RPG) > Behind view > Real-time > Action RPG > Fantasy > Martial arts","desc":"<p>A young apprentice of the old Master Li, a martial artist in the town of Two Rivers, is close to complete his or her training, when a group of ghosts led by a mysterious person attacks the town. Master Li explains that the leader was a member of the Lotus Assassins, a special force serving the Emperor of the Jade Empire, who also happens to be his brother. The student is revealed to be the last in the line of Spirit Monks, whose abode was destroyed several years ago by the Emperor's army. The student ventures into a nearby cave to retrieve a part of an ancient amulet; meanwhile, the assailants burn down the town and abduct Master Li. The student and a few companions decide to go all the way to the Imperial Capital and explore the Jade Empire in order to rescue the master, find the truth about the past, and discover the dark secrets of the Empire's rulers.</p><p><em>Jade Empire</em> is a role-playing game set in a fantasy world which has strong similarities to China of the Qing dynasty (within some steampunk elements), incorporating not only classical elements of Chinese culture, but also supernatural beings and forces. Similar to other BioWare RPGs (such as Knights of the Old Republic) in general concept and features, the game has overall simpler gameplay and a somewhat smaller world.</p><p>The combat in the game is action-based, relying on various martial art techniques and moves performed by the protagonist. The player has direct control only over the main character, although other characters join the party; one of them can be selected to help the protagonist in battles, either for purely supportive purposes or as an additional combatant. The player character has three attributes: Body, Mind, and Spirit, which control the secondary parameters of Health, Focus, and Chi, as well as the conversation skills Charm, Intuition, and Intimidation. Focus energy is needed to fight with weapons (swords and staves), while Chi is used to heal the protagonist or perform supernatural attacks comparable to magic spells. Experience points are obtained from completing quests and vanquishing enemies, and allocated by the player to increase the protagonist's aforementioned attributes.</p><p>Quest and conversation system bears more similarities to previous BioWare RPGs than combat and character customization. There are many side quests in the game, some of which can be solved through dialogue, applying the main character's conversation skills. Many quests, including plot-related ones, can be solved in different ways. The protagonist may embrace either of the two major philosophies of the Jade Empire, Way of the Open Palm or Way of the Closed Fist, roughly corresponding to \"good\" and \"evil\" ideologies, respectively. Pursuing one of these ideologies rather than hesitating between the two may award the player character with various bonuses. The protagonist can also romance some of the companions, including same-sex relationships.</p>"},{"name":"Jade Empire (Disc 2)","year":2005,"developer":"BioWare Corporation","url":"microsoft_xbox_j/Jade%20Empire%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Bonus%20Disc%29.zip","filesize":6743331799,"score":8.4,"genres":"Role-playing (RPG) > Behind view > Real-time > Action RPG > Fantasy > Martial arts","desc":"<p>A young apprentice of the old Master Li, a martial artist in the town of Two Rivers, is close to complete his or her training, when a group of ghosts led by a mysterious person attacks the town. Master Li explains that the leader was a member of the Lotus Assassins, a special force serving the Emperor of the Jade Empire, who also happens to be his brother. The student is revealed to be the last in the line of Spirit Monks, whose abode was destroyed several years ago by the Emperor's army. The student ventures into a nearby cave to retrieve a part of an ancient amulet; meanwhile, the assailants burn down the town and abduct Master Li. The student and a few companions decide to go all the way to the Imperial Capital and explore the Jade Empire in order to rescue the master, find the truth about the past, and discover the dark secrets of the Empire's rulers.</p><p><em>Jade Empire</em> is a role-playing game set in a fantasy world which has strong similarities to China of the Qing dynasty (within some steampunk elements), incorporating not only classical elements of Chinese culture, but also supernatural beings and forces. Similar to other BioWare RPGs (such as Knights of the Old Republic) in general concept and features, the game has overall simpler gameplay and a somewhat smaller world.</p><p>The combat in the game is action-based, relying on various martial art techniques and moves performed by the protagonist. The player has direct control only over the main character, although other characters join the party; one of them can be selected to help the protagonist in battles, either for purely supportive purposes or as an additional combatant. The player character has three attributes: Body, Mind, and Spirit, which control the secondary parameters of Health, Focus, and Chi, as well as the conversation skills Charm, Intuition, and Intimidation. Focus energy is needed to fight with weapons (swords and staves), while Chi is used to heal the protagonist or perform supernatural attacks comparable to magic spells. Experience points are obtained from completing quests and vanquishing enemies, and allocated by the player to increase the protagonist's aforementioned attributes.</p><p>Quest and conversation system bears more similarities to previous BioWare RPGs than combat and character customization. There are many side quests in the game, some of which can be solved through dialogue, applying the main character's conversation skills. Many quests, including plot-related ones, can be solved in different ways. The protagonist may embrace either of the two major philosophies of the Jade Empire, Way of the Open Palm or Way of the Closed Fist, roughly corresponding to \"good\" and \"evil\" ideologies, respectively. Pursuing one of these ideologies rather than hesitating between the two may award the player character with various bonuses. The protagonist can also romance some of the companions, including same-sex relationships.</p>"},{"name":"James Cameron's Dark Angel","year":2002,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_j/James%20Cameron%27s%20Dark%20Angel%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6231479355,"score":5.9,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Cyberpunk / dark sci-fi > Licensed","desc":"<p>James Cameron's tv series in game form. Dark Angel has you playing as Max Guevera, a 'genetically engineered super-soldier' running around in a post-apocalyptic Seattle, looking to uncover past, family and the evil plans of the \"- I - Corporation\".</p><p>Most of the game involves beat-'em-up style hand-to-hand combat. Max can pull off a variety of flashy moves such as roundhouse kicks and backflipping off walls. The camera also enters the 'bullet time' mode when she does a combo sometimes. Certain levels ask you to assume use of the few stealth skills that Max has to offer.</p><p>The game features voiceovers by the actual stars of the show - Jessica Alba and Michael Weatherly.</p>"},{"name":"Jaws: Unleashed","year":2006,"developer":"Appaloosa Interactive Corporation","url":"microsoft_xbox_j/Jaws%20Unleashed%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6105861594,"score":6,"genres":"Action > Behind view > Puzzle elements > Horror > Licensed","desc":"<p>Based on the film series of the same name, players take control of the Great White killer shark known as \"Jaws\".  In an open-ended world, players visit Amity Island just in time for the 4th of July holiday season, and do what the predator does best: eat, kill, and destroy.</p><p>As the game progresses, Jaws will rampage through aquatic theme parks, chemical plants, beaches and more, facing off against boats, divers, and other marine life.  As players continue through the game, they will earn new upgrades that will allow Jaws to ram, bite, and survive with greater potency.  Up to 32 side quests are available, allowing various item and bonus feature unlockables.</p>"},{"name":"JSRF: Jet Set Radio Future","year":2002,"developer":"Smilebit","url":"microsoft_xbox_j/JSRF%20-%20Jet%20Set%20Radio%20Future%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6056956681,"score":8.2,"genres":"Action > Behind view > Anime / Manga > Tricks / stunts > Direct control > Cyberpunk / dark sci-fi > Crime","desc":"<p>A follow up to the Dreamcast title Jet Grind Radio. The setting is Tokyo in the year 2024. Freedom is a valuable commodity and freedom of expression even more so. Gangs of misbehaving teens strap on rocket-powered roller blades and skate, grind, and mark their territory with graffiti tags.</p><p>Players take the role of the GGs, and can choose between any member of the gang, each with different stats, while in gang HQ. The city of Tokyo can be leisurely explored without a time limit, but the heat will be turned up when story missions are activated and the GGs find themselves being challenged by rival gangs or under attack from the cops. This time around spraying no longer requires thumbstick inputs; just roll up and start spraying away, although large tags still require more cans than smaller tags. Each section of the city has hidden objectives that are revealed by finding a hidden tape, and once completed these challenges will unlock new graffiti patterns.</p><p>In multiplayer modes players can challenge each other to races, point battles, and other competitions both in zones from the single player game as well as in special arenas.</p>"},{"name":"Judge Dredd: Dredd vs Death","year":2003,"developer":"Rebellion Developments Ltd.","url":"microsoft_xbox_j/Judge%20Dredd%20-%20Dredd%20vs.%20Death%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6488318746,"score":6.3,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Licensed > Regional differences","desc":"<p>Judge Dredd is back. The comic book character who acts as judge, jury, and executioner makes another video game appearance in a first-person shooter set in the 22nd century, where crime and hopelessness run rampant amidst the chaos left behind from a nuclear holocaust.</p><p>Players must enforce the law using any means necessary within the sprawling, overpopulated Mega-City One, which serves as the gritty backdrop for <em>Judge Dredd: Dredd Vs. Death</em>. Players will battle vampires, the undead, and even a cadre of Dark Judges as they try to maintain some semblance of order in a world gone wild. In keeping with the spirit of the comic, some perpetrators of lesser crimes need to be arrested while others must be taken out with extreme prejudice. </p><p>The ultimate goal is to confront the evil Judge Death, who has taken it upon himself to cause as much mayhem and destruction to the beleaguered city as possible.</p>"},{"name":"Juiced","year":2005,"developer":"Juice Games Limited","url":"microsoft_xbox_j/Juiced%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6693545618,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Juiced</em> is a racing game, set in the fictive Angel City, that embraces the lifestyle and culture of street racing and tuning, similar to Need for Speed Underground, with slick, fully customizable cars, fast races, gaining respect and betting. The arcade mode offers quick races and in the custom mode you can set up events with unlocked cars and tracks. There are 52 vehicles from known manufacturers to acquire, and the game boasts a total of 7.5 trillion car customization possibilities. To make available all cars, tracks and parts, you need to progress in the career mode, where you build cars and participate in racing events to earn cash and respect. Aside from the traditional circuit and point-to-point races, there are also drag races (sprints) and show-offs with difficult maneuvers requiring advanced driving techniques.</p><p>When you achieve acclaim in the career mode, some of the eight racing crews in Angel City will offer a position on their team. Each crew has specific challenges and crew racing introduces additional gameplay elements. You have to organize events by phone, gamble, and race opponents for their cars (pink slip races). The team leader's respect is controlled by the amount of damage given and sustained (distress, which also affects the car's performance) and your personal car collection. In team races, there is a strategic element as you can control your team members' aggressiveness in-game.</p><p>Up to six player can race in the multiplayer mode, in which pink slip races, based on the car collection from the offline career mode, are also available. Statistics are organized on a world ranking server, with record times from singleplayer games and a rating based on your online performance. Ratings can be improved by beating higher-ranked players or multiple drivers in a single race.</p>"},{"name":"Jurassic Park: Operation Genesis","year":2003,"developer":"Blue Tongue Entertainment Pty, Ltd.","url":"microsoft_xbox_j/Jurassic%20Park%20-%20Operation%20Genesis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6729395247,"score":7.4,"genres":"Educational > Simulation > Strategy > 1st-person > Diagonal-down > Free-roaming camera > Ecology / nature","desc":"<p><strong>Jurassic Park: Operation Genesis</strong> puts you in the shoes of a Dr. Hammond-type scientist, and challenges you to build a dinosaur themed amusement park.</p><p>Similar to the first movie, you can lay down electric fences. Some fences have a higher electric discharge than others, and are meant for the bigger dinosaurs. While a 100 volt fence might keep a raptor safe, it might take a 500 volt fence to keep a T-Rex from escaping.</p><p>You have various buildings at your disposal, from the standard restaurant and bathroom to gift stalls and photo booths.</p><p>You can opt to construct a safari tour, like what took place in the first movie. You even have the ability to take the tour yourself, and see your park as your visitors see it.</p><p>One of the most important objects is the Ranger Station. With this building, you can have helicopters patrol your park to watch for any disasters. If a dino should escape, you have the option of entering the helicopter in a first person view to try to shoot the dino with a tranquilizer dart. If you want to stick to building only, you can let the AI capture the dino.</p><p>In order to breed a dinosaur, you must hire a team to locate fossils, then you must have the fossils analyzed. The whole process takes a while, but the longer you let your teams work, the longer your dino will live, and the happier your visitors will be. Force the team to give you the results early, and your dino might only live for ten days.</p><p>The different dino's require different resources. Herbivores require lots of trees and grass, while carnivores require goats and cows. Your carnivores may get tired of being fed, so you might have to send in a smaller sized dino (a raptor in a T-Rex pen, for example), for the larger dino to hunt.</p><p>The game includes multiple camera angles. You can rotate 360 degrees, zoom in and out, enter \"visitor\" cam, ride on the safari, take a scenic tour in a hot air balloon, or look out the helicopter.</p><p>Also included is a comphrensive guide to dinosaurs, geared to help you figure out what each dino likes and dislikes, and how to make them happy, as well as a brief history of each specific dino.</p>"},{"name":"Just Cause","year":2006,"developer":"Avalanche Studios AB","url":"microsoft_xbox_j/Just%20Cause%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5660529119,"score":6.6,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control > Helicopter > Spy / espionage","desc":"<p>You are Rico Rodriguez, a CIA-agent who is sent to the small Island of San Esperito to start a revolution and bring down the current regime under the rule of General Salvador Mendoza.</p><p>After you jumped out of the airplane and helped your local contact survive an attack by gang members, you have - much like GTA: San Andreas - the freedom to do what you want. The complete island is accessible from the beginning and you can either follow the main storyline, engage in side-missions, or collect items all over the place. To help the revolution you can also drive the government out of the individual sectors on the island. This is accomplished by a three-stages fight in which you have to go up against a huge army of government forces.</p><p>As a fully trained agent, Rico can also perform many stunts. He has always an parachute equipped which he can open whenever he has enough speed. So he often uses cars or bikes as a jump-pad and then sails smoothly into the sunset.</p><p>But of course he cannot impress the evil regime with that, so he also has access to a wide range of weapons from pistols with unlimited ammo to rocket launchers and machine guns. Rico is also trained to drive everything that has an engine, from a normal bike to a fully-armed military helicopter.</p>"},{"name":"Justice League Heroes","year":2006,"developer":"Snowblind Studios, Inc.","url":"microsoft_xbox_j/Justice%20League%20Heroes%20%28USA%2C%20Europe%29.zip","filesize":6639937923,"score":7.1,"genres":"Action > 3rd-person (Other) > Top-down > RPG elements > Licensed","desc":"<p>Military robots cause havoc in a high tech Metropolis research facility. In Finland, genetically-engineered creatures take over the top secret Deep Space Communications Array. A team of super powered criminals, having never worked together before, seize a Nevada missile base. And deep beneath the surface of Mars, dozens of alien warriors are released from their long imprisonment…</p><p>These seemingly unrelated events prove to be pieces of a sinister plan, and it will take Earth’s greatest superheroes to stop it: The Justice League!</p><p><em>Justice League Heroes</em> is an action game, also for two players cooperatively, based on the popular DC Comics series. Control DC’s most popular heroes: Superman, Batman, Wonder Woman, Green Lantern, Martian Manhunter, The Flash, Zatanna and a handful of unlockable characters like Aquaman, Green Arrow, Hawkgirl, Huntress, Hal Jordan, and Kyle Rayner. In addition, the PSP version features exclusive unlockable heroes: Supergirl and Black Canary.</p><p>Players battle through famous locations such as Metropolis, S.T.A.R. labs, and for the first time, the Justice League's Watchtower.</p><p>Many of DC’s greatest villains face against our heroes including Braniac, Killer Frost, Darkseid, and Doomsday. Boss battles are furious and unique, with no two defeated the same way.</p><p>Superpowers are developed through experience orbs collected from a wide range of enemies such as The White Martians, Brainiac’s assassin droids, and alternate-dimensional creatures. Some special orbs known as “boosts” can enhance superpowers. The boosts range from enhanced damage, efficiency, attack range, luck, speed, and super power duration. Multiple boosts can combine into a single, more powerful boost. Players can allocate their orbs and boosts to customize heroes to best suit their playing style.</p><p>Special shield icons placed throughout the game can be collected and spent to unlock characters and alternate costumes which affect the heroes' abilities as well their appearances.</p>"}]