[{"name":"Kabuki Warriors","year":2001,"developer":"LightWeight Co., Ltd.","url":"microsoft_xbox_k/Kabuki%20Warriors%20%28USA%29.zip","filesize":6803804189,"score":4.5,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Martial arts","desc":"<p>Kabuki Warriors is a sword-fighting samurai game where you travel from city to city to fight enemy Kabuki teams. Every time you win a fight, you can trade one of your current fighters with one of the team you've defeated, thereby improving your team as you advance.</p><p>Being Kabuki, every fight is a show that's delivered on a stage; you have to impress the audience to get access to better attack moves.</p>"},{"name":"Kakuto Chojin: Back Alley Brutal","year":2002,"developer":"Dream Publishing","url":"microsoft_xbox_k/Kakuto%20Chojin%20%28USA%29.zip","filesize":6214447787,"score":5.7,"genres":"Action > 3rd-person (Other) > Side view > Fighting","desc":"<p><strong>Kakuto Chojin</strong> is a hand-to-hand melee fighter, where you fight with your hands and feet instead of weapons and powermoves.</p><p>There are twelve fighters to choose from, each with their own fighting style, such as Jeet Kune Do, Kickboxing, Wrestling, etc. Each fighter also has his or her own special moves, which are more powerful than the basic moves.</p><p>KC is un-scripted, meaning every hit, jab, kick, punch, etc. will be executed in real-time, meaning a kick to the head won't always produce the same falling animation.</p><p>The game modes available are <em>Tournament, 2 Player</em> and <em>4 Player Battle Royal</em></p>"},{"name":"Kao the Kangaroo: Round 2","year":2004,"developer":"Tate Multimedia S.A.","url":"microsoft_xbox_k/Kao%20the%20Kangaroo%20-%20Round%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6599961463,"score":6.9,"genres":"Action > Behind view > Platform","desc":"<p><em>Kao the Kangaroo Round 2</em> is a third-person perspective platform game about a young, cute, yellow kangaroo, who saves animals from the hands of the evil Hunter and his equally evil colleagues. In order to bribe the guard and get aboard Hunter's ship, Kao must collect lots of coins scattered throughout the game. The main character can fight with his boxing gloves and can throw lethal boomerangs. </p><p>The game consists of 25 levels in 5 different worlds. Playing through the levels, the player must jump over platforms, make difficult leaps, and fight about 30 different types of enemies, free captured friends and solve many puzzles. Occasionally Kao will get to ride a vehicle like a barrel or a snowmobile. </p><p>Kao can also find purple crystals, which can be spent to buy minigames to play. There are also stars - collecting 50 of them will upgrade one of Kao's abilities, e.g. giving him the ability to stomp on the ground to defeat enemies around him. A rarely encountered item is a winged helmet, which, when grabbed, allows Kao to fly for a short while.</p>"},{"name":"Karaoke Revolution","year":2004,"developer":"Harmonix Music Systems, Inc.","url":"microsoft_xbox_k/Karaoke%20Revolution%20%28USA%29.zip","filesize":6524557594,"score":7.9,"genres":"Simulation > 3rd-person (Other) > Real-time > Board game > Music / rhythm > Licensed","desc":"<p><em>Karaoke Revolution</em> allows PlayStation 2 gamers to show off their singing skills and get real-time feedback on their performances. It's similar to Dance Dance Revolution, but with singing instead of dancing. </p><p>Players sing using the Logitech PS2 Headset (or other approved PlayStation 2 USB microphone devices). The game rates the player's performance based on their vocal pitch and timing. A visual indicator shows the player's current pitch in real time and also the pitch of vocals of the original song. If the original notes of the song are too high for the player's vocal range, the game allows the player to sing at higher or lower octaves to hit the correct notes. </p><p>If the player sings well, the crowd gets into the performance by clapping, cheering and dancing. If the performance is bad, the audience becomes bored and the user can get booed off the stage.</p><p><strong>Single Player Game Modes include:</strong></p><ul><li>Arcade Mode: where users sing 3–5 songs and try to score big points</li><li>Showtime Mode: Players start at a living room party and work to a huge concert at the Enormobowl. Additional venues include: a subway station, The Pit Stop, a county fair, the Superstar TV show, Club Avalanche, and a royal hall.</li><li>Karaoke Mode: Players can enjoy singing the song without having to worry about bring rated or scored.</li></ul><p><strong>Multi-player Game Mode include:</strong></p><ul><li>Arcade Mode: 2–8 players perform songs and try to be the player with the highest score at the end of each round. The player who wins the most rounds is the winner.</li><li>Karaoke Competition: 3–8 players compete against each other. The main twist of this mode is that each player rates the performance of the other players to determine the winner of the Karaoke competition.</li></ul><p>Over 35 songs from the '70s, '80s, '90s, and current hits including (as made famous by):</p><p>\"Addicted\" (Simple Plan), \"All You Wanted\" (Michelle Branch), \"Are You Happy Now?\" (Michelle Branch), \"Believe\" (Cher), \"Billie Jean\" (Michael Jackson), \"Bizarre Love Triangle\" (New Order), \"Broken Wings\" (Mr. Mister), \"Celebration\" (Kool and the Gang), \"Chain of Fools\" (Aretha Franklin), \"Complicated\" (Avril Lavigne), \"Crawling in the Dark\" (Hoobastank), \"Don't Know Why\" (Norah Jones), \"Every Morning\" (Sugar Ray), \"Everything You Want\" (Vertical Horizon), \"Girls Just Want to Have Fun\" (Cyndi Lauper), \"Hey Jealousy\" (The Gin Blossoms), \"Hit Me With Your Best Shot\" (Pat Benatar), \"How You Remind Me\" (Nickelback), \"I'm Coming Out\" (Diana Ross), \"It's The End of the World As We Know It\" (REM), \"Kiss Me\" (Sixpence None the Richer), \"Ladies' Night\" (Kool and the Gang), \"Like a Virgin\" (Madonna), \"One Week\" (Barenaked Ladies), \"Red Red Wine\" (UB40), \"Save Tonite\" (Eagle Eye Cherry), \"Science Genius Girl\" (Freezepop), \"She Talks to Angels\" (Black Crowes), \"Smooth Criminal\" (Michael Jackson/Alien Ant Farm), \"Son of a Preacher Man\" (Dusty Springfield), \"The Power of Love\" (Huey Lewis and the News), \"Waiting for Tonight\" (Jennifer Lopez), \"When a Man Loves a Woman\" (Michael Bolton), \"Wind Beneath My Wings\" (Bette Midler), \"You Really Got Me\" (Van Halen), \"You're the One That I Want\" (Less Than Jake)</p><p>Players can unlock extra characters, additional outfits, more songs, and behind the scenes videos.</p><p>The game includes an option for Expansion Discs - which means players will be able to karaoke to additional songs in the future.</p>"},{"name":"Karaoke Revolution: Party","year":2005,"developer":"Harmonix Music Systems, Inc.","url":"microsoft_xbox_k/Karaoke%20Revolution%20Party%20%28USA%29.zip","filesize":6652527255,"score":7.7,"genres":"Simulation > 3rd-person (Other) > Board game > Music / rhythm > Licensed","desc":"<p>The Karaoke Revolution continues with this entry which supports the DDR dance pad and EyeToy USB camera as well as the required USB microphone (a handheld microphone is included).  Karaoke Revolution Party features 50 new songs (ranging from Dean Martin's That's Amore to Beyonce's Crazy in Love) and a host of new party options.</p><p>Sing by yourself, in a duet, or compete one-on-one or in teams to show your Karaoke mastery.  Characters now have more customization options and you can use the EyeToy USB camera to really be the star of the show.  If you have a DDR dance pad, then you can put on a song and dance routine.  There are also a variety of minigames to test your vocal abilities including unique takes on volleyball and stage diving.</p>"},{"name":"Kelly Slater's Pro Surfer","year":2002,"developer":"Treyarch Corporation","url":"microsoft_xbox_k/Kelly%20Slater%27s%20Pro%20Surfer%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6720577624,"score":7.7,"genres":"Action > Sports > Behind view > Tricks / stunts > Surfing > Licensed","desc":"<p>Do you like to surf? Have you ever imagined surfing at different remote locations around the world? Well, Kelly Slater takes you around the world on his boat to surf some of the more famous beaches. With a control scheme similar to all the other Activision O2 brand games, it's easy to jump into the game and surf. </p><p><strong>Game Play Modes:</strong>  </p><p><strong>Infinite Time</strong> - With no clock, no objectives, and nobody around, this gives you the best opportunity to just enjoy the surf. </p><p><strong>High Score</strong> - With 3 minutes, how high of a score can you get?</p><p><strong>Icon Challenge</strong> - See how many icons you can collect and how high of a score you can get before time runs out.</p><p><strong>Career Mode</strong> - Select a surfer and journey around the world to surf the best waves on the best beaches. As you progress you will unlock new beaches, new surf boards, and new tricks which will be usable in all the other modes of play.</p><p><strong>Multiplayer Modes:</strong>  </p><p><strong>Push</strong> - Two players surf simultaneously in an attempt to \"push\" the split screen towards their opponent's half of the screen. As you score points the screen gets pushed more. The winner is decided once one player is pushed from the screen.</p><p><strong>Head to Head</strong> - Similar to Push but the screen is stationary and the winner is the person with the highest points when the time runs out.</p><p><strong>Time Attack</strong> - Players take turns to achieve the most points possible. The more points you get the less time is alloted to your opponent.</p><p>The Pros in the game: Kelly Slater, Lisa Andersen, Tom Carroll, Tom Curren, Nathan Fletcher, Donavon Frankenreiter, Bruce Irons, Rob Machado, Kalani Robb, and some other secret characters.</p><p>The beaches in the game: Sebastian, Trestles, Mavericks, Antarctica, Jaws, Pipeline, Teahupoo, Bells, Curren's Point, Kirra, G-Land, J-Bay, Mundaka, Cortez Bank, and perhaps some other tucked-away hide-aways.</p><p>The PS2 version of the game also includes a playable demo of Tony Hawk's Pro Skater 4.</p>"},{"name":"Kill Switch","year":2003,"developer":"Namco Hometek Inc."},{"name":"King Arthur","year":2004,"developer":"Krome Studios Pty Ltd.","url":"microsoft_xbox_k/King%20Arthur%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6317221036,"score":6.5,"genres":"Action > 3rd-person (Other) > Classical antiquity > Europe > Fantasy > Licensed","desc":"<p><em>King Arthur</em> is a 3D action game based on the Jerry Bruckheimer film of the same name. Players can choose to play as Arthur, Lancelot, Tristan, Bors, and Guinevere, each with their own attack moves and combos, and challenge friends through the multi-player combat option. Other game features include horseback combat levels and cutscenes that utilize footage from the movie.</p>"},{"name":"King of Fighters 2002, The","year":2005,"developer":"Eolith Co., Ltd.","url":"microsoft_xbox_k/King%20of%20Fighters%202002%2C%20The%20%28USA%2C%20Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6734935349,"score":7.3,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy > Martial arts","desc":"<p>The second plotless \"dream match\" in <em>The King of Fighters</em> series, this game sports 39 normal characters and 5 hidden characters, some of whom haven't appeared since KOF98. <em>The King of Fighters 2002</em> also has five characters exclusive to the X-Box, the PS2 and/or Dreamcast systems: Shingo Yabuki, King, Geese Howard, \"Riot of the Blood\" Iori and Leopold Goenitz. Shingo and King are available on all the non-Neo Geo systems, while Geese and the rest are only available on the PS2 and X-Box platforms.</p><p>The gameplay system has also changed. The striker system and four-character teams found in the last three KOF releases have been totally removed. In their place are the old-school three man teams and the \"Advanced system\" from The King of Fighters '97 and The King of Fighters '98.</p>"},{"name":"King of Fighters 2003, The","year":2005,"developer":"SNK Playmore Corporation","url":"microsoft_xbox_k/King%20of%20Fighters%202003%2C%20The%20%28USA%2C%20Japan%29%20%28En%2CJa%29.zip","filesize":6747286287,"score":7.1,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>The tenth installment in SNK's long running King of Fighters series, and the last KOF to appear on the Neo Geo system. This game's storyline focuses on the unexpected return of the Orochi power, who was thought to have been permenantly sealed away back in 1997 by Kyo Kusanagi, Iori Yagami and Chizuru Kagura. It appears that someone has been tampering with the seal, however...</p><p>This year there are 30 characters, 2 edit characters (Kyo Kusanagi and Iori Yagami) and 2 hidden characters (Kusanagi from KOF '02 and Chizuru Kagura) to choose from. There are several returning characters (Jhun Hoon, King, Shingo Yabuki, Hinako Shijou, Billy Kane and Ryuji Yamazaki) and few new fighters as well (Ash Crimson, Shen Woo, Duo Lon, Malin, Adelheid Bernstein and Mukai).</p><p>Like The King of Fighters 2002, this game reverts back to the old 3-on-3 format used from KOF '94 to KOF '98. A new feature to this game that old-school KOF fans might have trouble getting used to is the new interchangeable team system. You still pick three characters and decide your character order before a match, but now you have the option to change to another character during a match. For example, if your character is low on power during a match, you can have either one of the other two characters at your disposal step in and take their place. It also works if you do not like the character that you have selected, or if you are having trouble using that character. You can change at any time during a match, but you cannot when two of your teammates have been taken out, and only one character is left in reserve.</p>"},{"name":"King of Fighters, The: Neowave","year":2006,"developer":"SNK Playmore Corporation","url":"microsoft_xbox_k/King%20of%20Fighters%2C%20The%20-%20Neowave%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6468484846,"score":6.6,"genres":"Action > Side view > Anime / Manga > Arcade > Fighting > Martial arts","desc":"<p>King of Fighters Neowave is a 2D fighting game where you select a team of 3 fighters and compete against other teams of 3 fighters with the ultimate goal of reaching the final boss and defeating him.</p><p>King of Fighters Neowave was developed for the Atomiswave arcade hardware and has now been ported to home systems. Fight using a team of 3 fighters chosen from 43 characters plus several secret characters. Backgrounds are now detailed 3d models replacing the flat backgrounds of previous King of Fighters games. Choose from 3 different fighting styles, Super Cancel, Guard Break and Max 2. Try endless mode where you fight an unlimited number of opponents. This game also features a practice mode and an art gallery.</p>"},{"name":"Kingdom Under Fire: Heroes","year":2005,"developer":"BLUESIDE Inc.","url":"microsoft_xbox_k/Kingdom%20Under%20Fire%20-%20Heroes%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CKo%29.zip","filesize":6205883228,"score":7.5,"genres":"Action > Role-playing (RPG) > Strategy > 3rd-person (Other) > Real-time > Fantasy","desc":"<p>This is the prequel to the action/RTS Kingdom Under Fire: The Crusaders for the Xbox. Six of the sub-characters from The Crusaders are now playable main characters in Heroes, along with one new character Walter. Each has its own story campaign.</p><p>The gameplay is similar to the predecessor, featuring action, RTS, and RPG elements. The player controls several troops, ranging from basic types such as infantry, archers, spearmen, and cavalry archers; to more advanced ones like siege units, mortars, aerial bombers, wyverns, giant scorpions, and mammoths. In Heroes, there are also four new elemental troops: ice maidens, earth golems, thunder rhinos, and flame wraiths.</p><p>The troops engage in RTS style combat, although commands are issued to entire troops instead of individual soldiers. When the troop led by the main character enters battle, the player fights in 3rd person action mode. Each of the seven playable characters has its unique set of attack moves and combos. Some are quick and agile; others like the ogre Urukubarr are slow but powerful.</p><p>After each battle the player enters the World Map and upgrades all of his troops with new skills, weapons, and armor. Hiring different officers to lead troops gives them special magic abilities. The player moves to different locations in the World Map to engage in new battles.</p><p>The multiplayer aspect has been significantly improved in Heroes to allow 3 on 3 strategy mode (The Crusaders supported 2 on 2), leader combat between only the playable characters, or co-operative mode against invasion from CPU-controlled troops.</p>"},{"name":"Kingdom Under Fire: The Crusaders","year":2004,"developer":"Phantagram Co., Ltd.","url":"microsoft_xbox_k/Kingdom%20Under%20Fire%20-%20The%20Crusaders%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6584951257,"score":7.6,"genres":"Role-playing (RPG) > Strategy > 3rd-person (Other) > Real-time > Fantasy","desc":"<p>This is a rare breed of console game: an RTS. It is the sequel of Kingdom Under Fire: A War of Heroes, by Korean developers Phantagram which was released only for PCs with little success. The sequel combines traditional RTS gameplay with action elements in order to better accommodate console gamers and the lack of a mouse.</p><p>Men (the kingdoms of Hironeiden and Ecclesia) and the Dark Legion (comprised of various evil fantasy races) clash for dominance of their world in a four part single player campaign. Fifty years have passed since the Second Great War of Heroes, whose events were described in the previous game. The Ancient Heart, the legendary artifact which caused the War has vanished, the war itself was forgotten and peace reigned over the land. Or so it seemed...</p><p>The player assumes the role of commander for each of the four armies which take part in this war, and must lead his troops to victory by actually fighting in the battles and also by issuing orders to them. The hero accumulates experience points while fighting, thus increasing his skills.</p>"},{"name":"Knight's Apprentice: Memorick's Adventures","year":2004,"developer":"Microïds Canada Inc.","url":"microsoft_xbox_k/Knight%27s%20Apprentice%20-%20Memorick%27s%20Adventures%20~%20Memorick%20-%20The%20Apprentice%20Knight%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6812877939,"score":5.9,"genres":"Action > 3rd-person (Other) > Fantasy","desc":"<p><em>Knight's Apprentice</em> is a third-person platformer with similarities to Jak &amp; Daxter and Zelda games. You play as Memorick, Merlin's apprentice sorcerer that would have preferred to be a knight, in a quest to free Avalon from Morganna, her brother Mordred and the evil Queen Maab. On your way you will meet several Knights of the Round Table, King Arthur himself, and even hold Excalibur against hordes of villains.</p>"},{"name":"Knights of the Temple II","year":2005,"developer":"Cauldron Ltd.","url":"microsoft_xbox_k/Knights%20of%20the%20Temple%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6617595171,"score":6.5,"genres":"Action > Role-playing (RPG) > 1st-person > 3rd-person (Other) > Fantasy","desc":"<p>In <em>Knights of the Temple II</em>, you again play the role of a Templar knight: Paul de Raque, the grandmaster of the Order of the Temple. The game is set in medieval 13th century Europe and the Middle East. The story revolves around the new crusade of our hero to recover 3 ancient pagan artifacts essential to prevent the imminent attack of the demon armies into our realm of existence.</p><p>It is a 3D 3rd-person action game with RPG elements. Gameplay consists of completing quests through travelling in the various locations in the game or battling your way through enemy men and monsters.</p><p>The storyline for one is non-linear. At the start of the game you can choose 1 out of 3 locations to visit. Advancing in the game will unlock new locations. Each location is either a city or town where you can advance in the primary mission, obtain sub-quests, trade, meet people, etc. or it could be a dungeon type location crawling with monsters. Often its a little combination of both.</p><p>Most of the gameplay (when not exploring cities) revolve around combat and character development. Combat consists of 3D 3rd Person Perspective point of view where you can attack enemies using various skills, abilities and attack combo's. Each of which can be upgraded at any point of the game by spending experience points to the pointed skill, ability or combo.</p><p>On character development, there are 3 major areas that may be upgraded: (1) Knightly Abilities; Spiritually oriented gifts of the Templar knight: from healing to other holy abilities. (2) Skill Abilities; These are usually attack-based skills. Various attacking styles to soften and defeat both men and monster. (3) Combo's. The extension of the \"attack button\". Upgrading the combo section provides additional attack moves.</p><p>Combat also is uniquely divided into 3 different weapons. The first is the standard Sword and Shield, providing high defense and standard attack, useful in defensive stances and vs. ranged enemies; The second is the 2-handed weapon, primary for direct damage in close-combat against single or multiple enemies; The third is ranged combat using a crossbow. The perspective in ranged combat diverts to 1st person perspective (though you can still see your head). </p><p>During the course of the game, you can obtain additional weapons and armor (as well as other items), either from the course of a sub-quest or purchasing it from a local trader.</p>"},{"name":"Knights of the Temple: Infernal Crusade","year":2004,"developer":"Starbreeze Studios AB","url":"microsoft_xbox_k/Knights%20of%20the%20Temple%20-%20Infernal%20Crusade%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6101041009,"score":6.6,"genres":"Action > 1st-person > 3rd-person (Other) > Hack and slash > Europe > Fantasy > Medieval > Middle East","desc":"<p><em>Knights of the Temple</em> is a dynamic camera third-person hack and slash game set in medieval times.</p><p>You take the role of Paul, a fresh-baked Templar knight on his first Crusade, to stop the end of the world. Fighting your way through the somber gloom of European monasteries and villages to the colourful bazaars and powerful bastions of the crusader castles under the blazing sun of the Holy Land. Even enter the realms of hell and face your worst nightmares. </p><p>As the game progresses, Paul gains new sword combos and even divine powers enabling him to heal himself, conjure up a divine shield around himself and even shoot off homing fireballs that seek out his enemies.</p>"},{"name":"Knockout Kings 2002","year":2002,"developer":"Black Ops Entertainment, LLC","url":"microsoft_xbox_k/Knockout%20Kings%202002%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6748582488,"score":7.6,"genres":"Sports > 3rd-person (Other) > Boxing","desc":"<p>Knockout Kings 2002 is a boxing game brought to you EA Sports.</p><p>You can choose to fight as a bunch of different real life boxers, such as Muhammad Ali, Evander Holyfield, Trinidad, Lewis and De La Hoya, or you can create a custom boxer and play through a career mode.</p><p>In addition to Career, you can play in Exhibition or Tournament mode.</p><p>KK2002 features an improved control scheme which results in faster and more accurate control.</p><p>KK2002 features Judge Mills Lane, the judge of the daytime TV court show of the same name, as one of the referees.</p>"},{"name":"KOF: Maximum Impact","year":2005,"developer":"Noise Factory Co., Ltd.","url":"microsoft_xbox_k/KOF%20-%20Maximum%20Impact%20-%20Maniax%20%28USA%29.zip","filesize":6815986719,"score":7,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p>The Addis gang, which has long controlled Southtown, has been struck a major blow. Their leader, Fate, has been killed by Duke, leader of the newfound Mephistopheles gang. The subsequent warfare between the two gangs has decimated Southtown. In the midst of all this chaos, a new fighting tournament has begun, with claims that it is being sponsored by the Metatron Foundation charity. Twenty fighters step up to the challenge.</p><p>KOF: Maximum Impact - Maniax is the first 3D iteration of the venerable King of Fighters series. The game features fourteen returning characters:</p><ul><li>Athena Asamiya</li><li>Clark Steel</li><li>Iori Yagami</li><li>K'</li><li>Kyo Kusanagi</li><li>Leona Heidern</li><li>Mai Shiranui</li><li>Maxima</li><li>Ralf Jones</li><li>Rock Howard</li><li>Ryo Sakazaki</li><li>Seth</li><li>Terry Bogard</li><li>Yuri Sakazaki</li></ul><p>Six new combatants are also available:</p><ul><li>Alba Meira</li><li>Chae Lim</li><li>Duke</li><li>Lien Neville</li><li>Mignon Beart</li><li>Soiree Meira</li></ul><p>Maximum Impact also features four distinct modes of play:</p><ul><li><strong>Story Mode -</strong> Choose a fighter and guide them through a series of fights in the tournament.</li><li><strong>Versus Mode -</strong> Face off against an opponent in a 1-vs-1 or 3-vs-3 team match.</li><li><strong>Mission Mode -</strong> Go through a series of missions with unique setups and goals in an attempt to unlock additional game features.</li><li><strong>Time Attack Mode -</strong> Face the clock as you race to defeat a string of opponents.</li></ul><p>Online multiplayer over Xbox Live includes head-to-head fighting, re-match (instantaneously battle your opponent again and again) and a tournament mode. There are also four different jump attacks per character and a new sideways move. During gameplay, you can pause the game and take photographs from all angles with the stop action camera. You can review all aspects of the characters in the profile mode, and you can even choose between English and Japanese language in each battle. </p><p>As an added bonus the PS2 version includes a bonus dvd with making-of videos and behind the scenes interviews.</p>"},{"name":"Kung Fu Chaos","year":2003,"developer":"Just Add Monsters Ltd.","url":"microsoft_xbox_k/Kung%20Fu%20Chaos%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6297024985,"score":7.4,"genres":"Action > 3rd-person (Other) > Fighting > Martial arts","desc":"<p>Hong Kong action director Shao Ting is ready to film his latest blockbuster movie, but the lead role is still up for grabs. As one of many 70's action heroes, you must prove yourself worthy to be the hero of the great directors film, by fighting in a range of movie sets against the rest of the acting crew who wish to knock you out of the race for super hero. The cartoon style allows for over the top action sequences, some based on movie events of classic martial arts movies from over the years.</p><p>A collection of single and multi-player modes are available, including the straight up 4 player duel, teamplay, minigames based around classic events, and a range of combat moves and styles to defeat the enemy.</p>"}]