[{"name":"L.A. Rush","year":2005,"developer":"The Pitbull Syndicate Limited","url":"microsoft_xbox_l/L.A.%20Rush%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6693604590,"score":6.1,"genres":"Racing / Driving > Behind view > Automobile > Street racing","desc":"<p>You are Trikz, a well-known street racer who lives the good life: A fat crib, lots of money, and an impressive collection of pimped-out rides. However, your arch-enemy Lidel, fuming with envy, uses his connections to take all that away from you. Your cash? Your place? Your beloved cars? All gone.</p><p>You are now set on getting it all back from Lidel, and, while you're at it, stealing his girl's heart too. You begin your mission at the bottom with some punk-ass car, winning back money and cars race by race. There are many kinds of races, like Endurance Races, Stunt Races, Cross-town Races, and many more.</p><p>As the name suggests, the game is set on the streets of Los Angeles, which is filled with traffic and cops that stand in your way to fame and fortune. Being set in the street racer scene, the game also offers lots of possibilities to pimp out our cars (through a tie-in with West Coast Custom), and the game's soundtrack is full with (edited, T-rated) hip-hop.</p>"},{"name":"l'Abbaye des Morts","year":2016,"developer":"Locomalito"},{"name":"Land of the Dead: Road to Fiddler's Green","year":2005,"developer":"Brainbox Games","url":"microsoft_xbox_l/Land%20of%20the%20Dead%20-%20Road%20to%20Fiddler%27s%20Green%20%28USA%29.zip","filesize":6685568064,"score":5.5,"genres":"Action > 1st-person > Horror > Licensed","desc":"<p><em>Land of the Dead: Road to Fiddler's Green</em> is a FPS prequel to the 2005 George A. Romero film. It is also the first game based on a George A. Romero property. </p><p>You are Jack, a hick farmer who wakes up to find a stranger on his property. The stranger is a zombie, the first of many he encounters in the game. Using whatever ranged and melee weapons he can find, Jack pummels the undead back to where they came from in the goriest fashion possible. He works his way through a number of typical Romero locales (50's style hospital, cornfields, abandoned police station, loading docks, etc) on his way to Mr. Kaufman's walled city. Once there, Mr. Kaufman asks Jack to help him clean up Fiddler's Green, a luxury condominium tower. This is where the game ends, and the movie picks things up.</p><p><em>Land of the Dead: Road to Fiddler's Green</em> features an interesting limb specific damage system, meaning the player can literally blow the undead to pieces. It also features multiplayer over Xbox live, system link and Internet (PC). Up to eight players can enjoy deathmatch, team deathmatch, capture the flag and invasion modes with a twist - hungry zombies are coming after everyone!</p>"},{"name":"Lara Croft: Tomb Raider - Legend","year":2006,"developer":"Buzz Monkey Software, LLC","url":"microsoft_xbox_l/Lara%20Croft%20Tomb%20Raider%20-%20Legend%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5395988631,"score":7.8,"genres":"Action > Behind view > Platform > Puzzle elements > Quick Time Events (QTEs) > Direct control","desc":"<p><em>Legend</em> is the seventh major game in the Tomb Raider series, now for the first time developed by Crystal Dynamics, along with the original character designer of the game's protagonist Lara Croft: Toby Gard.</p><p>Heroine Lara is searching for a South American relic, but her adventure takes a different course when rogue anthropologist Amanda Evert shows up. Presumed dead along with a team of graduate students after an accident in a tomb in Peru, where Lara was the only one to escape, Amanda is back with a score to settle as they both race, along with the shady James Rutland Jr., to obtain an ancient artifact. Many other characters, both friends and foes, will stir things up. The story takes Lara through locations all over the world, from the Himalayas to Ghana, Kazakhstan, Bolivia, Japan, and England, including her famous mansion filled with secrets and collectibles. Aside from current events, Lara's past is also revealed, through flashbacks. Among other things, you will get to know how she lost her mother and why it is such a burden.</p><p>The typical third-person action-adventuring exploring is still present. Lara can move more freely and is no longer limited by specific jumps. As you travel through rough environments, you will need to run, dive, swim, climb on poles, ladders, roofs, use zip lines, shimmy, and vault, with acrobatic actions such as somersaults and flips. You need to cross difficult terrain, solve puzzles to advance or open up new areas, and engage in combat. New tools include a grappling hook, not only used to move around but also to haul enemies Scorpion-style, binoculars, a PLS (personal light source), flares, a PDA and a headset to keep in contact with tech support Zip.</p><p>Enemies are still rather scarce. Both humans and animals will attack you, and the game retains the auto lock-on mode, but now with a slide attack and close combat with both kicks and punches, plus bullet-time actions to get behind enemies quickly. Lara carries her trademark dual-wielded pistols, but can also pick up new weapons along the way, such as a shotgun and grenades. Missions take place in both indoor and outdoor environments, with arcade motorcycle and jeep sequences in between. As usual, Lara has a fancy outfit for each location.</p><p>The PSP version includes the full game and adds a multiplayer mode: Tomb Trials. You can race another player through tombs to see who comes out first, or go on a timed scavenger hunt for artifacts.</p>"},{"name":"Largo Winch: Empire Under Threat","year":2002,"developer":"Ubi Soft Annecy Studios","url":"microsoft_xbox_l/Largo%20Winch%20-%20Empire%20Under%20Threat%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6818108604,"score":6.6,"genres":"Adventure > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>This adventure game is based on the famous comic book character of the same name. The hero - Largo was a Yugoslavian orphan, who was adopted by the world's wealthiest man, who was in search of an heir. When his adoptive father dies, the now 26-year-old Largo inherits the Winch Corporation, a financial consortium worth more than 10 billion dollars. Drawn to the challenge of presiding over such a vast empire, Largo takes over from his father and plunges headfirst into a new, unexpectedly vicious world of murder and deceit.</p>"},{"name":"Le Tour de France","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd."},{"name":"Legacy of Kain Series, The: Blood Omen 2","year":2002,"developer":"Crystal Dynamics, Inc.","url":"microsoft_xbox_b/Blood%20Omen%202%20-%20The%20Legacy%20of%20Kain%20Series%20%28Europe%29.zip","filesize":6046760880,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Steampunk > Horror","desc":"<p>Following the events of Legacy of Kain: Blood Omen, the vampire Kain has assembled an army of vampires to take over the world of the humans. Fighting across Nosgoth, his goal is to make his way to the great city of Meridian and take control of this stronghold. However, upon reaching the gates of the city, the army is challenged by the Serafan Order, an organized force of vampire hunters and its leader, the magical Serafan lord. Kain engages the Serafan lord in single combat, is struck down and defeated. Kain's sword, the Soul Reaver, is claimed by his enemy. Unconscious for 200 years, Kain awakes under the care of the vampire Umah to a world he barely recognizes. Following the defeat of Kain's army, the vampires have been hunted down by the Serafan and only a few remain. The city of Meridian is ruled under martial law by the Serafan Order, which is very oppressive towards its citizens. Strange glyph magic is used to power machines and fuel industry and at the same time is deadly to vampires and used as wards throughout the city. Kain swears revenge on the one who defeated him and seeks to reclaim his place as the ruler of the vampires.</p><p><em>The Legacy of Kain Series: Blood Omen 2</em> is a third person action game with adventure elements, more similar in perspective to Soul Reaver than the first <em>Blood Omen</em> game. The player views the environment from behind Kain's shoulder, moving him in different directions, attacking, jumping, using dark gifts, and grabbing on to ledges. Kain's life energy steadily depletes and must be replenished constantly by drinking blood. Blood is found by consuming any living creature nearby, often requiring defeating an enemy through combat first. As Kain consumes blood, his meter is filled up. Once full, Kain gains additional health. Kain also learns new dark gifts throughout the game by defeating boss creatures. Some gifts include: the ability to blend into mist, fire projectiles, use projectile telekinesis or make a great horizontal leap. Many of these abilities can be used to perform stealth kills which will instantly defeat a foe. Kain will fight using his bare hands or by picking up daggers, swords, axes, and other weapons. These weapons all attack differently, eventually breaking, and may also be thrown at enemies from afar.</p><p>The Serafan Order uses glyph magic, partially because it is deadly to vampires. Kain will often encounter areas where he is barred from progressing because of glyph barriers and must find a way around them. Additionally, glyphs function similar to electricity in that they power machines and switches. Many of the puzzles featured in <em>Blood Omen 2</em> involve needing to create a glyph circuit in order to deliver power to a specific point. Glyph energy glows as it travels down its path, allowing the player to see exactly where the energy spark is.</p>"},{"name":"Legacy of Kain: Defiance","year":2003,"developer":"Crystal Dynamics, Inc.","url":"microsoft_xbox_l/Legacy%20of%20Kain%20-%20Defiance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5834932074,"score":7.6,"genres":"Action > Behind view > Puzzle elements > Fantasy > Horror","desc":"<p>Following the events of Legacy of Kain: Soul Reaver 2, Raziel and Kain were trapped in the Serafan fortress. Separated by sudden events, Raziel was forced to retreat into the spectral realm, leaving Kain to escape from the Serafan on his own. Both must escape the predicament they find themselves in and fight back against those who would seek to use them as manipulations in a grander plot. From both heroes cry out shouts of defiance, and a thirst to find the revelations that have been buried in the world of Nosgoth.</p><p><em>Legacy of Kain: Defiance</em> is a third-person action game with light puzzle-solving elements, combining concepts seen in both Blood Omen 2 and Soul Reaver 2. The story unfolds through chapters, focusing alternately on Kain and Raziel as they pursue their separate, though intertwined quests. Control of each character alternates between levels, however both are controlled from a behind-the-shoulder perspective. While both heroes are different, they are similar in movement, ability to attack, defend, jump and access special abilities. </p><p>Kain and Raziel no longer pick up weapons, instead both using a form of the Soul Reaver weapon (Kain uses the physical sword form, Raziel uses an energy blade). Each Soul Reaver can now be \"charged\" to unleash a special ability, determined by the current alignment of Soul Reaver at the time. Both Kain and Raziel lose energy at a constant rate and must feed to replenish life energy (Kain feeds on the blood of living creatures, Raziel feeds on the souls of living and non-living creatures). And both Kain and Raziel feature telekinetic abilities to manipulate objects at a distance. </p><p>The two are, however, different characters that play differently, each requiring use of his talents, to bypass obstacles (sometimes the same obstacle). Kain focuses on strong combat and destructive abilities. He is able to power up the Soul Reaver weapon using properties of the Pillars of Nosgoth. Raziel is more subtle, able to use stealth and the phasing between material and spectral worlds in order to discover new paths. As in <em>Soul Reaver</em>, Raziel can phase into the spectral world at any time but must find a special location in order to phase back. Raziel powers up the Soul Reaver using elemental powers.</p>"},{"name":"Legend of Spyro, The: A New Beginning","year":2006,"developer":"Krome Studios Pty Ltd.","url":"microsoft_xbox_l/Legend%20of%20Spyro%2C%20The%20-%20A%20New%20Beginning%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6568995801,"score":6.9,"genres":"Action > Diagonal-down > 2D scrolling > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>The Legend of Spyro: A New Beginning deals with Spyro's birth and his journey to meet his destiny. The intro shows Spyro being rescued by a Guardian Dragon called Ignitus from the attack of the \"Dark Master\". After his eclosion, Spyro is raised by dragonflies in a swamp until one day he discovers that he is in fact a dragon, and he and his half-brother, the dragonfly Sparx, leave the swamp to find out more about Spyro's past and fight the forces of evil.</p><p>In contrast to previous Spyro games, the emphasis is put on combat instead of platforming. Spyro can do several combat moves, using both his tail and his claws, and has four different breath attacks: fire, electricity, ice, and earth. The game also features several rail shooter passages similar to games like Panzer Dragoon.</p>"},{"name":"Legends of Wrestling","year":2002,"developer":"Acclaim Studios Salt Lake City","url":"microsoft_xbox_l/Legends%20of%20Wrestling%20%28Europe%29.zip","filesize":6853801987,"score":5.6,"genres":"Sports > Wrestling > Licensed","desc":"<p><em>Legends of Wrestling</em> takes one of America's most popular (fake) sports and turns back the clock. The game is all about the classic superstars including Hulk Hogan, Bret \"Hitman\" Hart, Jerry \"The King\" Lawler, Jimmy \"Superfly\" Snuka, Rob Van Dam, Terry Funk, The Road Warriors and George \"The Animal\" Steele.</p><p>The game features in-depth match analysis and career guidance by some of wrestling's greatest managers, including Captain Lou Albano and \"The Mouth Of The South\" Jimmy Hart. They will guide you through your career should you chose that mode of play. For those who just want to hit the mats right away, you can simply jump into an exhibition match in several match types including Tag Team Challenge, Three- and Four-Way Dances, and special guest referees.</p>"},{"name":"Legends of Wrestling II","year":2002,"developer":"Acclaim Studios Salt Lake City","url":"microsoft_xbox_l/Legends%20of%20Wrestling%20II%20%28Europe%29.zip","filesize":6536820959,"score":6.5,"genres":"Sports > 3rd-person (Other) > Direct control > Wrestling","desc":"<p>The sequel is enhanced and improved first part, in which you control a fighter or a party of them in most unbloody fighting sport, which is called wrestling. Over 65 famous \"Champions\" are available to you, such as Hulk Hogan, Andre The Giant, Rowdy Roddy Piper, Bruno Sammartino, Bret \"Hitman\" Hart, Sid Vicious, \"Big Poppa Pump\" Scott Steiner and Jerry \"The King\" Lawler.</p><p>There are many types of fights, including 6- and 8-man Elimination Bouts, Cage, Battle Royal, Ladder, Table and 3- and 4-way dances, also Body Slam Challenge with Big John Studd and tag-team tournaments with great teams such as The Road Warriors, Steiner Brothers, British Bulldogs, Nasty Boys, Rock-n-Roll Express and more.</p><p>Create-A-Legend feature now is bigger and better, allowing players to make their ultimate grappler.</p>"},{"name":"LEGO Star Wars II: The Original Trilogy","year":2006,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_l/LEGO%20Star%20Wars%20II%20-%20The%20Original%20Trilogy%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CDa%29.zip","filesize":6156296871,"score":7.9,"genres":"Action > 3rd-person (Other) > Cinematic camera > Platform > Sci-fi / futuristic > Licensed","desc":"<p>The Legos strike back in the sequel to the original LEGO Star Wars: The Video Game, where players now get to explore the original trilogy (Episodes IV, V, and VI) of the <em>Star Wars</em> movie series. Players use LEGO-ized Star Wars characters to reenact all three of the original movies. All of the sets and props are also made out of LEGO bricks, and retain their properties such as the ability to be rebuilt and fall apart. Like its predecessor, the game puts a spin on the series by adding a light-hearted, humorous touch to the movies, and also by using no dialogue. </p><p><em>LEGO Star Wars II</em> is a third-person action game with platforming elements. Players take control of the characters and vehicles of Star Wars. In Story Mode, players reenact the key events of the original movies with LEGO bricks. Each character has different weapons, like lightsabers for Jedi or crossbows for Wookies, as well as new character-specific attacks and maneuvers. Each character also has different abilities, e.g. Jedi being able to use the force, R2-D2 being able to unlock doors, or Boba Fett being able to use his jetpack. It is up to the player to use these abilities to solve simple puzzles and traverse the levels of the game. Vehicle levels are more prominently featured than in the previous game, with longer sequences dedicated to piloting traditional Star Wars aircraft.</p><p>In addition to a single-player game, there is also a co-op mode that allows two players to go through the Story Mode. In the single-player mode, the second character is controlled by the AI. Like in the first game, the Free-play mode allows players to go back and replay beaten levels with any playable character they have unlocked. A new feature allows players to create their own mixed-up LEGO characters and vehicles. Power Brock items and coin stubs collected in Story Mode will also unlock new characters, vehicles, and items for players to experiment with.</p>"},{"name":"LEGO Star Wars: The Video Game","year":2005,"developer":"Traveller's Tales (UK) Ltd.","url":"microsoft_xbox_l/LEGO%20Star%20Wars%20-%20The%20Video%20Game%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CDa%29.zip","filesize":6167277118,"score":7.7,"genres":"Action > 3rd-person (Other) > Platform > Sci-fi / futuristic > Licensed","desc":"<p><em>LEGO Star Wars: The Video Game</em> allows players to relive the events of the <em>Star Wars</em> prequel movie trilogy (Episodes I, II and III) in LEGO form. Players take control of over thirty characters to play through key moments from <em>The Phantom Menace</em>, <em>Attack of the Clones</em> and <em>Revenge of the Sith</em>. The storyline includes most of the important events in the movies, omitting or adding a few sequences. The presentation of these events, however, is humorous, with all the characters and environments made out of LEGO bricks. Objects would often break apart like physical LEGO bricks, characters have comical expressions, and all dialogue from corresponding events from the movies is replaced by gestures.</p><p>The basic gameplay is action with platforming and light puzzle-solving elements. Players navigate two or more characters through stages, each representing a chapter in a movie. These chapters must be unlocked in a plot-dictated order, eventually completing the entire movie. Characters use different weapons (blasters, lightsabers, crossbows, etc.), and each character type also possesses specific abilities. For example, Jedi can use the force to lift, combine, and destroy objects; robots can unlock encrypted doors; other characters may use a grappling hook to access higher platforms, etc. Some of these abilities overlap (i.e. a problem can be solved in more than one way), though often a specific type of character is required to deal with the situation. In the single-player mode, one player can switch between the available characters; in the co-op mode, two players navigate at least two different characters.</p><p>A few levels involve players piloting aircraft, fighting hostile vehicles, overcoming obstacles or destroying targets on the ground. The Free Mode allows players to access previously visited stages with any characters they have unlocked. This may lead to a discovery of previously inaccessible areas. Various collectible items and LEGO studs (which serve as currency) can be gathered during exploration. Characters cannot permanently die in the game; when a character is killed, he or she only loses collected LEGO studs.</p>"},{"name":"Leisure Suit Larry: Magna Cum Laude","year":2004,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_l/Leisure%20Suit%20Larry%20-%20Magna%20Cum%20Laude%20%28Europe%29.zip","filesize":6407128274,"score":6.1,"genres":"Action > 1st-person > 3rd-person (Other) > Mini-games > Puzzle elements > Quick Time Events (QTEs) > Adult > Comedy","desc":"<p>Larry Lovage learned everything he knows from his uncle, Larry Laffer, the famous polyester-clad fellow who starred in the previous games. Young Larry finally makes it to college, <em>the best</em> place to meet and pick up girls. He finds them <em>everywhere</em> .. in restaurants, night clubs, dormitories and at fraternity parties. All those scantilly clad, gorgeous babes! But, does Larry have half a chance <em>to score</em> with even one of them? Will he get a peek at what's underneath that braless, too-tight tank top?</p><p>Larry's sexcapades include varied types of arcade mini-games. Some simply require good reflexes while others involve memory and/or correct timing. For instance, steer a little joker sperm through an obstacle course of flying objects, all the while trying to keep the \"course\" of the conversation on track. Or .. put the correct ingredients into a bar drink in order - and in the time allowed. Several of the games become more difficult as the game progresses.</p><p>This action/adventure features three endings, over 20 locations, 3D graphics, and hilarious adult situations and conversations.</p>"},{"name":"Lemony Snicket's A Series of Unfortunate Events","year":2004,"developer":"Adrenium Games","url":"microsoft_xbox_l/Lemony%20Snicket%27s%20A%20Series%20of%20Unfortunate%20Events%20%28Europe%29.zip","filesize":6453516922,"score":7.3,"genres":"Action > Behind view > Puzzle elements > Steampunk > Licensed","desc":"<p>Life for the Baudelaire orphans is incredibly unpredictable and rather unfortunate.  After losing their parents in a mysterious fire, the orphans are sent to live with their sinister uncle, Count Olaf, who will stop at nothing to get his greedy hands on the Baudelaire famile fortune!  Only by combining their talents will the orphans have a chance to defeat the evil Count Olaf and his horrible henchmen.</p><ul><li><p>Play as all three Baudelaire orphans, each with their own unique skills.</p></li><li><p>Adventure through 16 action-packed missions based on the movie and book series.</p></li><li><p>Build gadgets to help you defeat Count Olaf and his horrendous henchmen.</p></li></ul>"},{"name":"Links 2004","year":2003,"developer":"Indie Built, Inc.","url":"microsoft_xbox_l/Links%202004%20%28Europe%2C%20Australia%29.zip","filesize":6269629370,"score":7.6,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>Microsoft brings the long-running PC golf series to the Xbox with 3D graphics, a wide range of gametypes (stroke, match, skins, Stableford scoring, best ball, etc...), and several multiplayer and online play options. Use the simulated career mode and various skill challenges to customize your own golfer, or use one of several pre-built or professional golfers. Features seven real courses; Aviara, Greywolf, Mauna Lani, Superstition Mountain, New South Wales (locked), Oakmont (locked), Loch Lomond (locked), St. Andrews Old Course (locked), and one fictional course; Ocean Mill (locked). Xbox Live offers online play and content downloads, including Kapalua Resort's Plantation Course and a revised Ocean Mills \"Director's Cut\" course.</p>"},{"name":"LMA Manager 2003","year":2002,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_l/LMA%20Manager%202003%20%28Europe%29.zip","filesize":6279234338,"score":7.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p><em>LMA Manager 2003</em> is the 2002/03 season update of the best-selling football management game on console, and the first to be released on Xbox. You can manage any team from the 16 main leagues in England, Scotland, France, Germany, Italy or Spain. The 3D match engine allows you to watch the action unfold, and the interactive highlights let you analyse in detail after the game. Contains over 17,000 players at 720 clubs from 28 different countries.</p>"},{"name":"LMA Manager 2004","year":2004,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_l/LMA%20Manager%202004%20%28Europe%29.zip","filesize":6114297821,"score":7.5,"genres":"Sports > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>The brand new game in the LMA Manager series. The game has over 18,500 players, 778 clubs, and 31 countries. Watch the matches in the 3D match section, and you can make your very own football club with the Fantasy Team mode. On the Xbox version of the game you can tell the team what to do with the Xbox Communicator. You may play as an English, French, German, Spanish, and an Italian team, and the game has all stats from the 2003/2004 season.</p><p>The game has two levels of difficulty and the AI staff can help with finance and training, just finance, or the player can handle everything themselves. The number of clubs is considerable, in the PS2 game they come from the following countries and leagues:* England - Premiership, Division 1, Division 2 and Division 3</p><ul><li>Scotland - Premiership, Division 1, Division 2 and Division 3</li><li>Italy - Serie a and Serie b</li><li>Spain - Primera División and Segunda División</li><li>Germany - Liga 1 and Liga 2</li><li>France - Division 1 and Division 2</li></ul>"},{"name":"LMA Manager 2005","year":2004,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_l/LMA%20Manager%202005%20%28Europe%29.zip","filesize":6014688499,"score":7.1,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>The 2005 edition of the LMA Manager franchise allows players to manage a soccer club from any of the top European leagues, including Holland and Portugal for the first time - or even create a team from scratch in Fantasy mode. You can also interact with the action in new ways - on PS2 you can take an Eyetoy photo to put yourself in the game, on Xbox you can shout instructions to your players via the communicator headset. Uniquely for an Xbox or PS2 soccer game, players can download updated rosters and stats during the season via the internet.</p>"},{"name":"LMA Manager 2006","year":2005,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_l/LMA%20Manager%202006%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5263121387,"score":6.3,"genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p>LMA Manager 2006 adds further detail to the soccer management series, with more players, more clubs and more playable leagues than ever before. A more complex transfer market, additional player stats and 3D training matches allow for more sophisticated management than in previous years. You can also now create your own manager model and see yourself marching along the touchline during a match, being interviewed at press conferences, and picking up awards at the end of the season.</p><p>The game starts with the pre-season stats for August 2005 but there was a process whereby the player could update their game by downloading a mid season database which was saved onto their memory card. The game can be played with real clubs or a fantasy team, it has two levels of difficulty and the AI staff can help with finance &amp; training, just finance, or the player can handle everything themselves.  </p><p>The number of clubs is very extensive and covers the following countries and leagues:* England - Premiership, Championship, League one, League two and Conference</p><ul><li>Scotland - Premiership, Division 1, Division 2 and Division 3</li><li>Italy - Serie a and Serie b</li><li>Spain - Liga 1 and Liga 2</li><li>Germany - Liga 1, Liga 2, Regional Nord and Regional Sud,</li><li>France - Division 1, Division 2, National</li><li>Holland - Eredivisie and Eerstedivisie</li><li>Portugal - Supa liga and Liga de Honra</li></ul>"},{"name":"Loons: The Fight for Fame","year":2002,"developer":"Warthog Plc","url":"microsoft_xbox_l/Loons%20-%20The%20Fight%20for%20Fame%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6528741799,"score":6.2,"genres":"Action > Diagonal-down > Arcade > Fighting > Licensed","desc":"<p>Starring Bugs Bunny, Daffy Duck, Sylvester the Cat and the Tazmanian Devil as the main characters, <em>Loons</em> is a four player fighting game. Based on movie sets and featuring an arsenal of ACME weapons, the game has all four players battle for the lead role in an upcoming movie. Similar in playing style to Power Stone, the game supports four player simultaneous action.</p>"},{"name":"Lord of the Rings, The: The Fellowship of the Ring","year":2002,"developer":"Surreal Software, Inc.","url":"microsoft_xbox_l/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Fellowship%20of%20the%20Ring%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6231566097,"score":6.3,"genres":"Role-playing (RPG) > 3rd-person (Other) > Diagonal-down > Isometric > Action RPG > Puzzle elements > Fantasy > Licensed","desc":"<p>Based on the legendary novels by the late JRR Tolkien, you take control of the Fellowship as they follow a path of evil to the steps of Mount Doom, in order to cast the One ring of Sauron back into the depths of the volcano, in turn destroying the evil that lies within it. This first in a trilogy follows Frodo and the fellowship as they begin their journey to Mount Doom, only to find that what lies ahead may be too much to handle.</p><p>The Xbox version, a 3rd person adventure, has you scaling the lands of middle earth in real time combat with a host of evil creatures to find your way past. Along the way, you will come across familiar characters that will aid or hinder your progress.</p><p>Unlike the movie trilogy, this adaption of the tale includes characters not seen on the big screen, including Tom Bombadil and others, as well as including many of the songs written by Tolkien as puzzles.</p>"},{"name":"Lord of the Rings, The: The Return of the King","year":2003,"developer":"Electronic Arts Redwood Shores Studio","url":"microsoft_xbox_l/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Return%20of%20the%20King%20%28Europe%29%20%28En%2CNl%2CSv%29.zip","filesize":6562223878,"score":7.8,"genres":"Action > Behind view > Hack and slash > RPG elements > Fantasy > Licensed","desc":"<p>The Lord of the Rings: Return of the King video game again puts the fate of middle-earth in the hands of the gamer.  In the last installment of the movie trilogy, destroy the Ring by casting it into the Crack of Doom, which frees Middle Earth from Dark Lord Sauron.</p><p>Return of the King's third person gameplay allows immersive action set in rich, interactive levels.  The new game also features an all new co-op multiplayer mode which lets players form their own Fellowship and eight playable characters like Gandalf, Aragorn, Legolas, Gimil, Sam and Frodo all played out by thier actual actors from the films, battle vicious boss monsters like Shelob and the final showdown with Dark Lord Sauron, all backed up by Academy Award winner Howard Shore.</p>"},{"name":"Lord of the Rings, The: The Third Age","year":2004,"developer":"Electronic Arts Redwood Shores Studio","url":"microsoft_xbox_l/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Third%20Age%20%28Europe%29%20%28En%2CSv%29.zip","filesize":6465975820,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Behind view > Turn-based > Japanese-style RPG (JRPG) > Fantasy > Licensed","desc":"<p>Unlike the  Game Boy Advance version of the game, the console version of The Lord of the Rings:The Third Age introduces entirely new characters which aren't mentioned in the books or movies. The game does relate to the movies by including scenes from all three movies, with new background speech by Ian McKellen (Gandalf).</p><p>There are seven playable characters in the game which have been created specifically for it, as well as small appearances by characters such as Gandalf, Aragorn, Eowyn, Faramir, and Gothmog.</p><p>The game covers events in all three movies/books, mostly with references to major events shown through cut scenes, or the scenes from the movies with Ian McKellen's narration.</p><p>A classic RPG game, The Lord of the Rings: The Third Age has gameplay elements similar to Final Fantasy, where you have a party of characters, each with a different set of skills and attributes, who gain levels, making them stronger as the game progresses. Battles are turn-based, and let the gamer make different decisions on what they want to do to change the outcome of the battle. The game travels through many areas throughout Tolkien's Middle Earth, including The Pelennor Fields and Moria.</p>"},{"name":"Lord of the Rings, The: The Two Towers","year":2002,"developer":"Stormfront Studios","url":"microsoft_xbox_l/Lord%20of%20the%20Rings%2C%20The%20-%20The%20Two%20Towers%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6492202237,"score":7.6,"genres":"Action > 3rd-person (Other) > Cinematic camera > Hack and slash > Fantasy > Licensed","desc":"<p>Electronic Arts' first game based on the Lord of the Rings movies is an action game with classic beat'em up-style gameplay. Despite the title, it covers events from both the first and the second film in the trilogy.</p><p>Players, choosing to control Aragorn, Legolas or Gimli, must battle the evil forces of the Dark Lord Sauron in order to protect the Ring of Power and restore peace to Middle-earth. </p><p>The player character moves through the levels, fighting hordes of Orcs, Goblins and other creatures with various attack and parrying moves. The more varied the attacks are and the less the player is hit, the more points are awarded for each kill. At the end of each level, kill points are accumulated and can be used to gain new abilities. Most of these are new attack moves, unleashed through various button combinations. Others increase health or upgrade the strength or speed of existing attacks. Each of the three characters has unique upgrades and moves.</p><p>Several levels feature boss battles with the likes of the Watcher of Moria or Lurtz, leader of the Uruk-hai. Each boss requires a unique strategy to defeat.</p><p>Most combat scenes from the movies have been turned into levels for the game: from the confrontation with the Ringwraiths at the Weathertop and the battle in the Mines of Moria from the first film to fights with Warg-riders and other enemies on the plains of Rohan from the second film. The game culminates in the defense of Helm's Deep, even though the depiction of the battle in the game differs considerably from that in the film.</p><p>Between the levels, cutscenes tell the story. These scenes combine actual film footage with footage rendered with the game engine.</p><p>The game offers lots of bonus content, some of which must be unlocked by completing missions or reaching certain levels with the characters. Featured are interviews with the filmmakers and actors (who also provide voices for the game) as well as various making-of features.</p>"}]