[{"name":"Mace Griffin: Bounty Hunter","year":2003,"developer":"Warthog Games Ltd.","url":"microsoft_xbox_m_part1/Mace%20Griffin%20-%20Bounty%20Hunter%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":4933802911,"score":6.3,"genres":"Action > 1st-person > Shooter > Space flight > Sci-fi / futuristic","desc":"<p>You play as Mace Griffin a former space ranger who after being framed and sent to prison has turned to a life of bounty hunting in an attempt to find out what really happened.</p><p>The game plays as a standard FPS with a twist. Every now and then you get to pilot different space ships in hectic dog fights. The transitions between the two parts of the game is almost unnoticeable and while you are in space you can even park your ship and have a walk around inside before you get on with your mission.</p>"},{"name":"Mad Dash Racing","year":2001,"developer":"Crystal Dynamics, Inc.","url":"microsoft_xbox_m_part1/Mad%20Dash%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6537257732,"score":7.2,"genres":"Racing / Driving > Behind view > Direct control > Track racing > Fantasy","desc":"<p>An arcade racer featuring cartoon-style 3D cel-shaded characters racing on foot through eight large courses. The courses are closer to levels from an adventure/platform game like Jak and Daxter: The Precursor Legacy than regular racecourses. Multiplayer is supported for up to four players.</p>"},{"name":"Madden NFL 06","year":2005,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%2006%20%28Europe%29.zip","filesize":6467318222,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The football masters are back once again and ready to blow you away with some of the best features ever.</p><p>All new major passing offense and passing upgrades like the all new QB vision.</p><p>Brand new single-player mode lets you experience the life of an NFL player by earning one of more than 60 Personas ranging from MVP to Movie Star.</p><p>New robust (online) features: share files via your EA Locker and instantly find a solid match-up with improved matchmaking. Also check your EA SPORTS Fantasy Football stats in game.</p>"},{"name":"Madden NFL 07","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part1/Madden%20NFL%2007%20%28Europe%29.zip","filesize":6479872068,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 07</em> is the seventeenth installment of the Madden NFL series. This version introduces some new tricks, updates some features, and brings depth to some game modes from previous Madden titles.</p><p>The 07 game focuses on the Running Back by giving you lead blocker controls. After selecting a running play, you can cycle through offensive players to open up gaps. New evasive maneuvers are controlled with a separate stick to elude defenders, along with new juking and spinning maneuvers.</p><p>Start a career with your favorite NFL team, draft the players, call the plays, and lead your team to a dynasty. Or, make your own player and guide him on and off the field through his entire career starting with the draft. If you do not want to mess with all the options and features you can simply sit down for a quick game.</p>"},{"name":"Madden NFL 08","year":2007,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%2008%20%28USA%29.zip","filesize":6466646942,"score":7.7,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>EA Sports' 2008 edition in the Madden series has some new features along with an updated roster and some new animations. The new read and react system lets you see your opponents weakness against your own players letting you exploit their weakness. The AI is more improved plus the new receiver control/lead block feature lets you play as a blocker to create a hole in the defence and switch back to your runner to bust through.</p><p>It also features new skill drills to help your player gain more stats in the ever popular NFL Superstar along with the new Ring of Champion feature that lets you design a ring when you complete a certain achievement such as winning the Super Bowl or winning the MVP. It has a new fantasy challenge mode that lets you draft any player you want and risk them in mini-games to create and elite superteam. Also, the superstar mode features a mode where you can play as your team, but also to choose to watch the CPU take control of your team and take over with your player when called upon.</p><p>Game commentary is provided by John Madden and Al Michaels.</p>"},{"name":"Madden NFL 09","year":2008,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%2009%20%28USA%29.zip","filesize":6479860871,"score":7.3,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p><em>Madden NFL 09</em> is another yearly update in the long-running football series. With the main focus of the series having changed to the next-gen versions, the version for PS2 and Xbox targets new and casual players by offering new simpler controlling options, while re-using and enhancing the modes seen in previous installments.</p><p>Returning modes include Play Now, Franchise, Superstar, Fantasy Challenge and Skill Drills. The new Family Play option allows quick exhibition games with simplified controls and choice of plays. A new control option for experienced players is the QB Avoidance Stick, allowing quarterbacks to avoid defenders through analog stick movements. The Super Sim feature allows players to fast-forward through the next play, change of possession, quarter or even to the end of the game. Franchise mode now features the Franchise Decades system, in which the player's progress throughout the seasons is indicated by a numerical score. The Fantasy Challenge mode adds three more teams to beat.</p>"},{"name":"Madden NFL 2002","year":2001,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%202002%20%28USA%29.zip","filesize":6744146398,"score":8.7,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>John Madden brings the best football back with updated stats and players, bigger than ever! All 32 NFL teams including the expansion Houston Texans.  Hard to believe but they make many improvements on the previous version.  There are new player faces and on-field animations and expanded motion capture.  EA Sports added a new game within the game called Two Minute Drill.</p><p>The controls are basically the same with Easy Play using simplified controls and Normal Play with the full features encompassing nearly everything one could do on the real gridiron.   You can create a player or a whole team.  Trade players and manage teams through out the season.</p>"},{"name":"Madden NFL 2003","year":2002,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%202003%20%28USA%29.zip","filesize":6649591202,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>In the game you control the ball by players of your favorite team to win the match. Opposite players also has tactic commands of their coach to take the ball from you. </p><p>The game for first time features on-line gaming capability and also adds new teams like Houston Texans, and new NFL division alignment.The game also has Create-a-Player option, where the players can determine in mini-games their physical conditions, for example, to be receivers or quarterbacks. Later you can include these players into teams. However, there is also availability to trade players instead of train them. Also the game has an option, which allows to play from playbook and then practice it. </p><p>The commentary is provided by Al Michaels. The game has rendered graphics with all animation based on it.</p><p>The game is up to 4 players.</p>"},{"name":"Madden NFL 2004","year":2003,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%202004%20%28USA%29%20%28Rev%201%29.zip","filesize":6542374090,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Football (American) > Licensed","desc":"<p>The long running Madden series returns for another series of NFL action on nearly every platform available in 2003.</p><p>New to the series this year are, of course, every new player included in the rosters for the new season, along with every other defensive and attacking player from every team in the league.</p><p>New gameplay modes include Owner Mode, an option that allows you to hire your own staff, set prices for tickets and hot dogs, build your own stadium, organise camps pre-season, and nearly everything else an owner needs to do to make his or her team special.</p><p>Play a full season and go all the way towards the Super Bowl final, or re-live special moments from past games and try to change history. You can use a full playbook based on the pros, with a host of tricks and formations.</p><p>Those new to the series (or NFL in general) can watch video tutorials presented by Al Michaels and Melissa Stark, to fill you in on every little detail of the sport and the game.</p>"},{"name":"Madden NFL 2005","year":2004,"developer":"EA Tiburon","url":"microsoft_xbox_m_part1/Madden%20NFL%202005%20%28USA%29.zip","filesize":6424355093,"score":8.6,"genres":"Sports > Diagonal-down > 2D scrolling > Real-time > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>The Madden series returns for another year with <em>Madden NFL 2005</em>. Besides the usual roster updates, the major gameplay changes in this iteration mostly concern defensive play. There are also expansions to the franchise mode and to online modes along various other additions and changes.</p><p>Major changes to defensive play include the introduction of the Hit Stick: it allows precise and context-sensitive tackling through the use of the second analog stick. There is now also defensive playmaker control (allowing on-the-fly position changes) and defensive hot routes. The offense was also expanded and now allows for formation shifts on the line.</p><p>The franchise mode now features the Storyline Central option, which features an \"EA Sports Radio\" show hosted by Tony Bruno, featuring news and reports around games and the league, interviews with players and call-ins from fans. There are also newspaper articles (featuring real licensed papers from around the US), emails from players and coaches and more. All of this is accessed through a redesigned interface resembling a PDA. Another new feature is morale for players, which changes throughout the season depending on their contracts, win-lose performance, being benched and more. The draft system has also been revised, and drafting new players can also affect the morale of existing players.</p><p>Another new feature is called Create-A-Fan: players can create fans with an editor, having them put on outlandish costumes and then watch them sit in the stadium during a game.</p><p>This year's edition is the first to feature online play for the Xbox via Xbox Live and introduces online league play for the first time on both PS2 and Xbox.</p>"},{"name":"Mafia","year":2004,"developer":"Illusion Softworks, a.s.","url":"microsoft_xbox_m_part1/Mafia%20%28Europe%29.zip","filesize":6531069861,"score":8.3,"genres":"Action > Racing / Driving > 1st-person > Behind view > Arcade > Shooter > Automobile > Vehicle simulator > Interwar > Crime > Regional differences","desc":"<p>Tommy Angelo was an ordinary taxi driver trying to make a living on the streets of Lost Heaven until one day an unexpected meeting changed his life forever. Two men jump into his cab, telling him to drive as fast as he can. Bullets begin to hit the cab, and a car with armed pursuers gets closer. Barely escaping a violent death, Tommy obeys the instructions of the two men and delivers them to a bar of their choice.</p><p>Impressed with his driving skills, the men pay him and offer him a job in the mafia. The next day, while Tommy is taking a coffee break, his cab is smashed by two rival gangsters. After this, he recalls the proposition from yesterday, and, without much hesitation, joins the Salieri family, making his first steps on the path of organized crime. While performing missions for Salieri, Tommy gradually begins to regret his choice. However, it turns out that joining the mafia was much easier than leaving it.</p><p><em>Mafia</em> is an action and driving game set in the 1930s in Lost Heaven, a fictional city in the USA modeled after New York and Chicago of the Prohibition Era. Similar to GTA games, it consists of free-roaming (driving or on foot) in a large city, completing missions to advance the narrative. The missions often include driving to various locations, car chases, and one race; however, most of them are structured like fairly large and long third-person shooter levels.</p><p>The player will have the chance to drive over sixty vehicles that are reminiscent of the 1930's period. Each car handles it differently, with various degrees of damage. It is possible to smash windows, destroy bumpers, lights, and mirrors, dent the car, shoot out the tires, or shoot the tires so much that they fall off. To add to the realism, if the car's gas tank gets punctured, gas will slowly leak out until the car totally empties. There are gas stations scattered throughout the city, allowing the player to refuel. With these vehicles, the player is able to explore twelve square miles of the city, visiting areas such as Central Island, Chinatown, and the Downtown district.</p><p>Complementing the vehicles is an array of weapons, such as pistols, tommy guns, shotguns, explosives, baseball bats, and crowbars. While driving a car, Tommy can perform a drive-by, sticking his hand out the window and firing. Trying to impede him is the police force; they will act on anything suspicious. If they see Tommy carrying a weapon, they will attempt to arrest him. Going over the speed limit, running red lights, crashing into buildings, cars, or objects will result in fines.</p><p>Tommy is often given new cars to use during the missions, usually provided by Ralph, the mechanic of the Salieri family. The player can also save hijacked cars in the backyard of the bar belonging to Salieri. Weapons can be acquired at the beginning of a mission by Vincenzo, the local arms dealer.</p>"},{"name":"Magatama","year":2003,"developer":"Microsoft Game Studios Japan","url":"microsoft_xbox_m_part1/Magatama%20%28Japan%29.zip","filesize":6088215511,"score":"","genres":"Action > 3rd-person (Other) > Fighting > Fantasy > Japan (Ancient/Classical/Medieval) > Martial arts","desc":"<p>In this game set in medieval Japan you take control of Shinato, a twin-bladed knight who's out to hack and slash his way through hordes of demons to prevent an all out war between the Yamato and the Shogun Bakafu forces.</p><p>Gameplay consists of pure action, where you use your twin blades to execute combos and special attacks to defeat your enemies. The combat system is set up so it allows you to engage multiple enemies simultaneously.</p>"},{"name":"Magi Death Fight","year":2002,"developer":"Takuyo Co., Ltd.","url":"microsoft_xbox_m_part1/Magi%20Death%20Fight%21%20%28Japan%29.zip","filesize":6827531646,"score":"","genres":"Action > 3rd-person (Other) > Top-down > Arcade","desc":"<p><em>Magi Death Fight</em> is a top-down action game. There are two game modes: a single-player/cooperative campaign and multiplayer deathmatch mode, supporting up to four players. The game takes place in an arena. Four different color balls of magic energy float around randomly in the arena, and can be picked up and fired at your foes. By holding down the fire button you can control how far the ball shoots. The balls do no damage until the end of their travel, at which point they explode, damaging whatever is beneath them.</p><p>You can pick up in total four balls of energy to orbit your character before you can pick up no more. If you collect all of one color, then this charges up your blast to be much more powerful than simply your regular fired ball. For example, a full four blue water magics will cause a stream of water to be released at the end of your shot, flowing down the screen from that point through all walls and obstacles and hitting everything underneath its path. If you collect one of each color, then this will cause you to release an 8-way explosion of regular shots careening randomly in every direction. There's also chests scattered randomly around the battlefield, and inside are various power-ups (as well as power-downs) that affect your character in various ways: speed boost, homing shots, guided shots, etc.</p>"},{"name":"Magic: The Gathering - Battlegrounds","year":2003,"developer":"Secret Level Inc.","url":"microsoft_xbox_m_part1/Magic%20-%20The%20Gathering%20-%20Battlegrounds%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6426483223,"score":6.7,"genres":"Action > Diagonal-down > Fighting > Trading / collectible card > Fantasy > Licensed","desc":"<p><em>Magic: The Gathering - Battlegrounds</em> is a real-time fighting/strategy game in which players use <em>Magic: The Gathering</em> cards to combat each other. Three possible types of spells can be played: creatures, sorceries and enchantments.</p>"},{"name":"Major League Baseball 2K5","year":2005,"developer":"Kush Games, Inc.","url":"microsoft_xbox_m_part1/Major%20League%20Baseball%202K5%20%28USA%29.zip","filesize":6349068779,"score":7.9,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>MLB 2K5 is the first in the series of 2K games, taking over from it's Sega predecessor, ESPN Major League Baseball. This one has been completely revamped with brand new control schemes and a new graphics engine. It features brand new animations and added a great deal of detail to the players, stadiums, weather and even cut scenes.</p><p>It also featured the obligatory updated roster as well as the standard modes such as exhibition, season and home run derby and also had online capabilities that could support up 30 players. ESPN was also involved, lending their name to the title and broadcast style with commentators Jon Miller, Joe Morgan and Karl Ravech.</p>"},{"name":"Major League Baseball 2K5: World Series Edition","year":2005,"developer":"Kush Games, Inc.","url":"microsoft_xbox_m_part1/Major%20League%20Baseball%202K5%20-%20World%20Series%20Edition%20%28USA%29.zip","filesize":6422869773,"score":"","genres":"Special edition > Sports > Behind view > Diagonal-down > Direct control > Baseball > Extra content / game > Physical extras","desc":"<p><em>Major League Baseball 2K5: World Series 05 Edition</em> is an updated version of Major League Baseball 2K5 that was released to coincide with the 2005 World Series. The game contains updated rosters as well as two new game modes: Pennant Fever and World Series Moments. The Pennant Fever is like the regular Franchise mode but starts about 120 games into the season and uses real-life team records. The World Series Moments mode contains ten historic World Series matches. Additionally, the game is bundled with a DVD that highlights the world series moments that can be played in the game.</p>"},{"name":"Major League Baseball 2K6","year":2006,"developer":"Kush Games, Inc.","url":"microsoft_xbox_m_part1/Major%20League%20Baseball%202K6%20%28USA%29.zip","filesize":6312422339,"score":6.6,"genres":"Sports > 1st-person > 3rd-person (Other) > Baseball > Licensed","desc":"<p><em>Major League Baseball 2K6</em> is an update of it's previous years version, featuring the obligatory roster updates as well as a three year report of all the teams and players in the game. It also featured a brand new movement system as well as realistic player crashes and a morale system, where the better the player is, the more their teammates will perform better as well.</p><p>It has the standard modes, exhibition, season as well as a new feature letting players take on the role of an international team in the World Baseball Classic as one of sixteen international baseball teams in a tournament style play. Players can also challenge umpires if they feel a call has been botched, this can also effect the teams morale, for better or worse depending on the outcome.</p><p>It also featured TV broadcast \"flashback replays\", giving it a real feel of a TV presentation as well as being commented on by Jon Miller and the legendary Joe Morgan. The Xbox 360 version was virtually the same as the previous generations, said for graphics and some extra dialogue and commentary. Also, Derek Jeter endorsed and graced the cover on all it's console and handheld releases as well.</p><p>There is also online capabilities for each console version with the ability to download a friends profile using the V.I.P. (Virtually Identity Profile), with the ability to look at their stats and results of their own games, letting them gain an upper hand against their friends in online matches.</p>"},{"name":"Major League Baseball 2K7","year":2007,"developer":"Kush Games, Inc.","url":"microsoft_xbox_m_part1/Major%20League%20Baseball%202K7%20%28USA%29.zip","filesize":6315505652,"score":7.4,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>This instalment in the 2K sports is based on the design of the past games with a bunch of new features and enhancements. The 2K7 edition has an all-new fielding and baseruninng A.I. system that simplifies the control allowing you to take control of each baserunner individually. New to this year too, is the pennant fever mode, in which you can take your favorite franchise all the way to the World Series Championship during the most intense part of the MLB season.</p><p>'The Farm' has been added to the Franchise mode, where aspiring owners can now scout and evaluate minor league players by playing full games with AAA clubs. Besides that, both the graphics engine as the MLB roster has been updated.</p><p>Also present is Inside Edge from last year's instalment, where player abilities are boosted through strength. 150 animations were added to mimic real-life stars based on signature style. The fielding has been redesigned, there is a dynamic throwing system and online play for the 360 and PS3 version. In a mini-game, the player can have the manager argue with the umpire by tapping a button.</p>"},{"name":"Malice","year":2004,"developer":"Argonaut Games PLC","url":"microsoft_xbox_m_part1/Malice%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6497076628,"score":5.7,"genres":"Action > Behind view > Direct control > Fantasy","desc":"<p>In this action-adventure platformer you play the part of Malice. Malice  starts the game being resurrected by Death himself and it is explained that she is actually a demi-goddess who has stripped of her powers. Hell-bent on revenge, you must help Malice traverse many worlds armed with a variety of weapons; including the Mace of Clubs, the Clockwork Hammer and the Quantum Tuning Fork. Malice can also learn and use elemental magic to help her overcome many hazards. Can you help Malice beat the rising Crow Army to reach the evil Dog God and restore the shattered world once more?</p>"},{"name":"Manchester United Manager 2005","year":2004,"developer":"Hoodoo Studios","url":"microsoft_xbox_m_part1/Manchester%20United%20Manager%202005%20%28Europe%29.zip","filesize":5989661433,"score":"","genres":"Simulation > Sports > 3rd-person (Other) > Managerial / business simulation > Football (European) / Soccer > Licensed","desc":"<p><em>Manchester United Manager 2005</em> is a special edition of LMA Manager 2005. It includes the full game, with additional Manchester United-specific content. This game is branded in the club's colours, and lets you take over from manager Ferguson starting from 2004. The club's stadium, Old Trafford, has been recreated, with an additional expansion programme. It has the official club badge and full kits, and the crowd sounds and chants have been recorded during actual matches of Manchester United. It also includes player profiles, coaching tips, videos of last years' best goals, profiles of all of United's post-war managers, and a photo summary of the 2003/2004 season.</p>"},{"name":"Manhunt","year":2004,"developer":"Rockstar North Ltd.","url":"microsoft_xbox_m_part1/Manhunt%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6438802607,"score":7,"genres":"Action > Behind view > Stealth > Direct control > Voice control > Post-apocalyptic > Horror","desc":"<p><em>Manhunt</em> casts you as James Earl Cash, a prisoner on death row. You are led down a corridor where you are about to receive a lethal injection. The needle goes in. You wake up hours later. A mysterious voice tells you to stick in the nearby earpiece, and explains that the \"lethal\" injection was just a heavy sedative. The man, later identified as Starkweather, turns out to be a director of snuff movies, where the people are really killed. He explains that if you follow his directions, manage to kill people and survive, you'll earn your freedom. This begins James Earl Cash's journey.</p><p>Throughout the course of the game, you'll have to make your way through different locales, such as a city and a mall, while killing gangs. You'll face lots of different gangs, from The Hoods and The Skins to tougher gangs like The Innocenz. Gang members carry weapons ranging from pistols and shotguns to knives and glass shards.</p><p><em>Manhunt</em> is primarily a stealth game. You'll have to hide behind walls, flatten yourself against walls, crouch, hide behind objects, and walk to avoid attracting attention. You can also throw glass bottles to create a distraction, or you can punch surfaces and yell to get gangs to come to you.</p><p>You have a variety of weapons at your disposal, from the traditional, such as the shotgun and uzi, to the disgusting, such as a sickle and plastic bag. Each weapon has three different ways of attacking, depending on how long you hold the button. A quick attack will do the job, a medium attack will be bloody, but a high attack, requiring the longest amount of time, will earn you the most points, and will allow you to see your kill in a cinematic style, with blood splatting on the camera, and gurgling noises.</p><p><em>Manhunt</em> also lets you use a USB headset, such as the one that came included with SOCOM: U.S. Navy Seals. With the headset, you will hear Starkweather speak into your ears instead of through your speakers, and you will be able to shout into the microphone to attract gangs instead of pressing a button.</p>"},{"name":"Marble Blast","year":2005,"developer":"Monster Studios, LLC"},{"name":"Marc Ecko's Getting Up: Contents Under Pressure","year":2006,"developer":"The Collective, Inc.","url":"microsoft_xbox_m_part1/Marc%20Ecko%27s%20Getting%20Up%20-%20Contents%20Under%20Pressure%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6113413200,"score":6.9,"genres":"Action > Behind view > Cinematic camera > Free-roaming camera > Fighting > Contemporary > Licensed","desc":"<p><em>Contents Under Pressure</em> is an action adventure that combines stealth and combat, as you guide urban graffiti artist Trane to fame. In the oppressed city of New Radius, you need to establish your name as an artist by laying down tags, burners and full pieces, but rival crews and law enforcement (Civil Conduct Keepers) are always on your tail. You will also uncover a conspiracy that plagues the city.</p><p>The game is story-driven with linear level progression. Most missions have platform elements and require you to lay art, varying from tags and stickers to complex pieces with full color, lettering and characters, on often difficult to reach surfaces. As it is not a friendly environment, Trane can deliver a host of punch and kick combos, use grabs, humiliate other artists, and interact with the surroundings. Your art arsenal includes markers, brushes, cans and rollers. All available pieces are kept in your black book, and new styles are unlocked while playing.</p><p>The title refers to working your way up the scene, as well as the \"Get In, Get Up, and Get Out\" principle - you need to gain access to restricted areas, get up on tall objects where your work can be seen, and get out afterwards without being caught. Good spots can be tracked using Intuition, and appear as coloured clouds.</p><p>The game is conceived by clothing impresario Marc Ecko, founder of the suburban designer label <em>Ecko</em> and is intended to pay tribute to graffiti culture and its history. Artists such as Cope2, Futura and Seen contributed art to the game.</p>"},{"name":"Marvel Nemesis: Rise of the Imperfects","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part1/Marvel%20Nemesis%20-%20Rise%20of%20the%20Imperfects%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6011256600,"score":6.2,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic > Licensed","desc":"<p>When New York City is attacked by aliens, the greatest heroes (and villains) in the Marvel Universe confront them.  Marvel Nemesis has two playing modes, a single-player story mode, where players brawl their way through a Mark Millar scripted tale, and a single- or two-player versus mode pitting heroes and villains against each other in a sandbox arena.</p><p>Famous Marvel characters have been reimagined by artist Jae Lee and new characters have been created for this game series.  The PS2 and Xbox versions support online play and all versions have unlockable arenas, characters, and extras.</p>"},{"name":"Marvel Ultimate Alliance","year":2006,"developer":"Zoë Mode","url":"microsoft_xbox_m_part1/Marvel%20-%20Ultimate%20Alliance%20%28USA%2C%20Europe%29.zip","filesize":6406901940,"score":7.6,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Quick Time Events (QTEs) > Sci-fi / futuristic > Licensed","desc":"<p>Dr. Doom has united supervillains as the Masters of Evil. Now for the first time ever, over 20 Marvel superheroes including Spider-Man, Captain America, Wolverine, Ghost Rider, Blade and Silver Surfer have come together to stop Doom. Mix and match your choice of Marvel superheroes, in teams of four as you travel across the Marvel Universe to stop this threat. Certain teams such as The Fantastic Four and The New Avengers provide additional bonuses.</p><p>Some heroes must be unlocked first. The game also features RPG elements, such as leveling up. When a hero gains a level, they earn points you can use to upgrade their skills. You also collect Shield Coins, which can be spent on boosts for your hero team. </p><p>You explore various legendary Marvel locales, from Asgard, to Prince Namor's Atlantis, where you take on foes with punches, kicks and super powers. Super powers drain energy, however, so use them wisely. Combos can be achieved by combining super powers. Energy is restored by collecting blue orbs from fallen foes. </p><p>Boss battles are like the comics themselves: titanic battles that often not only test brawn but your brain as well. With over 20 playable heroes plus all the cameos, there are over 100 heroes and villains.</p><p>The game modes feature either single player, co-op, or online play. In general, Marvel Ultimate Alliance's gameplay can be considered an improved version of 2004's X-Men: Legends. The different versions are fairly identical. The PSP release has three more game modes, while Wii, PS3 and Xbox 360 have additional levels.</p>"},{"name":"Marvel vs. Capcom 2","year":2002,"developer":"Capcom Production Studio 1","url":"microsoft_xbox_m_part1/Marvel%20vs.%20Capcom%202%20-%20New%20Age%20of%20Heroes%20%28Europe%29.zip","filesize":6820389110,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Licensed","desc":"<p><em>Marvel vs. Capcom 2</em> is the sequel to the 2D fighting game Marvel vs. Capcom: Clash of Super Heroes. </p><p>The game allows you to tag in all three players (instead of two, while the third is only used for special attacks, in the predecessor).</p><p>There are now up to 56 characters to use (most you have to unlock), including new characters like Jill Valentine from Resident Evil and Tron Bonn from Mega Man Legends.</p><p>Another new gameplay feature allows your teammates to come in during battle and give you a little health boost. This helps in lasting the distance in Survival mode, but they can also be hit by oncoming attacks from the enemy.</p>"},{"name":"Mashed: Drive to Survive","year":2004,"developer":"Supersonic Software Ltd.","url":"microsoft_xbox_m_part1/Mashed%20-%20Drive%20to%20Survive%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6740922918,"score":6.8,"genres":"Action > Racing / Driving > Top-down > Arcade","desc":"<p>Mashed is an action-packed top-down arcade-racer. On 13 tracks (which must be played free in single-player first) you need all your driving skills to survive and make it to the finish as the 1st with one of the four different cars available (from slow ones to really fast ones).</p><p>The heart of the single-player mode (besides the quick battle against the AI) are the bronze, silver and gold challenges for every track you need to complete to play free the next track. Each challenge is one of the seven (eight in multiplayer) game modes available in Mashed. From normal race-events (just be the 1st) over battles where you need to kill all your enemies before they do to the ultimate survival mode where everyone doesn't really like you.</p><p>To make things much easier there are nine different power-ups and weapons scattered on the tracks which you can pick up. From simple oil slicks over mines to deadly mortars there's everything you need to kick the enemy drivers out of the race. Of course they can also choose from the equipment. As you can only survive a few hits you need to make sure they can't use them on you. And to make it even worse there are many small passages (or the track is just one small passage...) with nothing on one or both sides of the track in which you or your enemy can fall very deep.</p><p>But the real heart of Mashed is the split-screen multiplayer mode which you can play with up to four players on one PC. If you don't find four friends you can fill in the missing spots with bots or just leave them open. The additional eighth, multiplayer exclusive game mode is like CTF with cars. The goal is to hold the flag and drive as far away from the enemies as possible to get a point. To keep the race interesting for the players that are already out of it, they can use a helicopter which flies over the track to launch missile attacks on the cars still racing. So you can take your revenge before the race is even over and the racers have one more thing to worry about. But this feature can be deactivated when you setup the race.</p>"},{"name":"Mat Hoffman's Pro BMX 2","year":2002,"developer":"Rainbow Studios, Inc.","url":"microsoft_xbox_m_part1/Mat%20Hoffman%27s%20Pro%20BMX%202%20%28Europe%29.zip","filesize":6837866338,"score":7.4,"genres":"Action > Sports > 3rd-person (Other) > Tricks / stunts > Bike / bicycling > Licensed","desc":"<p>Mat \"The Condor\" Hoffman and nine other world-class Pro BMX riders feature in this entry to the BMX racing series. Many gameplay features remain as before.</p><p>With the use of DVD technology, actual video footage of Mat and the crew was taken from their recent road trip and put into the game to give you a feeling of actually being there with them. Flatland tricks are another new addition. Also, there is the ability to tweak almost any stunt.</p><p><strong>Single Player Modes:</strong><strong>Session</strong> - Take some extra time to practice your tricks and routines in 2, 5, or 10 minute sessions on any of the levels that are unlocked. Scores can be saved to be put into the Hall of Fame.</p><p><strong>Free Ride</strong> - Like Session, you can use this mode to practice your skills but with unlimited time. Since any score you get for a trick is replaced by the points of the next trick, no scores can be saved.</p><p><strong>Road Trip</strong> - This is where you take the trip with the guys to go around and compete around the country. Within each level, there are goals to reach to improve your skills, unlock new levels, unlock bikes, and secrets in the game.</p><p><strong>Multiplayer Modes:</strong><strong>Trick Attack</strong> - Compete against each other in a split screen competition to get the highest score you can in a certain amount of time.</p><p><strong>Free Ride</strong> - Ride around showing off your stuff to your opponent.</p><p><strong>Graffiti War</strong> - Ride around and find the Spray Cans in the level. Once you find them, perform a trick on the terrain. Once a stunt is completed, your opponent's screen will be \"painted\". The opponent can perform a higher scoring trick to clear the paint.</p><p><strong>Tag</strong> - The person that is \"it\" is the only one that can score points. Be the first to find the red ring to be it. While you're it, score as many points as you can. The person not it must track the other down and knock into them to be it. If the person that is it bails then the other person will become it.</p><p><strong>H.O.R.S.E.</strong> - Just like the old game of HORSE for basketball. In this case you need to perform a higher scoring run to beat them for the letter. The one with the lower score with be given a letter. The first person to spell HORSE is the loser.</p><p><strong>Treasure Hunt</strong> - Race against each other to find the Golden Condor. Getting the Condor is the only way to score points.</p><p><strong>Half Pipe Hell</strong> - Up to 8 players can play HotSeat style. You must take turns tricking your way up a mountain of terraced half pipes. The only way to score is to climb to the top by transferring pipe to pipe.</p><p><strong>Push</strong> - This is like Trick Attack, but as you score more and more points your opponent's screen will get smaller and smaller. The loser is the one that gets pushed all the way off the screen.</p><p>The Pros in the game include Mat Hoffman, Joe Kowalski, Rick Thorne, Mike Escamilla, Simon Tabron, Kevin Robinson, Cory Nastazio, Ruben Alcantara, Seth Kimbrough, and Nate Wessel.</p><p>The locations you get to go to are Oklahoma City, Chicago, Las Vegas, New Orleans, Boston, Los Angeles, Portland, and Hawaii.</p><p>To enhance the game, there is also a park editor so that you can make your own dream areas to ride in.</p><p>Exclusive to the XBox version, you get to be able to ride in London, UK and have an extra rider - Chad Kagy.</p>"},{"name":"Matrix, The: Path of Neo","year":2005,"developer":"Shiny Entertainment, Inc.","url":"microsoft_xbox_m_part1/Matrix%2C%20The%20-%20Path%20of%20Neo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5279704907,"score":6.6,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p><em>The Matrix: Path of Neo</em> is the second video game developed by Shiny Entertainment based on the Matrix trilogy. This time you get to play as Neo himself, starting from the day agents came to take him from his office, through the race against the clock with the machines digging towards Zion, to the final battle against Agent Smith.</p><p>Like in the movies you'll start out as the untrained Thomas Anderson, and with the training and events of the movie your skills grow, enabling you to do complicated combos and take down upgraded agents.</p><p>Although the game follows the events of the trilogy, there are some missions that come as an in-depth look of events only spoken briefly in the films.</p>"},{"name":"Max Payne","year":2001,"developer":"Remedy Entertainment Oy","url":"microsoft_xbox_m_part1/Max%20Payne%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":4888932271,"score":8.3,"genres":"Action > Behind view > Shooter > Contemporary > North America > Thriller > Regional differences","desc":"<p>Max Payne was a police officer of the New York City police. On one terrible day, his wife and newborn daughter were killed by three junkies, who broke into his apartment after having ingested a new designer drug known as Valkyr. After the tragedy, Max quit the police force and joined the Drug Enforcement Administration. Three years later, during a raid on a mafia compound that was reportedly trafficking Valkyr, his best friend and fellow DEA agent Alex is killed, and he becomes the prime suspect in his murder. Now Max is all alone in the cold, snowy night of New York. The mob is out to get him. The police are out to get him. The only way out is with guns blazing, because he has nothing to lose.</p><p><em>Max Payne</em> is a third person shooter stylistically influenced by film noir, \"hardboiled\" detective stories, and Hong-Kong action cinema. Max can perform rolls and leaps to try and dodge enemy fire. The weapons at his disposal range from baseball bats to Ingram sub-machine guns, grenades, Molotov cocktails, and others. A unique feature of the game is the usage of the so-called <em>Bullet Time</em> - a time-slowing ability that was popularized by the first  Matrix movie. Activating the Bullet Time slows down everything that happens around Max (including his own movements), allowing for slow, but precise performance of moves to take care of his enemies. A special meter indicates how much time the effect will last, and how long Max needs to wait until it can be activated again.</p><p>Cutscenes in the game are presented as comic book-style graphical panels accompanied by voice-overs.</p>"},{"name":"Max Payne 2: The Fall of Max Payne","year":2003,"developer":"Remedy Entertainment Oy","url":"microsoft_xbox_m_part1/Max%20Payne%202%20-%20The%20Fall%20of%20Max%20Payne%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5973190040,"score":8.1,"genres":"Action > Behind view > Shooter > Contemporary > North America > Detective / mystery","desc":"<p>Two years have passed since Max Payne first embarked on his desperate quest for revenge. Returning to his former position as a detective in the New York City Police Department, Max is assigned to investigate a series of murders carried out by group of contract killers known as the Cleaners. Unexpectedly, Max encounters the enigmatic Mona Sax, whom he assumed dead. People from his past begin to return one by one, and Max gradually realizes that he did not know everything about the mysterious Circle and those who were involved in the murder of his family. Somebody out there is trying to kill Max, and he must find the answers before they succeed.</p><p><em>Max Payne 2: The Fall of Max Payne</em> is a direct sequel to Max Payne. The game is very similar to its predecessor in gameplay concept and presentation, bringing back noir detective atmosphere, cinematic John Woo-style action, and cutscenes shaped like comic book panels.</p><p>The game is built on the same engine as the predecessor, with several additional special effects and enhancements, such as dynamic shadows and lighting, cubic mapped reflections, and high resolution textures. The Havok engine with ragdoll physics is used to enhance the interactivity with the game world: objects can be moved and destroyed, physically responding to the actions of the player character and opponents.</p><p>A new feature in the sequel is the possibility to use secondary weapons alongside regulars guns, namely melee strikes, grenades and Molotov cocktails. Certain characters will join Max and fight on his side from time to time. The player also controls Mona Sax during a few stages. The Bullet Time feature from the previous game has been upgraded to version 2.0, in which Max's speed in bullet time increases as he gets more kills consecutively.</p><p>During the first playthrough the game only offers one difficulty level. If the player struggles to succeed, the game will automatically lower the difficulty, reducing the effectiveness of enemy fire and increasing the amount of painkillers. Additional difficulty levels are unlocked when the player completes the game, as well as two new modes: New York Minute and Dead Man Walking. The first awards the player with a score for completing a level as quickly as possible, while the second has Max fighting endlessly respawning enemies.</p>"},{"name":"Maximum Chase","year":2002,"developer":"Genki Co., Ltd.","url":"microsoft_xbox_m_part1/Maximum%20Chase%20%28USA%29.zip","filesize":6407263869,"score":6.2,"genres":"Action > Racing / Driving > 1st-person > Behind view > Shooter > Spy / espionage","desc":"<p>In this forever pursuit of a game, you play as a cop who has just got off duty. In a movie sequence you have a girl that gets in your car fleeing from a mob of mysterious people shooting, while you just got off duty. Little to know is this may be the destruction of Los Angeles.</p><p>This game has a storyline where you must run from all kinds of obstacles, cars, and people, through the entire game. Choose from 5 different cars, and shoot arcade style from a car while a girl drives.</p>"},{"name":"MechAssault","year":2002,"developer":"Day:1:Studios, LLC","url":"microsoft_xbox_m_part1/MechAssault%20%28USA%29%20%28En%2CFr%2CDe%29%20%28Rev%201%29.zip","filesize":6754050771,"score":8.1,"genres":"Action > Behind view > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > Licensed","desc":"<p><em>MechAssault</em> is the XBox's first Mech game, and is also one of the first games to fully support XBox Live.</p><p>As the title suggests, you take control of a variety of BattleMechs, each of varying size and performance. The bigger Mechs lumber about but have increased armor and more weapon capacity, while the smaller Mechs move and jet fast, but can't dish out or take much damage.</p><p>Bringing new meaning to the words \"mass destruction\", practically anything in the game can be blown up. Buildings, cities, cars, and of course, enemies.</p><p><em>MechAssault</em> has a campaign mode that takes you through various levels, or you can play up to seven friends in System Link mode.</p><p><em>MA</em> also supports Xbox Live, and it supports it to its fullest extent. You can utilize your Friends list to see who's online, and it has full voice capabilities. You can also download items in the future, such as additional Mechs and weapons, all handled through the Xbox interface.</p>"},{"name":"MechAssault 2: Lone Wolf (Disc 1)","year":2004,"developer":"Day:1:Studios, LLC","url":"microsoft_xbox_m_part1/MechAssault%202%20-%20Lone%20Wolf%20%28World%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6695994612,"score":7.6,"genres":"Action > Simulation > 3rd-person (Other) > Quick Time Events (QTEs) > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > Licensed","desc":"<p><em>MechAssault 2: Lone Wolf</em> takes place roughly one year after the original MechAssault game. This is not a simple extension of the first game. There are a lot of new missions, vehicles (mechs, tanks, and whatever else the player can find), and worlds to explore. Jump in and let's go for a ride.</p><p>The game adds new gameplay elements to the system used in <em>MechAssault</em>. In the original game, the player was a Mech pilot and nothing else. Here, the player is the only pilot in the game world. This means that the player can now get out of a Mech and drive someone else's Mech. Want to drive a tank or some of the other vehicles? Well, now it is possible. Jump in many of the vehicles and take one for a ride. Of course, the Battlemech still rules the field.</p><p>Like the original game, Xbox Live is fully supported for multiplayer gaming.</p>"},{"name":"MechAssault 2: Lone Wolf (Disc 2)","year":2004,"developer":"Day:1:Studios, LLC","url":"microsoft_xbox_m_part1/MechAssault%202%20-%20Lone%20Wolf%20%28World%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29%20%28Bonus%20Disc%29.zip","filesize":6829323102,"score":7.6,"genres":"Action > Simulation > 3rd-person (Other) > Quick Time Events (QTEs) > Mecha / giant robot > Vehicular combat > Sci-fi / futuristic > Licensed","desc":"<p><em>MechAssault 2: Lone Wolf</em> takes place roughly one year after the original MechAssault game. This is not a simple extension of the first game. There are a lot of new missions, vehicles (mechs, tanks, and whatever else the player can find), and worlds to explore. Jump in and let's go for a ride.</p><p>The game adds new gameplay elements to the system used in <em>MechAssault</em>. In the original game, the player was a Mech pilot and nothing else. Here, the player is the only pilot in the game world. This means that the player can now get out of a Mech and drive someone else's Mech. Want to drive a tank or some of the other vehicles? Well, now it is possible. Jump in many of the vehicles and take one for a ride. Of course, the Battlemech still rules the field.</p><p>Like the original game, Xbox Live is fully supported for multiplayer gaming.</p>"},{"name":"Medal of Honor: European Assault","year":2005,"developer":"Electronic Arts Los Angeles","url":"microsoft_xbox_m_part1/Medal%20of%20Honor%20-%20European%20Assault%20%28Europe%29%20%28En%2CEs%2CNl%2CSv%29.zip","filesize":6487099373,"score":7.2,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > War > Regional differences","desc":"<p><em>Medal of Honor: European Assault</em> is the latest addition to the Medal of Honor franchise. The story is set in Europe, in 1942.You are playing US Army Lieutenant William Holt, the first field agent of the newly formed Office of Strategic Services (OSS). Your role is to infiltrate enemy lines, destroy key documents and get rid of famous Nazi operatives.</p><p>The player leads a 3 man squad and can instruct their partners to take cover, attack enemies or retreat. Levels feature secondary objectives which can be completed in addition to the main objectives.</p>"},{"name":"Medal of Honor: Frontline","year":2002,"developer":"Electronic Arts Los Angeles","url":"microsoft_xbox_m_part1/Medal%20of%20Honor%20-%20Frontline%20%28Europe%29.zip","filesize":6084220997,"score":7.3,"genres":"Action > 1st-person > Shooter > Direct control > Europe > Historical events > World War II > War > Regional differences","desc":"<p>In Medal of Honor: Frontline, you play as Lt. Jimmy Patterson, a member of a special forces team.</p><p>As a soldier during WW2, you must complete various missions and objectives.  You will take part in the D-Day invasion of Normandy, seize the Nijmegen Bridge, infiltrate a weapons facility, sabotage a German U-Boat and more.</p><p>You will have access to historically accurate weapons and equipment, such as pistols, rifles, and explosives.</p><p>Parts of the game will have you working alongside other soldiers, which adds to the overall experience.  Some missions require you to use stealth, where you must pose as a Nazi and show identification without giving yourself away.</p>"},{"name":"Medal of Honor: Rising Sun","year":2003,"developer":"Electronic Arts Los Angeles","url":"microsoft_xbox_m_part1/Medal%20of%20Honor%20-%20Rising%20Sun%20%28Europe%29%20%28En%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":5616942786,"score":6.6,"genres":"Action > 1st-person > Shooter > Direct control > Asia > Historical events > North America > Oceania > World War II > War","desc":"<p>First-person shooter set in the Pacific theatre of WWII, beginning with the attack on Pearl Harbor and moving through the campaign with you playing as a young recruit chosen for various historical missions such as the raid on Guadalcanal. The game also makes efforts to educate players in WWII history and conditions, with period stock footage and images, and unlockable interviews with Pacific veterans.</p>"},{"name":"Mega Man: Anniversary Collection","year":2005,"developer":"Capcom Co., Ltd.","url":"microsoft_xbox_m_part1/Mega%20Man%20Anniversary%20Collection%20%28USA%29.zip","filesize":6551108627,"score":7.8,"genres":"Action > Compilation > Side view > Anime / Manga > Arcade > Fighting > Platform > Sci-fi / futuristic","desc":"<p>Celebrate 15 years with Mega Man! This compilation edition of the Blue Bomber celebrates Mega Man 1-8, as well as two arcade games that were never before released in America (Mega Man: The Power Battle and Mega Man 2: The Power Fighters). Each game in the series follows Mega Man as he and his robot dog Rush (introduced in the third game) battle against Dr. Wily and his robot henchmen. Each game is presented in their entirety, with an optional \"Navi Mode\" to change the user interface to closer match Mega Man 8. As players complete the games, new unlockables will become available, revealing history and artwork of Mega Man's past adventures.</p>"},{"name":"Melbourne Cup Challenge","year":2006,"developer":"Sidhe Interactive"},{"name":"Men of Valor","year":2004,"developer":"2015, Inc.","url":"microsoft_xbox_m_part1/Men%20of%20Valor%20%28Europe%29.zip","filesize":6384661056,"score":7,"genres":"Action > 1st-person > Shooter > Direct control > Asia > Cold War > Historical events > War > Regional differences","desc":"<p>The creators of the original Medal of Honor take you back to explore the time of the Vietnam war. Playing as marine Dean Shepard, you travel through lush terrains and exotic landscapes to lead your AI controlled squad through jungles, tunnels and hooches while battling the North Vietnamese Army and the Viet Cong. To recreate a cinematic feel, the gameplay uses many scripted events and licensed sixties music.</p><p>If the single player campaign doesn’t send you home in a body bag, you can mow down some friends in the fierce multiplayer action. Play both sides using weapons of their era, from M60s to RPDs in multiplayer class-based game types such as Search and Destroy, Recover the Documents, Frontline and the traditional DeathMatch.</p>"},{"name":"Mercenaries: Playground of Destruction","year":2005,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_m_part1/Mercenaries%20%28USA%2C%20Europe%29.zip","filesize":6397437722,"score":8,"genres":"Action > Racing / Driving > Behind view > Shooter > Direct control","desc":"<p>During the last years of his reign, the North Korean president Choi Kim attempted a reconciliation with the country's southern neighbor, with the ultimate goal of reunification. However, his son, General Choi Song, and the military clique under his leadership, strongly disagreed with the old man's views. Eventually, Choi Song orchestrated his own father's assassination, took control of North Korea, and severed ties with the outside world. </p><p>Then the Australian Navy intercepted a North Korean freighter carrying nuclear weapons intended for sale to terrorist cells. In response, China, South Korea, the Allied Nations send troops into the troubled region to topple Song's regime. The Russian Mafia also bases itself in North Korea to take advantage of the situation. A bounty of a hundred million dollars for General Song was declared. This is where the mercenaries enter the playfield.</p><p><em>Mercenaries: Playground of Destruction</em> is a free-roaming war action and driving game with open-ended gameplay in a large world. The player can choose to control any of the three mercenary protagonists, each with their own strengths: North American Chris Jacobs can sustain higher damage; Jennifer Mui from Hong-Kong is proficient in stealth; Mattias Nilsson from Sweden can run faster than the others. Each of the mercenaries also speaks different languages, which makes him or her more or less suitable for work with particular factions.</p><p>Players have free reign of a massive landscape to take bounties on the \"Deck of 52\", a list of most wanted people in General Song's regime. Four factions have moved in to take advantage of the coup for personal gains; each faction will offer the player resources such as vehicles and supplies, as well as missions that the player can use to make money. If the player completes missions for a faction, they will offer intel on the locations of various bounties from the deck, although it is possible to track down the bounties without them. </p><p>Players have a vast array of resources available to them to get the job done. It is possible to commandeer tanks, choppers and and any other military hardware to blow up the game's destructible landscape across the North Korean countryside. Helping out various factions provides access to numerous vehicle drops, supply drops, and air strikes.</p>"},{"name":"Metal Arms: Glitch in the System","year":2003,"developer":"Swingin' Ape Studios","url":"microsoft_xbox_m_part2/Metal%20Arms%20-%20Glitch%20in%20the%20System%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6508123812,"score":7.9,"genres":"Action > Behind view > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>Metal Arms: Glitch In the System is an original (non-licensed) title from Swingin' Ape Studios and Sierra.</p><p>You will play Glitch, a rebellious robot who is determined to destroy the evil army of Mil robots. Metal Arms features plenty of third-person robotic destruction. Glitch sports a large arsenal of weapons with which to complete his task. Original features include the ability to possess enemy Mils and use them for your own purposes. </p><p>For variety Metal Arms includes a few vehicle levels, including drivable tanks and 'RAT' vehicles. Metal Arms features some platforming, but is more of a shooter. Helping to keep the player's interest is the colorful character design - all characters have an attitude.</p><p>On the multiplayer side,  Metal Arms features four-player split-screen gameplay with various modes including Possession Melee (your opponent's kills count for you!), standard Bot Brawl, King of the Hill, Moving Hill, Tag and Reverse Tag modes.</p>"},{"name":"Metal Dungeon","year":2002,"developer":"Interlex Inc.","url":"microsoft_xbox_m_part2/Metal%20Dungeon%20%28Europe%29.zip","filesize":6676400332,"score":5.6,"genres":"Role-playing (RPG) > Diagonal-down > Turn-based > Sci-fi / futuristic","desc":"<p>In the battle for world domination, the leaders of Giamel have begun producing Weapon Monsters, horrible biomechanical killing machines. The only ones with the power to produce such beings are the Gods of Magic, a group of sorcerers who have been captured and put into a trance so that their powers can be harvested for this end. However, the have started to awaken and now they are using these Weapon Monsters to wreak vengeance on those who kidnapped them. Their ultimate goal is the total destruction of the earth. You and your band of mercenaries are the only ones who can stop them.</p><p>Create a team by naming characters, assigning one of five classes, and changing their facial and body type as well the color of their equipment. You can create as many team-members as you wish, but only take five into battle. Journey into the ever-changing levels of the research facility, gaining weapons, armor, levels, and spells along the way to do battle against the Weapon Monsters, the Gods of Magic, and their minions and retake the facility.</p><p>Battles are fought in real-time turn-based combat similar to the <em>Final Fantasy</em> ATB style, but with a twist. Party members will perform assigned actions without any input until their actions are changed by the player. Several special classes can be unlocked by using special items and each class has weapons and spells unique to it. Also, if a party member falls in battle it is possible to add a new one by finding a fresh body in special preservation rooms scattered throughout the facility.</p><p>Each level of the facility is randomly generated and changes when you leave. This security measure cannot be overridden. Find items, weapons and armor in chests littered about the compound, but be warned that some chests have traps which must be disarmed first (if you don't want to suffer the consequences). There is a Weapon Monster lurking somewhere on each level which must be defeated in order to move on to the next level. Eventually you must battle the Gods of Magic and seal the Demon Lord up.</p>"},{"name":"Metal Gear Solid 2: Substance","year":2002,"developer":"Konami Computer Entertainment Japan, Inc.","url":"microsoft_xbox_m_part2/Metal%20Gear%20Solid%202%20-%20Substance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":4388728947,"score":7.7,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Stealth > Spy / espionage","desc":"<p><em>Metal Gear Solid 2: Substance</em> is a re-vamped and revised edition of the original Metal Gear Solid 2: Sons of Liberty, in which Solid Snake must recover the stolen Metal Gear Ray from a group of terrorists bent on using its power for unthinkable reasons.</p><p>Along with the original espionage shooter comes a collection of 200 virtual reality (VR) missions. Missions range from killing certain targets and using particular weapons, as well as seeing the world of Solid Snake from different perspectives and styles, with first-person target modes and a variety mode including crazy characters of different shapes and sizes. </p><p>Also included are various alternative missions, ranging from the protagonist sneaking around and snapping photos of targets to bomb disposal, all out destruction, and more.</p>"},{"name":"Metal Slug 3","year":2004,"developer":"SNK Playmore Corporation","url":"microsoft_xbox_m_part2/Metal%20Slug%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6865121748,"score":8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Platform > Shooter","desc":"<p>In the third installment of the <em>Metal Slug</em> series, General Morden is back and he plans to establish a new world order. The player guides one of the heroes: Marco, Tarma, Eri, or Fio, as they blast their way through side-scrolling levels with a unique theme, filled with countless enemies and bosses. The player has to free hostages and can ride bizarre vehicles such as camels, elephants, tanks, and robots.</p><p>In the Xbox version, additional game modes, such as Storming the Mothership and Chubby Isle Paradiso, can be unlocked upon completing the five arcade stages. A co-op mode has been included, but no online multiplayer. The only Xbox Live feature available allows the player to compare single-player scores.</p>"},{"name":"Metal Slug 4","year":2005,"developer":"MEGA Enterprise Co., Ltd.","url":"microsoft_xbox_m_part2/Metal%20Slug%204%20%28USA%2C%20Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6854698234,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Shooter > Tank > Sci-fi / futuristic","desc":"<p>An organization called \"Amadeus\" wants to take over all the military computers in the world using a new virus they have created. It's your mission to destroy them before they accomplish their evil ambition.The 5th episode (including Metal Slug X) of the most famous arcade-shooting-series comes bringing the unaltered classic gameplay, a new arm (Dual Machine Gun), 6 new vehicles (Motorcycle, Truck, Bradley Tank, Metal Crow Tank, Four Legged Walkmachine and Forklift Truck) as well as 2 new soldiers for the pantheon (Nadia Cassel and Trevor Spacey).The most notable introduction to the series is the <strong>Metalish System,</strong> giving to the player a new possibility to score more points: after pick up certain shield-shape emblems, a timer bar will be displayed at the top of the screen. During this time, you must to shoot rapidly as many enemies as possible and, depending on your acting, you will receive a corresponding badge bonus that will be added to your score after completing it. But, if you die during the mission, the bonus will be lost.</p>"},{"name":"Metal Slug 5","year":2005,"developer":"SNK Playmore Corporation","url":"microsoft_xbox_m_part2/Metal%20Slug%205%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6875466982,"score":7.8,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Arcade > Platform > Shooter > Flight / aviation > Tank","desc":"<p>A paramilitary syndicate known as the \"Ptolemaic Army\" attacks a research installation that was developing the next-gen of Metal Slugs and with this, they have successfully stolen a disc containing Metal Slug top-secret data. Fearing that such information be used for their evil purposes, the soldiers Marco, Tarma, Eri and Fio received orders to recover the disk and put a end in this syndicate.The latest installment of the most famous arcade-shooting series brings a lot of changes: this time, you will not face Morden's army like in the previous games, but with a new group of enemies that composes the already mentioned Ptolemaic Army.To add more content to this title, 3 guns (Big Rocket, Big Laser and Big Shotgun) and 2 vehicles (Slug Sub and Slug Plane) from past games were reincorporated, as well as all brand new stuff of 3 vehicles (Spider Slug, Slug Gunner and Slug Car).The most important addition is a sliding move: pressing the B Button when ducking will make your character slide for a short time in the ground, which can be helpful to avoid some enemy attacks. During the sliding, you not be able to throw grenades, but your gun can be fired normally.</p>"},{"name":"Metal Wolf Chaos","year":2004,"developer":"FromSoftware, Inc.","url":"microsoft_xbox_m_part2/Metal%20Wolf%20Chaos%20%28Japan%29.zip","filesize":6435687318,"score":"","genres":"Action > 3rd-person (Other) > Behind view > Shooter > Direct control > Mecha / giant robot > North America > Sci-fi / futuristic","desc":"<p><em>Metal Wolf Chaos</em> is an mecha action game in which you jump in the role of Michael Wilson, the current president of the United States. The vice president, Richard Hawk wants to take over the country in coup d'état, the president must escape from the White House and bring order to chaos in his custom Metal Wolf mecha armor.</p><p><em>Metal Wolf Chaos</em> is a third person shooter with highly destructive environments and enemies ranging from land, sea to air units which you take into battle within such locations as the White House and secret army bases and eventually, in space.</p>"},{"name":"Miami Vice","year":2004,"developer":"Atomic Planet Entertainment Limited","url":"microsoft_xbox_m_part2/Miami%20Vice%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6720236115,"score":4.7,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Based on the 80's TV series of the same name, this is a 3rd person shooter. Playing as Sonny Crockett or Ricardo Tubbs, the player must dismantle drug-lord Ortega's organization, following the plot of an episode of the series.</p><p>Through 14 missions, the player must take down (or arrest, sometimes) drug dealers and solve some minor puzzles (like finding keys to open doors, or switching levers to get access to locked places). In some stages, the player can choose freely to play as Crockett or Tubbs, switching between them by the click of a button. They have different abilities (Tubbs, for instance, is tougher and can kick in doors, Crockett is more agile), and different weapons (Crockett has a pistol as primary weapon, Tubbs has a double barreled shotgun). The characters can also carry a secondary weapon, from among 14 types (9mm pistols, .45 pistols, silenced 9mm, Uzi-like sub-machineguns, etc.). Each character can use only certain types of weapon, Tubbs carrying usually the heavier ones. The primary weapons have unlimited ammo, the secondary ones don't.</p><p>In the stages where the player can choose either Crockett or Tubbs, basic commands can be given to the secondary character, such as asking for following the partner or covering him. The characters will heal themselves as the time passes, and they can heal each other: if one of them dies, the other can revive him.</p><p>The characters can interact with the environment: whenever an action is possible, an icon will appear, showing which action can be taken, such as opening (or breaking) doors, climbing ladders, etc. Jumping is part of those particular actions, as the characters can only jump at specific places where the proper icon shows up. As for other actions, characters can run, crouch, walk and lean against walls. To shoot enemies, the player must aim (with an auto aim button) and then shoot (with a shoot button).</p><p>The game features the original theme from the TV show, as well as original voices.</p>"},{"name":"Micro Machines","year":2002,"developer":"Infogrames Studios Limited","url":"microsoft_xbox_m_part2/Micro%20Machines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6674390263,"score":6.3,"genres":"Racing / Driving > Top-down > 2D scrolling > Direct control > Automobile > Track racing > Licensed","desc":"<p>In this 3D remake of the original miniature racing game, players can compete on 24 different race tracks with 48 vehicles including toy cars, motorcycles, boats and more, using one of 8 difference characters. As in the original, four vehicles are on track at a time.</p><p>Each track features unique terrain with ramps, tunnels, obstacles and hazards. Hidden weapons and power-ups let drivers use rockets, time warps, mines, giant frying pans and fireballs against each other to take the lead.</p><p>There are several different racing modes. In GP mode the player must reach each checkpoint within a set time limit, while Bomb Tag involves drivers being threatened with exploding unless they can hit another car in order to 'tag' the bomb onto it. In the main Championship there are four cups, each featuring four races.</p>"},{"name":"Midnight Club 3: DUB Edition","year":2005,"developer":"Rockstar Leeds Ltd.","url":"microsoft_xbox_m_part2/Midnight%20Club%203%20-%20DUB%20Edition%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5851009141,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Licensed","desc":"<p><em>Midnight Club 3: DUB Edition</em> continues the high-speed, open city racing tradition of its predecessors with the addition of the deepest car customization a game has ever had to the license plate(state,numbers) to the rim size. Unlike the international route of Midnight Club 2 (Los Angeles, Paris and Tokyo), racers will find themselves racing through three U.S. cities: San Diego, Atlanta and Detroit. Featuring over 60 licensed vehicles and are not limited to cars: SUVs, bikes, Classic muscle, Law Enforcement, and choppers are also in the mix.</p>"},{"name":"Midnight Club 3: DUB Edition Remix","year":2006,"developer":"Rockstar San Diego, Inc.","url":"microsoft_xbox_m_part2/Midnight%20Club%203%20-%20DUB%20Edition%20Remix%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5602636778,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Licensed","desc":"<p><em>Midnight Club 3: DUB Edition Remix</em> is an enhanced budget re-release of Midnight Club 3: DUB Edition. In addition to all the content from the original, it adds a new fully-featured city, Tokyo, adapted from Midnight Club II, 24 new vehicles, new music, new races and battle maps for about 30% more content.</p>"},{"name":"Midnight Club II","year":2003,"developer":"Rockstar San Diego, Inc.","url":"microsoft_xbox_m_part2/Midnight%20Club%20II%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6319234841,"score":7.8,"genres":"Action > Racing / Driving > 1st-person > Behind view > Automobile > Street racing","desc":"<p>On the streets at night, anything can happen. And if you have a car that can race the distance, there's money involved too.</p><p>This is the premise behind Midnight Club II, in which you must work your way up the ranks of illegal street racing by challenging and defeating the best over three cities.</p><p>Each race occurs in a different area of the city, and all you have to do to get started is flash your lights at the person you wish to drag. Then follow the map for the track route and go hell for leather. Further along, shortcuts will also come into play, giving you an advantage in getting to the finish first.</p><p>Each race you win racks up cash, which goes towards new and much faster cars for the more difficult challenges. You'll also get the chance to go two wheels with a selection of highly mobile bikes.</p><p>Multiplayer modes include the usual all-on-all race mode, and capture the flag, in which you must race to the opposing flag somewhere in the city and return it to your destination.</p>"},{"name":"Midtown Madness 3","year":2003,"developer":"Digital Illusions CE AB","url":"microsoft_xbox_m_part2/Midtown%20Madness%203%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6281267398,"score":7.6,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Bus > Street racing > Truck > Vehicle simulator > Contemporary > Europe > North America","desc":"<p><em>Midtown Madness 3</em> is the third game in Microsoft's city racing franchise. It features 40 Blitz and Checkpoint races, a career mode titled \"Work Undercover\" which spans 54 varied missions (from racing to driving a pizza car to taking control of an armored bank truck), and a complete online mode that allows you to challenge players over Xbox Live.</p><p>There are two cities to choose from, both modeled after their real counterpart; Paris and Washington D.C. Paris is the more open ended city, great for beginners, while Washington features lots of narrow streets, sharp and hairpin turns, and various other distractions.</p><p>There are over thirty licensed vehicles to choose from, from a Lotus Esprit Turbo to a real-life garbage truck. Each vehicle has it's own different characteristics, including speed, handling and acceleration.</p><p>Over Xbox Live, you can compete in a variety of games:</p><p>Capture The Gold -- Similar to Capture The Flag.  </p><p>Hunter -- Two players are cops, while the rest are normal vehicles. When a cop rams you, you become a cop. The last person left to be pulled over is the winner.  </p><p>Tag -- Same thing as the childhood game. One car is \"it\", while the others have to avoid him.</p><p><em>Midtown Madness 3</em> supports voice, and allows you to download various content.</p>"},{"name":"Midway Arcade Treasures","year":2003,"developer":"Digital Eclipse Software, Inc.","url":"microsoft_xbox_m_part2/Midway%20Arcade%20Treasures%20%28USA%2C%20Europe%29.zip","filesize":5910145270,"score":7.2,"genres":"Compilation","desc":"<p>This compilation of arcade games from the 1980's to the early 1990's includes:</p><ul><li>Spy Hunter</li><li>Defender</li><li>Defender II</li><li>Gauntlet</li><li>Joust</li><li>Joust 2</li><li>Paperboy</li><li>Rampage</li><li>Robotron 2084</li><li>Smash TV</li><li>Bubbles</li><li>RoadBlasters</li><li>Blaster</li><li>Rampart</li><li>Sinistar</li><li>Super Sprint</li><li>Marble Madness</li><li>720</li><li>Toobin'</li><li>KLAX</li><li>SPLAT!</li><li>Satan's Hollow</li><li>Vindicators</li><li>Root Beer Tapper</li></ul><p>This release also contains game histories, developer interviews, and documents. The Xbox version has an Xbox Live feature where players can rank their best high scores against other Xbox players.</p>"},{"name":"Midway Arcade Treasures 2","year":2004,"developer":"Digital Eclipse Software, Inc.","url":"microsoft_xbox_m_part2/Midway%20Arcade%20Treasures%202%20%28USA%2C%20Europe%29.zip","filesize":6651760317,"score":7.3,"genres":"Compilation","desc":"<p><em>Midway Arcade Treasures 2</em> is a compilation that contains the following games:</p><ul><li>Mortal Kombat II</li><li>Mortal Kombat 3</li><li>Gauntlet II</li><li>Spy Hunter II</li><li>Xybots</li><li>NARC</li><li>APB</li><li>Cyberball 2072</li><li>Timber</li><li>Total Carnage</li><li>Pit Fighter</li><li>Wizard of Wor</li><li>Xenophobe</li><li>Primal Rage</li><li>Arch Rivals</li><li>Rampage World Tour</li><li>Kozmik Krooz'r</li><li>Championship Sprint</li><li>Hard Drivin'</li><li>Wacko</li></ul><p>DVD content showing the origins of some of these games is also included.</p>"},{"name":"Midway Arcade Treasures 3","year":2005,"developer":"Gamestar (China) Ltd.","url":"microsoft_xbox_m_part2/Midway%20Arcade%20Treasures%203%20%28USA%2C%20Europe%29.zip","filesize":6462303067,"score":6.8,"genres":"Action > Compilation > Arcade","desc":"<p>This is third Midway Arcade Treasures compilation released in as many years. This collection focuses on Midway and Atari racing games from the 1990s. The games in this collection include:</p><ul><li>San Francisco Rush: The Rock Alcatraz Edition</li><li>Hydro Thunder</li><li>Super Off Road</li><li>Badlands</li><li>Race Drivin'</li><li>S.T.U.N. Runner</li><li>San Francisco Rush 2049</li><li>Offroad Thunder</li></ul><p>Some of the games in this collection are based on the home conversions, rather than emulation of the arcade originals.</p>"},{"name":"Mike Tyson Heavyweight Boxing","year":2002,"developer":"Atomic Planet Entertainment Limited","url":"microsoft_xbox_m_part2/Mike%20Tyson%20Heavyweight%20Boxing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6749738229,"score":5.2,"genres":"Sports > 1st-person > 3rd-person (Other) > Fighting > Boxing > Licensed","desc":"<p>In the game you are one of the heavyweight boxers - the sportsman, who can become absolute champion in boxing. All you need is challenge most unpredictable boxer of all times Mike Tyson and if you win the fight then you acquire Platinum Belt and become strongest human in Boxing. During you pass to the victory you can challenge other famous boxers such as Hasim Rahman or Larry Holmes. Here is possibility to create your own fighter and upgrade him with improvements. In fight you can change the beauty of the opponent's face and it will influence on his condition. Also you can use illegal blows but not much, cause it can result in your disqualification.</p><p>The 9 separate game modes such as Belt Mode, Speed Boxing or Exhibition Mode and 20 international arenas such as Carnival City or Wembley are available for your pleasure.</p>"},{"name":"Minority Report: Everybody Runs","year":2002,"developer":"Treyarch Corporation","url":"microsoft_xbox_m_part2/Minority%20Report%20-%20Everybody%20Runs%20%28Europe%29.zip","filesize":6761369711,"score":5.4,"genres":"Action > 3rd-person (Other) > Sci-fi / futuristic > Licensed","desc":"<p>Based on the movie of the same name.  You play John Anderton, the head of Pre-Crime.  The game is a third person fighting/adventure game.  You fight your way through Pre-crime cops and change your identity in an attempt to clear your name of pre-murder charges.</p><p>The game involves both hand-to-hand combat, the use of weapons and flying a jet pack. When fighting an opponent hand-to-hand there are multiple punch and kick combinations that can be used, these have greater effect on the opponent rendering them senseless quicker. Unconscious opponents can be picked up and then either hit some more or thrown. </p><p>Around the levels there are power-ups to collect such as health and cash, the health is used immediately to restore the player's character while the cash is used on the black market, accessed via the pause menu, to purchase new combat manoeuvres; permanent upgrades; temporary upgrades or weapons.</p>"},{"name":"Mission: Impossible - Operation Surma","year":2003,"developer":"Paradigm Entertainment Inc.","url":"microsoft_xbox_m_part2/Mission%20-%20Impossible%20-%20Operation%20Surma%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6348207951,"score":6.6,"genres":"Action > 1st-person > Behind view > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p><em>Operation Surma</em> is a stealth action game that puts the player in the role of the top-secret government agent Ethan Hunt, with settings based on the <em>Mission Impossible</em> movies. The story does not follow any of the movies, nor does the main character resemble Tom Cruise; however, everything else, from various gadgets and disguising is present. Following the story, the player will unfold many mysteries behind the ICE Worm virus developed by the Surma Corporation that makes them only one step to global domination, and will have to prevent that from happening using any means necessary.</p>"},{"name":"MLB SlugFest 2003","year":2002,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/MLB%20SlugFest%202003%20%28USA%29.zip","filesize":6610101910,"score":7.4,"genres":"Sports > Arcade > Baseball > Licensed","desc":"<p>Midway's first extreme sports title that tackles the great American past-time... baseball.  Take control of all of your favorite Major League Baseball teams and players armed with all of their real stats, attributes, abilities and attitude.  Slugfest features many playable minigames, a season mode, quick play and exhibition play.</p><p>So what makes MLB Slugfest extreme?  The game is far from a real baseball simulation.  This is as arcade as it gets.  Flaming fastballs that take out batters ankles (and reducing their stats), out-of-the-park home runs, dropkicking the catcher on your dash to home plate, kidney punching the batter who just ruined your no-hitter and many other brutal tactics bring sportsmanship to an all-new low.</p><p>Graphic touches include real player faces and details such as chewing gum and talking to teammates or opponents.  Real stadiums all make their appearances along with several fantasy stadiums that can be unlocked.</p>"},{"name":"MLB SlugFest 2004","year":2003,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/MLB%20SlugFest%202004%20%28USA%29.zip","filesize":6591700235,"score":7.5,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>The second title in Midway's baseball series, SlugFest 20-04 continues to pour on the rough-housing gameplay, bizarre codes, and humorous commentary.  In addition to the new Home Run Derby mode and Create-A-Team options, the game features the ability of pitchers to catch \"On Fire\" and impossible Special Pitches that zigzag, arc, and whizz by in ways that would leave any batter humiliated.  New secret teams have been added to the previous bunch, including aliens, minotaurs, and Sub-Zero of Mortal Kombat fame.  The customizable Instant Replay is another nice touch, allowing you to relive the awkward moments once you pause the game.  And, of course, Tim Kitzrow and Jim Shorts return to the commentators' booth, making their signature random comments and incessant arguments.</p>"},{"name":"MLB SlugFest 2006","year":2006,"developer":"Blue Shift, Inc.","url":"microsoft_xbox_m_part2/MLB%20SlugFest%202006%20%28USA%29.zip","filesize":6425702815,"score":6.5,"genres":"Sports > 3rd-person (Other) > Baseball > Licensed","desc":"<p>Slugfest 2006 continues the franchise's special brand of arcade style baseball with a mix of old and new features.  All of the basic over-the-top gameplay, such as hard collisions, turbo power pitching and batting, and on-fire unlimited turbo remain intact.  Also returning this year are commentators Jim Shorts and Tim Kitzrow.</p><p>Gameplay modes include Create-A-Player, Create-A-Team,  Season Mode, Challenge Mode, Playoffs, and Home Run Derby.  Other new features include fighting game style special pitches in which you input a special sequence of button presses to unleash wild and hard to hit throws.  Stadiums and uniforms have been updated for the 2006 season, and the rosters are current as of February.</p>"},{"name":"MLB SlugFest Loaded","year":2004,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/MLB%20SlugFest%20-%20Loaded%20%28USA%29.zip","filesize":6494664030,"score":7.4,"genres":"Sports > 1st-person > 3rd-person (Other) > Baseball > Licensed","desc":"<p>MLB Slugfest Loaded is a Midway style sports game that features aggressive baseball playing strategies and supports 4 game play modes. Quickplay, Franchise, Home Run Derby, and Online Mode. Each game mode features intense over the top baseball action situated in real life stadiums or in un-lockable fantasy environments.</p><p>The various game modes allow you to compete against intelligent computer controlled opponents or play against human players both on and offline. The intuitive interface allows novice players to quickly pick up the game and start playing within minutes. Although MLB Slugfest Loaded is easy to learn, experienced players will also find the game compelling with a vast array of customizable options, un-lockable teams and stadiums.</p>"},{"name":"Mob Enforcer","year":2005,"developer":"Touchdown Entertainment, Inc."},{"name":"Mobile Light Force 2","year":2002,"developer":"AlfaSystem Co., Ltd."},{"name":"Mojo!","year":2003,"developer":"FarSight Technologies Inc.","url":"microsoft_xbox_m_part2/Mojo%21%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":6890155034,"score":"","genres":"Action > Behind view > Puzzle elements","desc":"<p>In this 3D puzzle game, roll through all the blocks, using color switches to get different colored blocks. If there wasn't a time limit (in the form of your Mojo level), it might even be easy.</p><p>Mojo! features over 100 levels, with obstacles and powerups to help and hurt you, along with a level editor. Up to four player can face each other in Battle Mode and Mini-Golf Mode.</p>"},{"name":"Monopoly Party","year":2002,"developer":"Runecraft Ltd.","url":"microsoft_xbox_m_part2/Monopoly%20Party%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6752154917,"score":6.5,"genres":"Strategy > 1st-person > Top-down > Board game > Licensed","desc":"<p>Based on the hugely successful Monopoly board games, you have the opportunity to become a millionaire and bankrupt up to four other friends.</p><p>Like the original, you must buy property, move around the board, make money and ruin your enemy to survive.This game features all you would expect of the game, fines, \"GO\", comunity chests and chances.</p><p>But unlike the original, your board can be made to be a sci-fi, fantasy, prehistoric or the original board.</p>"},{"name":"Monster 4x4: World Circuit","year":2006,"developer":"Ubi Studios SL","url":"microsoft_xbox_m_part2/Monster%204x4%20-%20World%20Circuit%20%28USA%29.zip","filesize":6630001184,"score":5.6,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing","desc":"<p>This game has over 20 monster trucks and 30 circuits that take you all over the world. Race on circuits in the U.S., Europe, Asia, and even Antarctica. Drive trucks that have different car frames like a taxi, a mini cooper, an ambulance, a school bus, the original truck frame and much more. All of these can be customized with vinyls, paint jobs and performance parts. While racing you can score points to unlock hidden cars and tracks, by hitting barrels that can hurt opponents, and hitting tires, crates and buildings.</p>"},{"name":"Monster Garage","year":2004,"developer":"Invictus Games, Ltd.","url":"microsoft_xbox_m_part2/Monster%20Garage%20%28USA%29.zip","filesize":6767892263,"score":"","genres":"Simulation > 1st-person > 3rd-person (Other) > Licensed","desc":"<p>Based on the TV show, this game takes various shows and lets you make the vehicle that was made on the shows.  For those who do not know the TV show, it works like this...</p><p>Jesse and his team are to build a creation that will do a certain task within 7 days and by spending under $3000 and the vehicle must look stock when completed.</p><p>So this game gives you the task of building a vehicle that does something such as drive through a swamp by floating on the water and using a large fan to make you move.</p><p>In day one, you must design the vehicle.  In the early scenarios, you only have one pre-made design to choose from.  In later scenarios, you can choose from three pre-made designs.</p><p>Days two through six are devoted to constructing the vehicle.  You can buy various parts for the vehicle, but most parts will need to be fabricated.  To do this, you will need to purchase raw materials such as sheets of metal or metal rods and assign the task of making something like a roll cage to one of the team members.  They will make the item within a certain period of time while you handle other things. </p><p>Things you need to do include removing parts from the vehicle or attaching parts to the vehicle as needed, and welding items to the vehicle or cutting items off the vehicle.  Every weld and cut is already set up for you and you just follow the line indicated.  Bolts are unscrewed or screwed on as needed.</p><p>By day seven, your vehicle will have to have been completed, or you will need to try again.  Day seven is used only to update the look of your vehicle.  This includes adding certain custom parts such as gold plated rims, painting the vehicle, and applying decals.</p><p>Once you are ready, you will take your vehicle to test it out and see if it works.  If you made it to day seven without being required to start over, your vehicle will work.  This is really just a test where you must complete a track in a certain amount of time.  For example, in one mission, you will have to make it around a snow-covered track in your upgraded car that has snowmobile tracks added to help with tracking within a certain amount of time.  You get as many tries as you need to complete this.  Once done, you can move on to the next mission.</p><p>The challenges of this game are to stay under the $3000 when buying/selling parts and to complete the track at the end.</p>"},{"name":"Mortal Kombat: Armageddon","year":2006,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/Mortal%20Kombat%20-%20Armageddon%20%28USA%29.zip","filesize":5862819264,"score":7.4,"genres":"Action > Racing / Driving > 3rd-person (Other) > Fighting > Martial arts > Licensed","desc":"<p><em>Mortal Kombat: Armageddon</em> brags a roster of 62 characters and sees the return of classic ones from the original Mortal Kombat, such as Reptile, Shang Tsung and Goro. The enhanced Konquest mode (story/adventure mode) improves over the preceding versions, but has a shorter length. There are now 64 arenas (including revamped versions of classic environments) which each have their own tweaks, such as the ridiculous amount of stage fatalities (fatalities are a fancy way of killing your opponent, including classic techniques such as the \"spine-rip\" or \"arm-break\"). </p><p>In the new Kreate-a-character mode, you can design your own character and clothe them with familiar or new costumes. As described earlier, fatalities are a fancy way of killing your opponent and are pretty fun to watch. Various button presses and combos at the end of a fight will sometimes trigger fatality mode and if the right buttons are pressed the fatality can become a chain of fatalities. The Kreate-a-fatality allows you to redesign these finishers.</p><p>Perhaps the most amusing addition for longtime fans is the debut of \"Motor Kombat,\" a racing mini-game patterned after Nintendo's Mario Kart. Motor Kombat has players selecting a vehicle from the following ten characters: Sub-Zero, Bo' Rai Cho, Scorpion, Mileena, Kitana, Johnny Cage, Jax, Cyrax, Baraka, and Raiden. Each super-deformed driver performs his or her trademark move on rivals, from Raiden's electricity to Scorpion's spear attack. The themed courses also feature hazards of their own, including lava pools, spikes, fire, and more. Motor Kombat supports four players in a split-screen view, or up to eight online.</p>"},{"name":"Mortal Kombat: Deadly Alliance","year":2002,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/Mortal%20Kombat%20-%20Deadly%20Alliance%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6543755913,"score":7.4,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Fantasy","desc":"<p>Mortal Kombat: Deadly Alliance is the first Mortal Kombat outing on the next-gen systems.</p><p>Returning from past games are all your favorite fighters, and a host of new ones.  Johnny Cage, Scorpion, Sub-Zero, Raiden, joined by such newcomers as Molloch and Quan Chi.  Each character has their own specific fatalities.</p><p>New to DA is a completely revamped fight engine.  The graphics are in full 3D and feature somewhat interactive environments.  Each character now has different fighting stances, allowing them to be in an offensive stance or a fatality stance.</p><p>DA has over 600 unlockable extras, that are opened by earning \"koins\" that unlock \"koffins\".  The game also comes packaged with bonus material, such as the \"making of Deadly Alliance\" and \"the history of Mortal Kombat\".</p>"},{"name":"Mortal Kombat: Deception (Disc 1)","year":2004,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/Mortal%20Kombat%20-%20Deception%20%28USA%29.zip","filesize":6135913598,"score":7.7,"genres":"Action > 3rd-person (Other) > Isometric > Arcade > Chess > Fighting > Platform > Puzzle elements > Martial arts","desc":"<p>Based on the Mortal Kombat: Deadly Alliance engine, players once again have to fight to stop this new threat in the sixth installment of the fighting series. The standard Arcade, Versus, and Practice modes return, as well as new items to be found in the Krypt. In addition, there are new Konquest Adventure, Chess Kombat, and Puzzle Kombat modes to give the player new mini-games.</p><p>There are a dozen <em>Mortal Kombat</em> fighters selectable at the start of the game, including both old favorites and mysterious newcomers. Longtime fans of the series will recognize veterans of the earliest <em>Mortal Kombat</em> games, such as Sub-Zero and Scorpion, Kabal, Baraka, Mileena, Ermac, and Nightwolf, who are joined by relative newcomers like Bo'Rai Cho, who debuted in Deadly Alliance. The game also introduces nine new fighters, Ashrah, Dairou, Darrius, Havik, Hotaru, Kira, Shujinko, Onaga, and Kobra, each with a distinctly new fighting style intended to balance the deadly abilities of the other characters.</p><p>The Playstation 2 and Xbox versions offer online, competitive play against other players. The Gamecube version does not include online play, but offers Goro and Shao Kahn as exclusive playable characters.</p>"},{"name":"Mortal Kombat: Deception (Disc 2)","year":2004,"developer":"Midway Games, Inc.","url":"microsoft_xbox_m_part2/Mortal%20Kombat%20-%20Deception%20%28USA%29%20%28Kollector%27s%20Edition%20Bonus%20Disc%29.zip","filesize":6873177804,"score":7.7,"genres":"Action > 3rd-person (Other) > Isometric > Arcade > Chess > Fighting > Platform > Puzzle elements > Martial arts","desc":"<p>Based on the Mortal Kombat: Deadly Alliance engine, players once again have to fight to stop this new threat in the sixth installment of the fighting series. The standard Arcade, Versus, and Practice modes return, as well as new items to be found in the Krypt. In addition, there are new Konquest Adventure, Chess Kombat, and Puzzle Kombat modes to give the player new mini-games.</p><p>There are a dozen <em>Mortal Kombat</em> fighters selectable at the start of the game, including both old favorites and mysterious newcomers. Longtime fans of the series will recognize veterans of the earliest <em>Mortal Kombat</em> games, such as Sub-Zero and Scorpion, Kabal, Baraka, Mileena, Ermac, and Nightwolf, who are joined by relative newcomers like Bo'Rai Cho, who debuted in Deadly Alliance. The game also introduces nine new fighters, Ashrah, Dairou, Darrius, Havik, Hotaru, Kira, Shujinko, Onaga, and Kobra, each with a distinctly new fighting style intended to balance the deadly abilities of the other characters.</p><p>The Playstation 2 and Xbox versions offer online, competitive play against other players. The Gamecube version does not include online play, but offers Goro and Shao Kahn as exclusive playable characters.</p>"},{"name":"Mortal Kombat: Shaolin Monks","year":2005,"developer":"Midway Studios - Los Angeles Inc.","url":"microsoft_xbox_m_part2/Mortal%20Kombat%20-%20Shaolin%20Monks%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5934980981,"score":7.4,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Martial arts > Regional differences","desc":"<p><em>MK: SM</em> is a 3D platforming adventure beat-em-up that is based in the Mortal Kombat world. The story begins just after the first tournament, and fills in some of the backgrounds of various characters in the series. Fighting across several areas of Earthrealm, Netherrealm, and Outworld, this game follows Liu Kang and Kung Lao (the Shaolin Monks) as they thwart another invasion of Earth. MK: SM features a wide cast of recognizable characters, many secret unlockables, as well being able to play through with a friend in Ko-op mode.  </p><p>The combat is fast-paced, with numerous ways to dispose of enemies, including MK signature moves and Fatalities. This kombat goes beyond what you have seen in the fighting games, among the upgrades are: The series first Multi-Directional Kombat System, Multalities (kill multiple opponents with one move), Brutalities (see red as you unleash brutal force), ko-op only team-attacks, and even character progression (earn experience to spend on upgrades to moves). The backgrounds, all based on MK and MK II arenas, come to life with numerous hazards for the Monks that they can turn on their enemies.</p>"},{"name":"Motocross Mania 3","year":2005,"developer":"Deibus Studios Ltd.","url":"microsoft_xbox_m_part2/Motocross%20Mania%203%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6787564256,"score":5.6,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other)","desc":"<p>After two PSX games, Motocross Mania returns on the PS2. In this game you race on 20 different courses, using 8 different riders with customizable bikes that can be upgraded, as you fight with weapons from chains to cattle prods, and baseball bats to hammers, while doing stunts to earn money for unlockables like better riders, cool costumes and weapons. You can either try to win the race or beat the other riders to pulp.</p><p>The basic game modes are Championship, Single Race, Time Trial, Freestyle, Multiplayer and Mini Games. This version includes new game modes such as Last Man Standing and Battle Royal where the focus is on arena fighting. During the race, you can fill a mania meter that slows down time.</p>"},{"name":"MotoGP","year":2002,"developer":"Climax (Brighton) Ltd","url":"microsoft_xbox_m_part2/MotoGP%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6768835291,"score":8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Motorcycle > Track racing > Vehicle simulator > Licensed","desc":"<p>Race as one of the official 2001 MotoGP season riders in this motorcycle racing simulation.</p><p><em>MotoGP</em> features layered modes of play to get you up to speed:* Training Mode - learn cornering, braking, top speed and acceleration</p><ul><li>Quick Race - race a single race</li><li>Time Trials - qualifying rounds based on fastest laps</li><li>Arcade Championship - points-based arcade style racing</li><li>Grand Prix - Career mode</li></ul><p>There are 5 different difficulty levels. In the beginning, you are limited to a small number of race tracks. Once you make it to Grand Prix mode, you can race the entire season on 10 of the 16 official race tracks. Your competition consists of about 30 experienced riders on various makes and models of 500cc motorcycles. Races take place all over the world including Germany, Spain, the Netherlands, and Australia and on famous tracks such as Donington and Suzuka. Playing through the Career mode will unlock more tracks for the Time Trials and Quick Race modes.</p><p>Customizations include the ability to assign the controls to your preference, color choices for your bike, helmet, leathers etc., importing your own custom soundtracks, and other upgrades which are unlocked with ability points you earn as you win. Graphical effects like weather changes, variable lighting, cheering fans and on-track competitor animations have been added for realism.</p><p>Multiplayer is split-screen for 2, 3 or 4 players as well as LAN play.</p>"},{"name":"MotoGP 2","year":2003,"developer":"Climax (Brighton) Ltd","url":"microsoft_xbox_m_part2/MotoGP%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6821204345,"score":8,"genres":"Racing / Driving > Simulation > Behind view > Motorcycle > Track racing > Vehicle simulator > Licensed","desc":"<p>The sequel to motogp for PC with 20 licensed professional riders, bikes and 16 tracks. 6 different modes: Stunt, GP, time trial, training, tag and single race. You unlock tracks, bikes, riders and other cheats when you develop your rider's attributes in the GP and training modes. Races feature realistic bike physics and weather conditions that influence gameplay and handling. The online mode supports up to 16 players.</p>"},{"name":"MotoGP: Ultimate Racing Technology 3","year":2005,"developer":"Climax Racing","url":"microsoft_xbox_m_part2/MotoGP%20-%20Ultimate%20Racing%20Technology%203%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6843889775,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Motorcycle > Track racing > Vehicle simulator > Licensed","desc":"<p>The third iteration of the MotoGP franchise updates the GP section of the game for the 2004 season with up to date tracks, bikes &amp; riders. There are four skill levels, full varied weather effects, and all the real riders and bikes.</p><p>It also adds a new Extreme mode to the experience. There are 16 Extreme tracks, each based in or near the locations of the real Grands Prix, giving the game a total of 32 tracks. These are generally faster than the real circuits, but they add hazards such as tight alleyways and bumpy cobbled roads. New customisable street bikes (both 2- and 4-stroke) are featured in the game, specifically for racing on the new Extreme tracks. Earnings in this mode are spent on bike upgrades.</p><p>The on-line section of the game now utilises a seeding system to match riders with a similar ability together. Your seeding starts at 100, and reduces as you win races, depending on their difficulty. Turning the negative of releasing a 2004 season recreation well into 2005 into a positive, the X-Box version also includes some highlight footage of the real 2004 MotoGP season.</p><p>The game also boasts a new Commentator Mode and Spectator Mode which allow non racing players to watch and comment on a race while they wait for a new game to start.</p>"},{"name":"Motor Trend Presents Lotus Challenge","year":2003,"developer":"Kuju Entertainment Ltd.","url":"microsoft_xbox_l/Lotus%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6552348480,"score":6,"genres":"Racing / Driving > Simulation > Behind view > Licensed","desc":"<p>First game of new millennium to be officially licensed by Group Lotus Plc. A British company famous for their racing and sports cars notable appearances in earlier games include James Bond: The Spy Who Loved Me starring Roger Moore and Lotus: The Ultimate Challenge.</p><p>Features 42 cars spanning the company’s history covering: Formula One era (1962 Type 25, 1978 Type 79T to 2001 Formula Lotus), Classic era (1957 Seven S1 to 1986 Excel SE) to modern sports cars (1964 Competition Elan, 1980 E-spirit S2 to new Elise), and two concept cars designed by Lotus Engineers. Each virtual Formula One car is based on actual Team Lotus accomplishments, and other models were thoroughly tried by actual Lotus test drivers. A brief corporate history is also provided in the game.</p><p>“Challenge” mode begins on ‘Lotus test track’ beat best lap time to qualify, then select a character from fictional Lotus Challenge team in story based contest a mixture of World Series Championship racing circuits, stunt driving, and one-on-one races. Each completed segment is ‘unlocked’. “Collection” mode gives players’ access to every car and track ‘unlocked’. “Championship” mode involves seven different championship classes of Classic cars to Super cars, only two of these can be used, as others must be ‘unlocked’ to play. “Single” mode lets you play a quick game of up to 15 laps of any event, challenges, stunts, and races that is ‘unlocked’.</p><p>Twenty circuits across various locations from city, speedway to custom circuits: Trafalgar Square or Buckingham Palace in London, Arizona Yuma County Speedway, Florida Jupiter Beach to Tokyo Bay Tunnel in either day or night with set weather conditions like sunny, fog, rain or snow. Circuits range from flat terrain, navigating sharp hairpins to steep hill climbs. Diversions include nine special events, four stunt sequences and nine different challenges – stunts on Hollywood movie set or advertisements to car football; tasks like fleeing the paparazzi in approaching traffic to transporting against time a pregnant woman to hospital before delivery. Official Lotus test drivers offer advice on undertaking individual courses.</p><p>A variety of options are available from transmission controls, driving aids, and opponent skill to degree of vehicle damage ranging in minimum windows or headlights breakage to total bodywork and engine destruction from minor or major indentation, scraping to separable tires. </p><p>In game visuals provide information on current ranking in comparison to other drivers, laps completed and remaining, overall circuit map, transmission setting, relevant times for present to entire race time, Speedo and revs counter, three tags for anti-lock braking system, traction control and assisted steering.</p><p>Selected multi-player games have access to hidden cars and circuits that can be ‘unlocked’ by finishing agreed single or championship race.</p>"},{"name":"Ms. Pac-Man","year":2004,"developer":"General Computer Corporation"},{"name":"MTV Celebrity Deathmatch","year":2003,"developer":"Coresoft, Inc.","url":"microsoft_xbox_m_part2/MTV%20Celebrity%20Deathmatch%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6736440463,"score":4.6,"genres":"Action > Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>Based on MTV's claymation animation show Celebrity Deathmatch. You play a series of wrestling matches, much in the style of other wrestling games. The twist being, that you play one of various celebrities, such as Marilyn Manson and Carmen Electra. Various weapons appear in the ring during play, such as a chainsaw and crossbow. The game is set out in 6 \"episodes\" of 3 matches each, and you can play either of the celebrities in each match.</p>"},{"name":"MTV Music Generator 3","year":2004,"developer":"Mixmax Ltd.","url":"microsoft_xbox_m_part2/MTV%20Music%20Generator%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6605129809,"score":"","genres":"Simulation > Music / rhythm","desc":"<p><em>MTV Music Generator 3</em> is another one in the line of music making software. The main purpose is to make music in an tracker-like environment. There are lots of samples and musical styles to choose from, and one can import their own samples into the game from CDs as well.</p>"},{"name":"MTX Mototrax","year":2004,"developer":"Left Field Productions, Inc.","url":"microsoft_xbox_m_part2/MTX%20Mototrax%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6132032377,"score":7.5,"genres":"Racing / Driving > Sports > Behind view > Tricks / stunts > Motorcycle > Licensed","desc":"<p><em>MTX Mototrax</em> is a motocross racing game that features motocross legends such as Travis Pastrana and Carey Hart. As players progress in the game's career mode, they will eventually be afforded the opportunity to challenge the mentioned pros in both Supercross and Motocross events as well as freestyle trick events where the focus is set on performing tricks. Winning these events will allow the player to earn cash and sponsorships that unlock additional gear and upgraded bikes. You can also play in exhibition mode to test your skills on any given track. The game features a total of 127 different tricks to perform.</p><p>The game also features a track editor that gives players the option of creating their own custom tracks. Multiplayer is also an available option.</p>"},{"name":"Murakumo: Renegade Mech Pursuit","year":2002,"developer":"FromSoftware, Inc.","url":"microsoft_xbox_m_part2/Murakumo%20-%20Renegade%20Mech%20Pursuit%20%28USA%29.zip","filesize":6254940738,"score":5.3,"genres":"Action > 3rd-person (Other) > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In <em>Murakumo: Renegade Mech Pursuit</em>, the player takes control of a mech pilot in control of the Murakumo, a mech in an elite unit designed to chase down a rebel mech army out to destroy the city of Oliver Port. The main goal of the game is to transverse the city in pursuit of a main rebel mech, destroying smaller enemies along the way and dodging varying obstacles. There are five different prototypes to choose from that carry weapons such as bazookas, sniper cannons and plasma swords.</p><p>There are 20 main missions to compete in, 10 more exclusive ones in the expert difficulty mode. Along with the story mode there is also a trial mode where the player can take on 10 different mech bosses solely for high rankings and a free mission mode where the player can redo previous missions in order to beat their previous records.</p>"},{"name":"Mutant Storm","year":2005,"developer":"PomPom Software Ltd."},{"name":"MVP 06: NCAA Baseball","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part2/MVP%2006%20NCAA%20Baseball%20%28USA%29.zip","filesize":6701110371,"score":7.7,"genres":"Sports > 1st-person > 3rd-person (Other) > Baseball > Licensed","desc":"<p>EA's first take on NCAA baseball, it is the same engine that EA uses for it's MVP Baseball series so batting and pitching are the same as MVP 06.  It does have create-a-player and a custom ballpark mode and has a dynasty mode called \"The Road to Omaha\".  It has the major teams of the NCAA, but as with other NCAA games, no official players, but some official stadiums such as Rosenblatt Stadium (where the championship is held every year).  It also features the voices of Mike Patrick and former Stanford All-American Kyle Peterson as commentators.</p>"},{"name":"MVP Baseball 2003","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part2/MVP%20Baseball%202003%20%28USA%29.zip","filesize":6645200956,"score":7.4,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>MVP is EA Sports' replacement for the aging Triple Play series.  Re-written from the ground up, this rookie title includes a Homerun Showdown (not a derby - something a little different) and Franchise mode as well as the usual exhibition games.  Many custom batting and pitching animations as well as vendors hawking hot-dogs and hecklers shouting player and team specific heckles - all in an effort to submerse you in the game.</p>"},{"name":"MVP Baseball 2004","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part2/MVP%20Baseball%202004%20%28USA%29.zip","filesize":6459191343,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Direct control > Baseball > Licensed","desc":"<p>Step up to the plate for the second iteration of EA Sports' MVP Baseball.  You can sim, manage, or play your way through 120 years of your MLB, AAA and AA franchise.  Manage and play as all three teams - develop your farm and win the World Series - even the Tigers have a chance!  Two mini-modes let you play head to head with friends or the CPU to test your batting and pitching skills.  You can also play in classic fields using classic players like Babe Ruth and Jackie Robinson.  Hundreds of uniforms to choose from and thousands of animations to bring the players to life.</p>"},{"name":"MVP Baseball 2005","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_m_part2/MVP%20Baseball%202005%20%28USA%29.zip","filesize":6583169069,"score":8.3,"genres":"Sports > Behind view > Diagonal-down > Baseball > Licensed","desc":"<p>An MLB baseball game that allows you to play with teams from single A all the way up to the majors. Play your way through the 120 Dynasty Mode, or the 30 year Owner Mode. MVP 2005 has lots of unlockable retro uniforms, stadiums and players. It includes batting and pitching mini-games for practice and a head-to-head home run derby mode.</p>"},{"name":"MX 2002 featuring Ricky Carmichael","year":2001,"developer":"Pacific Coast Power and Light","url":"microsoft_xbox_m_part2/MX%202002%20featuring%20Ricky%20Carmichael%20%28Europe%29.zip","filesize":6785875522,"score":7.4,"genres":"Action > Racing / Driving > Simulation > Sports > 3rd-person (Other) > Motorcycle > Licensed","desc":"<p>MX 2002 featuring Ricky Carmichael is a motocross game which features two basic modes of play. One of motocross racing in which players have the standard practice/single race/season options with ongoing success unlocking more tracks and bikes. The other mode is a stunt-based motocross practice/competition mode where riders try to do as many crazy tricks in a crowd filled arena as possible within a particular amount of time. The game has a unique feature in that the bike has a controllable clutch (even for automatic gears) which must be mastered to succeed at the game. Correct use of the clutch when landing jumps of traversing troublesome terrain allows the rider's speed to be kept at a maximum. This must be used in conjunction with the \"Prime Jump\" button which must be held before a jump or bump to fly through the air.</p>"},{"name":"MX Superfly Featuring Ricky Carmichael","year":2002,"developer":"Pacific Coast Power & Light","url":"microsoft_xbox_m_part2/MX%20SuperFly%20%28Europe%2C%20Australia%29.zip","filesize":6334314313,"score":7.6,"genres":"Racing / Driving > Behind view > Direct control > Motorcycle > Off-roading > Licensed","desc":"<p>Following the success of MX 2002, THQ is back with an all new Supercross game. MX Superfly offers 27 different pro riders, including top MX rider Ricky Carmichael and a variety of bikes you can use to customize the game action.</p><p>There are 22 tracks, an assortment of freestyle arenas and a few mini games giving you lots of places to experiment with tricks and all out racing. The game offers exhibition race, freestyle and career modes. There are a number of unlockable items including new riders, bikes, tracks and mini-games.</p><p>New in this edition is the track editor which allows you to create your own stunt tracks. The graphics are well done and the soundtrack is above par for this genre of game.</p>"},{"name":"MX Unleashed","year":2004,"developer":"Rainbow Studios, Inc.","url":"microsoft_xbox_m_part2/MX%20Unleashed%20%28Europe%29.zip","filesize":6881324239,"score":7.8,"genres":"Racing / Driving > Sports > Behind view > Motorcycle","desc":"<p>From the makers of the amazing Motocross Madness series, comes a brand new motocross game...</p><p>MX Unleashed brings in loads of great new features, whilst still managing to keep the things that made its predecessors good.  </p><p>It has lots of enhancements like a top of the range physics engine, letting you see all the movements of the bike realistically flow through the rider, and bone-jarring crashes looking very realistic and painful.</p><p>It also has over 40 courses, made up of freestyle, motocross and national tracks, a whole new career mode, incredible sound, the opportunity to play against your friends with split screen mode, and the addition of a much needed new trick engine, allowing combos and no handed landings.</p>"},{"name":"MX vs. ATV Unleashed","year":2005,"developer":"Rainbow Studios, Inc.","url":"microsoft_xbox_m_part2/MX%20vs.%20ATV%20Unleashed%20%28Europe%29.zip","filesize":6550242550,"score":7.5,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Motorcycle > Off-roading","desc":"<p>From the makers of MX Unleashed, MX vs. ATV pushes the envelope for others to follow. Choose from either a heart-pounding career Championship mode or race it up online for the fast-paced challenge from people all over the world. This worthy sequel quenches both the single player aspect of racing as well as the online challenge. Pick from either an MX bike or go at it with the newly added ATVs, Monster Trucks, Buggies etc.</p>"},{"name":"MX World Tour featuring Jamie Little","year":2005,"developer":"Impulse Games","url":"microsoft_xbox_m_part2/MX%20World%20Tour%20featuring%20Jamie%20Little%20%28USA%29.zip","filesize":6860795863,"score":6.2,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Direct control > Motorcycle > Off-roading > Track racing","desc":"<p>This game features Motocross racing and showcases popular motorsports commentator, Jamie Little.  Race against 11 other riders on 32 different tracks around the globe.  </p><p>This game features Supercross (indoor), Motocross (outdoor), and Supermoto (dirt and asphalt) tracks.  Splitscreen multiplayer for 2-4 players is also available.  </p><p>Jamie Little, in addition to providing race commentary, is also a playable character.</p>"},{"name":"Myst III: Exile","year":2002,"developer":"Presto Studios, Inc.","url":"microsoft_xbox_m_part2/Myst%20III%20-%20Exile%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6798830514,"score":7.7,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements > Point and select > Fantasy > Steampunk","desc":"<p>Set 10 years after the events of Riven, <em>Myst 3: Exile</em> is about a man who wants revenge on Atrus.</p><p>The gameplay remains the same point and click interface as Myst, but adds 360 degree scrolling technology for a more realistic gaming experience.</p>"},{"name":"Myst IV: Revelation","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_m_part2/Myst%20IV%20-%20Revelation%20%28USA%29.zip","filesize":6450561416,"score":8,"genres":"Adventure > 1st-person > Graphic adventure > Puzzle elements","desc":"<p>In <em>Myst IV</em>, you learn the fate of the two brothers from Myst 1 and must search for Yeesha, Atrus' daughter. Sirrus and Achenar have remained trapped in their prison worlds for crimes they have committed. With the disappearance of Yeesha, you must explore the two prison worlds and find her.</p><p>Like the previous games in the Myst series, the gameplay is node based and not 3-D like Uru. <em>Myst IV</em> is more interactive than any other previous Myst game. Using a hand as your cursor, you can push buttons, pull and push things, open and close drawers, or just tap objects. The game also contains a built in hint system with three levels of hints, each level gives more and more help on how to solve a puzzle.</p><p>The soundtrack was composed by Jack Wall with a song by artist Peter Gabriel.</p><p><em>Myst IV</em> also has the addition of a zip mode, allowing you to quickly travel to places you've been before.</p>"}]