[{"name":"N.U.D.E.@: Natural Ultimate Digital Experiment","year":2003,"developer":"Red Entertainment Corporation","url":"microsoft_xbox_n_part1/N.U.D.E.%40%20-%20Natural%20Ultimate%20Digital%20Experiment%20%28Japan%29.zip","filesize":6629887087,"score":"","genres":"Simulation > 3rd-person (Other) > Anime / Manga > Real-time > Sci-fi / futuristic","desc":"<p>In this game, you meet a robotic girl, named P.A.S.S, and you must teach her how to speak, name things, and teach her new words! She will understand everything you say,will engage in conversations with you,will learn from you, and lots, lots more! For example, the chair. Select the chair, and tell her \"Chair\". She will understand and remember that from then on.</p><p>You need to be able to speak japanese.</p><p>There is no nudity in this game.</p>"},{"name":"Namco Museum","year":2002,"developer":"Mass Media, Inc.","url":"microsoft_xbox_n_part1/Namco%20Museum%20%28USA%29.zip","filesize":6872109611,"score":6.9,"genres":"Compilation","desc":"<p>A total of 12 games are offered in <em>Namco Museum</em>: </p><ul><li>Pac-Man</li><li>Pac-Man Arrangement</li><li>Galaga</li><li>Galaga Arrangement</li><li>Dig Dug</li><li>Dig Dug Arrangement</li><li>Pole Position</li><li>Pole Position II</li><li>Ms. Pac-Man</li><li>Galaxian</li><li>Pac-Attack</li><li>Pac-Mania</li></ul><p>The only game not originally from the arcades is <em>Pac-Attack</em>, released on the Genesis and the SNES in 1993 and for the first time since their arcade days, Pac-Man Arrangement, Galaga Arrangement and Dig Dug Arrangement are ported to the home console.</p><p>Everything is exactly the same as the original arcade versions, including the music, cut scenes, graphics, and even the many graphical errors that appear.</p>"},{"name":"Namco Museum: 50th Anniversary","year":2005,"developer":"Namco Limited","url":"microsoft_xbox_n_part1/Namco%20Museum%2050th%20Anniversary%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6851671124,"score":6.3,"genres":"Compilation","desc":"<p>Namco is honoring its 50th anniversary by releasing this compilation of arcade classics. Using a retro interface, you check out a virtual arcade hall where you can select each classic in its original arcade cabinet.</p><p>Exclusive to the Xbox version are Live Leaderboards where you can post high-scores.</p><p>The 16 games included are:</p><ul><li>Pac-Man</li><li>Ms. Pac-Man</li><li>Galaga</li><li>Galaxian</li><li>Dig Dug</li><li>Pole Position</li><li>Pole Position II</li><li>Rolling Thunder</li><li>Rally X</li><li>Bosconian</li><li>Dragon Spirit</li><li>Sky Kid</li><li>Xevious</li><li>Mappy</li><li>Galaga '88 (unlockable)</li><li>Pac-Mania (unlockable)</li></ul>"},{"name":"Namco Vintage","year":2004,"developer":""},{"name":"NARC","year":2005,"developer":"Point of View, Inc.","url":"microsoft_xbox_n_part1/Narc%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6346877990,"score":5,"genres":"Action > Behind view > Fighting > Shooter > Stealth > Direct control > Detective / mystery","desc":"<p><em>NARC</em> is a 3rd-person shooter that has the player tracking the distribution of the deadly new narcotic \"Liquid Soul\" across two different cities in Asia and the U.S.A. The player controls one of two characters - Narcotics detective Jack Forezenski (voiced by Michael Madsen), or D.E.A. agent Marcus Hill (voiced by Bill Belamy). Both are led by Narcotics chief Joe Kowalski (voiced by Ron Pearlman), and the player switches between the two as the story unfolds.</p><p>As an undercover cop, players are free to roam the streets and dispense justice at their discretion. Aside from storyline missions, players can encounter 12 types of randomized street crimes and stop them to boost their \"badge rating\" (loosely, a measure of their trust within the police). Players can likewise flash their badge around to cause perps to surrender or run. Criminals that resist must be beaten in a small \"struggle\" minigame to get cuffed. Players can also arrest alleyway drug dealers and deposit their drugs safely at the station.</p><p>Alternatively, the player can beat up drug dealers for their cash and stash, then sell the drugs to civilians for income. The player can also use the drugs themselves for temporary beneficial effects (ecstasy keeps enemies from attacking, speed makes you run and shoot faster, etc.) at the cost of badge points and the potential to become addicted. Excessive use of force against innocent civilians, or selling drugs to other undercover cops, result in major losses of badge points.</p><p>Players have a maximum badge rating of 100. If it drops below 49, they are demoted to Patrolman and cannot take new story missions. The player must roam the streets in their police blues and stop enough random crimes to be moved back to Narcotics. If the player's rating drops below 24, they are kicked off the force and rendered jobless. Jobless players cannot fight or shoot weapons without attracting police attention. Further drops in rating cause the player to be wanted by the police, with a rating of 5 or lower spawning officers specifically to shoot or arrest the player.</p><p>There are 25 hidden drug stashes in each city. Finding all of them will unlock the original N.A.R.C. arcade game for play.</p>"},{"name":"NASCAR 06: Total Team Control","year":2005,"developer":"Point of View, Inc.","url":"microsoft_xbox_n_part1/NASCAR%2006%20-%20Total%20Team%20Control%20%28USA%29.zip","filesize":6468618268,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR returns with some new drivers and veterans (as in Jeff Gordan, Dale Earnhardt Jr. and etc), and all the tracks from the NASCAR circuit. This NASCAR has a new feature were you can take control of another racing partners car to help them get out in front, and all the classic features. Graphics are updated, see tires, debris, and oil and etc, everywhere. Get all new unlockables of drivers, tracks, and upgrades on cars and tracks. Customize anything you please, build your own driver and change track settings where you want, so get out there and race.</p>"},{"name":"NASCAR 07","year":2006,"developer":"Point of View, Inc.","url":"microsoft_xbox_n_part1/NASCAR%2007%20%28USA%29.zip","filesize":6603631903,"score":6.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>NASCAR returns with a new roster of drivers and features in <em>NASCAR 07</em>. The gameplay and available modes are fairly identical to the previous game (including the team racing controls), but the pace has been kicked up a notch, with an added blur effect to enhance the sense of speed. A new feature is the Adrenaline meter. When full, it offers improved handling and speed. Drivers now carry ranks with different attributes (Dynamic Driver Attributes) and racing tendencies. Specific drivers will perform better on certain tracks. Players can earn skill points to improve their attributes by keeping a lead, making clean passes, intimidation or survive dangerous situations.</p><p>The main modes are Race Now, Season Mode, Chase for the Cup, Fight to the Top (Whelen Modified series, Craftsman Series, Craftsman Trucks, NBS, and NEXTEL Cup), Online Races (Quick Matches and Optimatch - where the host can fully define the event) and Dodge Challenges. The Dodge Speed Zone mode is no longer included. Important racers are shown in FMV interviews prior to Dodge Challenge races. As usual, the car can be tweaked and fine-tuned in many ways.</p><p>This is the first NASCAR game to appear on the PSP. It is fairly similar to the console versions, but does not include Total Team Control to talk with the team. The handheld version includes a new feature: Instant Rewind. While racing, a meter builds up with time, which can be used to rewind the game action when crashing or taking a bad turn. A few of the game modes are different.</p><p>Sterrance is featured on the US cover, as the driver for the #12 Alltel Dodge. The PAL release has Thomas's DeWalt Ford Fusion.</p>"},{"name":"NASCAR 2005: Chase for the Cup","year":2004,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NASCAR%202005%20-%20Chase%20for%20the%20Cup%20%28USA%29.zip","filesize":6545072137,"score":8.2,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>NASCAR 2005: Chase for the Cup</em> marks a change in name for the series, but continues the style of gameplay and game modes from the NASCAR Thunder titles.</p><p>Four new racing series have been added for this year; in addition to NEXTEL cup cars, players can race in the Featherlite Modified, Craftsman Truck, Nascar National (Busch), or production car series. Each type of car has its own unique feel and gives a different on-track experience. Real-life driver rivalries and confrontations are brought into the game with the enhanced grudges and alliances system. Computer drivers will remember whether you drive naughty or nice, and will payback favors in kind. The new Intimidator feature allows you to shake up an opponent by getting behind him and putting on the pressure.</p><p>In fight to the top mode, players can follow the career of their driver by starting in the Modified series and working their way up the NASCAR ranks. Performing well in races, as well as participating in autograph sessions, affects fan support, which in turn improves the driver's income.</p><p>Online support for the PlayStation 2 and Xbox allow up to four players to compete in a full 43-car field.</p>"},{"name":"NASCAR Heat 2002","year":2001,"developer":"Monster Games, Inc.","url":"microsoft_xbox_n_part1/NASCAR%20Heat%202002%20%28USA%29.zip","filesize":6581663658,"score":7.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>Race as one of twenty-five drivers at nineteen tracks, in this simulation of the 2001 Winston Cup season.  Race head-to-head against your friends, or try to beat the real drivers' ghost cars in Race The Pro.  Real racing scenarios are recreated to provide a quick challenge, in Beat the Heat.</p><p>The Xbox version differs from the PS2 version: it has all-new track models, textures, and car models.  Also, rather than returning to the UI between Practice/Qualify/Race, the player would experience \"race day\" on a track-side monitor.</p>"},{"name":"NASCAR Thunder 2002","year":2001,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NASCAR%20Thunder%202002%20%28USA%29.zip","filesize":6679961392,"score":8.1,"genres":"Racing / Driving > Simulation > Sports > 1st-person > Behind view > Direct control > Automobile > Track racing > Licensed","desc":"<p>This game is the first entry in EA's NASCAR Thunder series, where players can choose from sixty different drivers including Jeff Gordon, Dale Earnhardt Jr., Jimmie Johnson, Mark Martin, Tony Stewart, Dale Jarrett, just to name a few. There is an <em>Quick Race</em> mode where players can go against the computer or compete against three friends and can customize their options including turning yellow flags on or off, realistic damage and the length of races.</p><p>A 20 season <em>Career Mode</em> is also present that let's players build a car from scratch by choosing a number, paint scheme and up to four different sponsors. As the player progresses through their career, they can use money earned from races to buy better parts to upgrade their car and land bigger sponsors, depending on if the player meets their sponsor's goals.</p><p>There are also options where player's can tweak their car to their liking including change air pressure of their tire's, gear ratios, the angle of their spoiler, among others, depending on which track they race on. 23 real-life tracks are present including Lowe's Motor Speedway, Watkins Glen International Speedway and even the famed Daytona Speedway, home of the Daytona 500. Another feature lets the player race against the legend himself, Richard Petty, if they can win eight season championships.</p>"},{"name":"NASCAR Thunder 2003","year":2002,"developer":"Image Space Inc.","url":"microsoft_xbox_n_part1/NASCAR%20Thunder%202003%20%28USA%29.zip","filesize":6614486557,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>NASCAR Thunder 2003 simulates the NASCAR driver experience.  Dozens of locations are available, each with several alternate tracks.  All the big-name drivers of the present, and a few of the past, are available to choose from, or you can create your own driver and car.  Simulate a season, or even a full 20-year career complete with sponsorship deals and car improvements along the way.  Moments of the Race places you in real-life racing situations, asking you to either duplicate reality's outcome, or improve upon it.  Or you can race against up to three people.  The choice is yours.</p>"},{"name":"NASCAR Thunder 2004","year":2003,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NASCAR%20Thunder%202004%20%28USA%29.zip","filesize":6419615483,"score":7.2,"genres":"Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>You can race on a variety of courses, from twenty three real world Winston Cup courses, twelve road courses and eleven fantasy courses, including a costal town and a busy city. There are sixty challenges in all.</p><p>When racing, what you do on the circuit affects future races. Ram someone into the wall or cause someone to spin out, and they'll remember. They'll try to get back at you in a future race. Help someone out, by clearing a path or sharing the draft, and they'll return the favor to you. Grudges and alliances are tracked throughout your career, so the more you piss someone off, the more likely they'll try to harm you.</p><p>Like the Football Camp mode in Madden NFL 2004, the Speed Zone is comprised of different many games that will earn you points and increase your skill, such as passing and drafting, blocking and drifting.</p><p>With the Career mode, you can go through a full twenty seasons before having to retire. You manage everything, from your pit crew and car parts to your sponsors and research and development.</p><p>There are seventy officially licensed drivers and over 180 vehicle skins. If nothing suits you, create your own driver and car and see how you do.</p><p>As in every 2004 edition of EA Sports console games, you'll find the EA Sports Bio, which is a career tracker that tracks your stats over every EA Sports game. The more games you play and the longer you play, the higher your level and the more rewards you can unlock.</p><p>Tune your car right and drive like a pro, and you may just make it to the finish line.</p>"},{"name":"NBA 2K2","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part1/NBA%202K2%20%28USA%29.zip","filesize":6341363207,"score":8.2,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Basketball > Licensed","desc":"<p><em>NBA 2K2</em> is the third game in SEGA's NBA 2K series of basketball simulations. This is the first game in the series to be released for multiple platforms (instead of solely for the Dreamcast). In addition to updated graphics, rosters, arenas, team uniforms, and signature moves for the 2001-2002 season, the 2K2 edition now supports zone defenses (a new NBA rule where you have to choose to play man or zone defense), intercepting of passes, and making adjustments and actions in mid-animation.</p><p>There are detailed statistics for each team and player, for a year, the current season or an entire career. The game modes include Exhibition, Season (play a full season along with management), Franchise (more than one season), some arcade street modes and the option to create custom tournaments.</p>"},{"name":"NBA 2K3","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part1/NBA%202K3%20%28Europe%29.zip","filesize":6595214792,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Sega Sports has added a new season of their basketball franchise.  NBA2K3 comes packed with a new feel, graphics, gameplay, and updated stadiums and rosters.  The ESPN broadcast presentation makes it seem even more realistic.  You can now adjust your shot in mid-air, dive for loose balls going out of bounds, fight for position down low, and fake your opponent out as you move around him. You can do it all in NBA2K3.  Also new for the Xbox and PS2 is Online play. You can now play online against other players across the globe.  Franchise mode offers extended gameplay as well as managing your team from the inside out. Street mode has also return with more courts and interactive bystanders.</p>"},{"name":"NBA 2K6","year":2005,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part1/NBA%202K6%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5942354998,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>2K's long running basketball franchise, this one features the obligatory roster updates as well as an updated control scheme such as utilizing the analog stick to pass, shoot and even dunk. The turbo button has been eliminated, but players can now choose how to adjust their players aggressiveness in the game to determine how they will play.</p><p>It also features many NBA players such as Shaquille O'Neal, Steve Nash and Amare Stoudemire along with many others. It also feature \"The Crib\", similar to Madden's apartment, where players can unlock and buy items to place in their apartment, upgrading as they progress through the game. There are also the regular game modes such as exhibition and even a franchise mode where players can control everything, from hiring new players, coaches and even scout out players.</p><p>The Xbox 360 features the V.I.P. feature, where players can view and even download their profiles to compare and compete against each other. It also features the commentary of Kevin Harlan and Kenny Smith.</p>"},{"name":"NBA 2K7","year":2006,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part1/NBA%202K7%20%28USA%2C%20Europe%29.zip","filesize":6001449460,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>NBA 2K7 continues the tradition of the NBA 2K series into the next generation for the first time. All your standard modes and options that you normally find on a basketball simulation are here, including online head-to-head modes and complete customization of your team and leagues, but it's the exclusives for next generation systems that step up the game, with signature styles (where by each individual athlete performs and acts just as they do in real life), the return of the shot stick (determining your accuracy on the court) and further in-depth options involving trades, player fatigue, online customization and a complete player creator feature.</p>"},{"name":"NBA Ballers","year":2004,"developer":"Midway Games, Inc.","url":"microsoft_xbox_n_part1/NBA%20Ballers%20%28USA%29.zip","filesize":6593865169,"score":7.9,"genres":"Action > Sports > 3rd-person (Other) > Arcade > Basketball > Licensed","desc":"<p>NBA Ballers is the exclusive one-on-one basketball videogame highlighting the \"bling-bling\" lifestyle of NBA Superstars; chromed-out cars, ice, ladies, tatts and jets all hinge on the killer cross-over. NBA Ballers also features NBA Legends dropping dimes and dunking in your grill to determine who is the greatest baller of all time. 60+ NBA Players: Including Kobe Bryant, Vince Carter, Allen Iverson, Kevin Garnett, Shaquille O’Neal, Yao Ming, Steve Francis, Chris Webber, Gary Payton, Latrell Sprewell, and more! 24 NBA Legends: Including Rick Barry, Larry Bird, Wilt Chamberlain, Clyde Drexler, Julius Irving, Magic Johnson, Bill Russell, Jerry West, James Worthy, and more!</p>"},{"name":"NBA Ballers: Phenom","year":2006,"developer":"Midway Games, Inc.","url":"microsoft_xbox_n_part1/NBA%20Ballers%20-%20Phenom%20%28USA%29.zip","filesize":6438097128,"score":7.1,"genres":"Sports > 3rd-person (Other) > Direct control > Basketball > Licensed","desc":"<p><em>NBA Ballers: Phenom</em> is the sequel to NBA Ballers and is a continuation of the Midway NBA series started in 1994 with NBA Jam. The objective of the game is to best your opponent in rounds of street basketball. The game is broken up into many modes, including a full story mode, versus and practice modes. Players have the option to play as one of many NBA players, or create their own character to take through story mode, with the game's Create-A-Baller mode.</p><p>The plot of story mode follows you, a young gun trying to make a break into the big leagues of street ball and your one time friend, Hot Sauce. Hot Sauce betrayed you, and stole your girlfriend, taking his fame and fortune to the top of the leagues. Now it's up to you to win it all, and take back your pride and your game.</p><p>The game features celebrities such as Hot Sauce, Ludacris, Trikz, Jin, and Chingy. The players' looks can be fully customized.</p>"},{"name":"NBA Inside Drive 2002","year":2002,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_n_part1/NBA%20Inside%20Drive%202002%20%28Europe%29.zip","filesize":6420966638,"score":7.7,"genres":"Sports > Basketball > Licensed","desc":"<p>NBA Inside Drive 2002 is Microsoft's first foray into console basketball.</p><p>With Inside Drive, you can act as the player, the manager, and the coach.  You are able to trade players, sign free agents, and change your playbook.  When playing, you can change your strategy on-the-fly.</p><p>Inside Drive has play-by-play commentary from Kevin Calabro and Marques Johnson.</p><p>You can choose from all the standard NBA teams, or you can set up a draft and craft your team with whomever you want.</p><p>Inside Drive sports 1-4 players, so you can play with your friends.</p>"},{"name":"NBA Inside Drive 2003","year":2002,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_n_part1/NBA%20Inside%20Drive%202003%20%28Europe%29.zip","filesize":5921320616,"score":7.7,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>NBA Inside Drive 2003 offers intense gameplay, lively commentary, detailed arenas from the NBA, and music by MasterP. Game features allow the player to manage a team for 25 consecutive seasons. Track a player's skills from season to season. Create and customize a player from appearance to style of play. All aspects of the game of pro basketball is covered in this game. The announcers commentary accurately follows the pulse of the game and adds to the overall game experience. The AI of the players' hold true to the players' appearance in the game and in real life. Larger players will move more slowly and fatigue quicker than smaller players. So if you pull a jump shot on a shorter player you don't have to worry about poor AI allowing the shorter player a 5 foot vertical leap to block your shot. The AI is honest and accurate. </p>"},{"name":"NBA Inside Drive 2004","year":2003,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_n_part1/NBA%20Inside%20Drive%202004%20%28Europe%29.zip","filesize":5612824425,"score":7.2,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Real-time, 3D NBA basketball simulation with online league capabilities.More responsive \"juke\" controls for one-on-one isolation moves.Gamers can play up to 25 NBA seasons with full general management capabilities.All-new Drive Cam camera angle brings the player closer to the action.For 1 or more players (online gaming requires Internet connection).Features 3D crowd.</p>"},{"name":"NBA Jam","year":2003,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_n_part1/NBA%20Jam%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6365268516,"score":6.9,"genres":"Sports > Diagonal-down > Side view > Arcade > Direct control > Basketball > Licensed","desc":"<p>3-on-3 arcade-style basketball with over 50 of the NBA's all time greatest players.  Enter a Legends Tournament and travel back in time as you work your way up through the ranks in head-to-head battle with the best from each era.  Each time you defeat a team their players are available for you to use in creating your ultimate dream team.  And for some real high-flying action build up your Jam Meter and hit the lights with the over 40 unique Monster Dunks.</p><p>This game feautres tons of unlockables (teams, courts, and cheats) as well as commentary by Tim Kitzrow and Bootsy Collins.</p>"},{"name":"NBA Live 06","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Live%2006%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":6152848864,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>With a new season of the NBA comes a new edition to the NBA Live series. <em>NBA Live 06</em> lets you play as professional basketball teams in the NBA 2005-2006 season. You can play in single player Dynasty Mode, which allows you to play 25 seasons with your team, draft and trade players, as well as control players movements in mid-air for ultimate control of dunks and other moves. The game features graphics and AI that are improved from the last NBA Live game and real commentary from Marv Albert, Steve Kerr, Ernie Johnson, and Kenny \"The Jet\" Smith.</p>"},{"name":"NBA Live 07","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Live%2007%20%28Europe%29.zip","filesize":6605826098,"score":7.1,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>ELEVATE YOUR GAME<br>FEATURES * ALL-NEW EA SPORTS™ TOTAL FREESTYLE CONTROL: Take complete control of EA SPORTS™ Freestyle Superstars, including shooters, scorers, stoppers, and more, by changing skill attributes on the fly. * UNPRECEDENTED ESPN INTEGRATION: The worldwide leader in sports delivers updates, scores, and breaking news via the most advanced ESPN integration package ever. * THE DEEPEST NBA DYNASTY MODE™: Manage player morale and team chemistry as you make key decisions based on player personality, ability and age. * NBA ALL-STAR WEEKEND: Analysts Greg Anthony and Ernie Johnson highlight every spectacular play during the Slam Dunk Contest and 3 Point Shootout. The weekend ends with the Rookie Challenge and All-Star Game. * VOICES OF THE NBA<br>Former Chicago Bulls star Steve Kerr joins the legendary Marv Albert courtside to call the action from the best seats in the house</p>"},{"name":"NBA Live 2002","year":2001,"developer":"NuFX, Inc.","url":"microsoft_xbox_n_part1/NBA%20Live%202002%20%28Europe%29.zip","filesize":6783568051,"score":7,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>The NBA Live series' second attempt on the PS2 brings the following updates:</p><p>Yes he has been in it since Live 2000, but this is first game to have Jordan with his new team, the Washington Wizards.</p><p>Cut scenes evolve the focus on player vs player interaction during stops in play and arguments between player and referee.</p><p>An improved interface allowing you to get into the games quicker, and an improved control system for better defensive and offensive moves.</p><p>New player moves, plays and celebration animations.</p><p>The Franchise Mode lets you control your team for 10 years, trading players and keeping an eye on rookies.</p><p>Legendary players list so you can see who really is the greatest.</p>"},{"name":"NBA Live 2003","year":2002,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Live%202003%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6328225936,"score":8.1,"genres":"Simulation > Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>The 2003 version of the NBA simulator has improved graphics in relation to the previous installments and features like detailed faces and a player design engine. It also has rosters in accordance to the 2002-2003 Season.</p><p>The game features more than 30 new rebound animations worked out by motion capture sessions, different passing styles and blocks and a frame rate of 60 frames per second.</p><p>As usual, a complete fantasy draft is included and multiplayer support is present.</p>"},{"name":"NBA Live 2004","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Live%202004%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5916650357,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>It's another season of the NBA, and with it comes another edition of NBA Live.</p><p>For 2004, the player can expect an expanded EA Sports Freestyle control scheme, allowing the player to pull off plays by simply using the right analog stick in collaboration with the player's  movement with the left analog stick. Dynasty mode has also been upgraded, with the opportunity of expanding the player's squad with the top free agents and rookies from the college leagues.</p><p>Up to 4 players can play on the Xbox, while PlayStation 2 players can go online with full stat tracking.</p>"},{"name":"NBA Live 2005","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Live%202005%20%28Europe%29%20%28En%2CDe%2CIt%29.zip","filesize":6171095342,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Basketball > Licensed","desc":"<p>The 2005 edition of the NBA Live Basketball series has a new graphics engine, and adds new moves and signature moves to personalize the players. Another feature is Freestyle Air, with more control of players in the air, and the option to specify 10 different freestyle configurations. You can build your team over multiple seasons, and additional management in the Dynasty Mode is introduced through rookie scouting, along with a calendar to mark all the important dates. Management is based on dynasty points. By progressing, you earn points that can be spent on training sessions, new equipment, or to send out scouts all over the world.</p><p>Different multiplayer options are offered, and events include a NBA all-star weekend with a Slam Dunk contest, a Rookie/Sophomore game and a 3-Point shootout, next to the regular game modes. You can also go freestyle anywhere in North America. The game has become quicker than the 2004 version, and the game strategies have been balanced by creating more emphasis on the mid-range jumper.</p>"},{"name":"NBA Starting Five","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"microsoft_xbox_n_part1/NBA%20Starting%20Five%20%28USA%29.zip","filesize":6262406384,"score":"","genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p><em>NBA Starting Five</em> is an NBA-licensed basketball game, and a follow-up to Konami's earlier NBA 2Night games.</p><p>Included players and teams are based on the 2002-2003 season. Game modes include Exhibition, Quick Start for a random match-up, Season, Playoffs and Franchise (up to 25 seasons in length). Franchise mode features the rookie draft between seasons, as well as signing, trading and releasing players. The signing is based on a point system, with 1000 points available to spend for the entire team.</p><p>Multiplayer options allow control of the entire team or individual athletes for competitive or cooperative play, with up to 4 players supported on Xbox and up to 8 on PS2 via multitap.</p>"},{"name":"NBA Street V3","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Street%20V3%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%29.zip","filesize":6414917751,"score":8.7,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Basketball > Licensed","desc":"<p>Bring your game to the street in EA's third installment of the NBA Street franchise. NBA Street V3 includes a new trick stick control mechanic, in-depth single-player career mode, improved gameplay mechanics and online play. Watch today’s biggest NBA stars go head to head in 3-on-3 match-ups against the legends of yesterday. Create your own character using the Create Baller feature and play in familiar venues such as The Cage and Rucker Park or create your own using the Court Creator.</p><p>The main game modes include quick matches (Play Now), Street Challenge (the career mode), and Dunk Contest where you can win over the judges by performing gravity defying dunks combined with impossible mid-air tricks. The career mode adds new goals in this version, based on scoring only with 3-point baskets, dunks, or gamebreakers. You can build up your gamebreaker by performing a complicated series of jukes, passes, or dunks. DJ Bobbito provides the commentary along with a mix of new and old school hip-hop.</p>"},{"name":"NBA Street Vol. 2","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NBA%20Street%20Vol.%202%20%28Europe%29.zip","filesize":6328174841,"score":8.4,"genres":"Sports > Diagonal-down > Direct control > Basketball > Licensed","desc":"<p>Return to the street for the unqiue basketball experience that allows you to show off to the crowd, wear crazy gear, and pull of crazy shots, passes and moves.</p><p>Modes include Street School (a tutorial that allows you to learn all the basic and more complex moves of the game), Pick Up Game (exhibition mode, in which you can win points to unlock rewards), NBA Challenge has you competing against the current crop of talent from the NBA, as well as collection of legendary players from the past, and Be a Legend give you the opportunity to create your own original basketball player and take him on a tour to compete against the world's best, unlocking new moves, clothes and other surprises.</p>"},{"name":"NCAA College Basketball 2K3","year":2002,"developer":"Kush Games, Inc.","url":"microsoft_xbox_n_part1/NCAA%20College%20Basketball%202K3%20%28USA%29.zip","filesize":5779496961,"score":7.9,"genres":"Sports > Diagonal-down > 2D scrolling > Basketball > Licensed","desc":"<p>Play as one of over 300 college hoops teams in this first college outing for the 2k lineup.  Take control of a full coaching career from inception at a small time college working your way up to a major powerhouse performer.  You can also play a skirmish with a friend, go out for a two-on-two game, or one of many other play modes you would expect in a competitive basketball game.  Just don't play it like the NBA... the college game has a different, more team-oriented feel, and this comes through in the gameplay.</p>"},{"name":"NCAA College Football 2K3","year":2002,"developer":"Avalanche Software LLC","url":"microsoft_xbox_n_part1/NCAA%20College%20Football%202K3%20%28USA%29.zip","filesize":6113448424,"score":7.1,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>This is Sega Sports' collegiate football sim including brand-new player models, completely redesigned stadiums, all 25 official Bowl Championship Series (BCS) bowls, and a revamped Legacy mode in which gamers can recruit high-school stars and compare lifetime records against other collegiate programs in the historical rankings system. Using the game's Legacy mode, you will be able to follow the entire career of a college player from freshman year to entering the NFL draft.</p>"},{"name":"NCAA Football 06","year":2005,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NCAA%20Football%2006%20%28USA%29.zip","filesize":6473852113,"score":8.5,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Multiple units/characters control > Football (American) > Licensed","desc":"<p>EA Sports 2005 edition of its college football franchise comes with some great new features and its new impact stick technology.  As usual you can play a quick game or choose a dynasty, but it also includes the new Race for the Heisman mode as you start out as a Freshman, moving your way up through the college ranks, winning the big games and becoming a legend by winning the most covenant prize in college football, the Heisman Trophy.  You can also play mini-games skills such as the Pass Skeleton, Oklahoma Drill, Option Attack and Rushing Attack and now with in studio commentary with Brad Nessler, Kirk Herbstreit and Lee Corso's famous mascot predictions just before kickoff.  It has much improved graphics and an improvement over previous versions.</p>"},{"name":"NCAA Football 07","year":2006,"developer":"Team Fusion","url":"microsoft_xbox_n_part1/NCAA%20Football%2007%20%28USA%29.zip","filesize":6607719030,"score":8.1,"genres":"Sports > Diagonal-down > Football (American) > Licensed","desc":"<p>Another update of EA's perennial NCAA collegiate football franchise, this edition features updated rosters and stats. It also has new features such as a momentum meter, the more players either in favor or against a team, the more the meter will light up or darken, affecting the teams morale and success of plays. It also has a new kicking meter along with spring drills, letting players update their stats along with a new Spring Game where players can scout out their new players in exhibition games.</p><p>Aside from the PSP version, Campus Legend is also a novelty - an update of the Race for the Heisman mode of the previous edition and it is quite similar to the NFL Superstar mode from the Madden franchise. A new player starts at football camp, practises and is eventually awarded a scholarship to play in a division. Rather than a single drill, it is now a series of four. Where in the previous version players could choose a scholarship, the game now offers a selection from the available schools based on the performances. Once enrolled, players choose a major, follow progress reports, read headlines in the school newspaper and have a dorm room where fan mail arrives. The player's girlfriend, shown as a photo of the wall, becomes more beautiful based on the success in the games. Days consist of attending classes, practice, studying, meeting tutors, drills or social activities. These can also boost popularity and overall success. Characters can be uploaded to Madden 07 where it can determine their draft position. The game is also aligned with ESPN, updating with real news from ESPN Radio and ESPN.com. It features the voice talents of Lee Corso, Brad Nessler and Kirk Herbstreit.</p><p>The 360 version lacks the Spring Drills and Campus Legend modes. Instead it has improved graphics and a series of mini-games.</p>"},{"name":"NCAA Football 08","year":2007,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NCAA%20Football%2008%20%28USA%29.zip","filesize":6592697334,"score":7.9,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>An update to EA's NCAA college football franchise with updated rosters and stats. It has new features such as the ability to boost skill performance and increase overall ratings by making user-controlled plays that elevate the team's motivation levels. As a coach, you can make promises to recruits to gain commitments and depending on whether or not you keep those promises, your coaching integrity rating will rise or fall causing players to transfer. The game has many college specific features such as home field advantage, composure ratings, an all-new fatigue system, and new trick plays like the Statue of Liberty and Hook and Ladder. You can revisit your top accomplishments in My Shrine, your personal Hall of Fame that stores trophies, custom photos, and video highlights. There is a Campus Legend Mode where you can develop a player from a star high school player to a backup college player.</p>"},{"name":"NCAA Football 2003","year":2002,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NCAA%20Football%202003%20%28USA%29.zip","filesize":6662260666,"score":8.3,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>NCAA Football 2003 is EA's followup to NCAA Football 2002. New features in NCAA Football for the 2003 season include over 200 licensed fight songs, 3D cheerleaders and 144 different schools.</p><p>Dynasty mode has been enhanced with the ability to redshirt a player and schedule your non-conference games before each season. In Dynasty Mode you can win all the real trophies to add to your own personal collection which you can show off later. These awards include the Heisman, Coach of the Year and Bowl-specific trophies. You can also win special trophies for winning certain rivalry games, which is another new play mode in 2003. There are 23 different \"Rivalry\" trophies for you to earn to go alongside your Dynasty trophies. </p><p>Create-A-School mode makes it into this edition, letting you create your own football team. Everything from the logos on the field to your school's fight song can be customized. Your created team can be played in Exhibition play or imported into Dynasty mode.</p><p>The last notable feature new to NCAA Football 2003 is the customizable interface. You choose your favorite team and the game interface will be based around your team's fight song, mascot, logos and school colors.</p>"},{"name":"NCAA Football 2004","year":2003,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NCAA%20Football%202004%20%28USA%29.zip","filesize":6590827534,"score":8.8,"genres":"Sports > Managerial / business simulation > Football (American) > Licensed","desc":"<p>NCAA Football 2004 is another entry in EA Sports' NCAA Football series.  This edition features the return of gameplay modes seen in previous versions such as Dynasty Mode, but also has some new additions.  The College Classics mode allows you to replay classic games in college football history.  Some smaller gameplay changes have been made too.  The game has new tackling animations and more realistic zone defense.</p>"},{"name":"NCAA Football 2005","year":2004,"developer":"EA Tiburon","url":"microsoft_xbox_n_part1/NCAA%20Football%202005%20%28USA%29.zip","filesize":6564526402,"score":8.4,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Multiple units/characters control > Football (American) > Licensed","desc":"<p>NCAA Football 2005 is the latest in EA's counterpart series to Madden.  Once again you are given the charge of earning a national championship for your college program.  Once players graduate, you can export the draft class for later use in Madden 2005.  Play online on Xbox and PS2 to challenge gamers around the world.</p>"},{"name":"NCAA Football 2005 / Top Spin","year":2004,"developer":"","url":"microsoft_xbox_n_part1/NCAA%20Football%202005%20%2B%20Top%20Spin%20%28USA%29%20%28En%2CFr%2CDe%29.zip","filesize":6283885438,"score":"","genres":"Compilation","desc":"<p>This compilation includes:</p><ul><li>NCAA Football 2005</li><li>Top Spin</li></ul>"},{"name":"NCAA March Madness 06","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NCAA%20March%20Madness%2006%20%28USA%29.zip","filesize":6406873434,"score":7.5,"genres":"Sports > 3rd-person (Other) > Side view > Top-down > Basketball","desc":"<p>Electronic Art's NCAA Basketball franchise returns with new and improved features for the 2005 season. The new lockdown stick allows you to force opponent's to make easier turnovers and make smoother passes to teammates.  You can have your senior captain  get your team into the game and get your crowd fired up to rattle your rivals into mistakes.  With an much more updated dynasty mode you can now recruit Junior College players with updated stats to keep you ahead of your rivals and relive some of the greatest moments with College Classics and play up to 20 great games, repeating history or completely changing it.</p>"},{"name":"NCAA March Madness 2004","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NCAA%20March%20Madness%202004%20%28USA%29.zip","filesize":5964394774,"score":7.6,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Electronic Arts' college basketball series returns for another year on the PlayStation 2 and makes its debut on the Xbox with <em>NCAA March Madness 2004</em>.</p><p>The number of included teams has been doubled to over 320 from the predecessor and several authentic arenas have been added. All the previous year's game modes return, including single games, tournaments, season and dynasty. Newly added are the mascot game, in which the teams consist of players in their schools' mascot outfits. A rivalry mode allows a quick set-up of a game pitching classic rival teams against each other. The dynasty mode has added Campus Challenges: by completing these challenges in dynasty games, players earn points that can be used to improve players' stats. Exclusive to the PS2 version is the introduction of online multiplayer, featuring single games and tournaments.</p><p>Some of the gameplay changes on the court were previously seen in NBA Live 2004: these include the separation of the buttons for dunks and shots and the introduction of the pro hop button, which allows for context-sensitive special offensive moves.</p>"},{"name":"NCAA March Madness 2005","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/NCAA%20March%20Madness%202005%20%28USA%29.zip","filesize":6529490495,"score":7.3,"genres":"Sports > 3rd-person (Other) > Basketball > Licensed","desc":"<p>Electronic Art's 2004 incarnation of the NCAA Basketball franchise comes with some brand new features. With a sophisticated play calling system you can call your plays with still moving the ball down the court to get your team mates in contention. The dynasty mode goes up to 30 years with a recruiting system that keeps up to date of your prospects while keeping your other players in line just in case they decide to stray from their studies or worse. You can play one on one against the computer or against a buddy, playing in custom tournaments, rivalry games or even play as your favorite teams mascots. It also features the all-new Pontiac College Classics, allowing you to recreate classic games from the past or even rewrite history. The game also features the voices of Brad Nessler and the legendary Dick Vitale.</p>"},{"name":"Need for Speed: Carbon","year":2006,"developer":"Electronic Arts Black Box","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Carbon%20%28Europe%29.zip","filesize":6200879494,"score":7.2,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>The 2006 game in the <em>Need for Speed</em> series is an evolution of the gameplay introduced in the previous games. The career mode offers complete freedom in a city with a story mode supported by FMV cutscenes, as featured in Need for Speed: Most Wanted, but now also set in the Carbon Canyon, where racers duel for territory in the city below. There still are many police pursuits. At the same time, the focus on tuning and sculpting your car remains, as introduced in Need for Speed Underground. As you win money from races, you can visit garages and car lots to make improvements to your vehicle.</p><p>Enhancements are still unlocked gradually, but the cars have now been divided over different tiers. There are about 40 cars to unlock. Many of them have been featured in previous installments, but there is a new selection and this year's edition introduces powerful muscle cars such as the Ford Mustang and Dodge Charger. Other features include the possibility to form your own crew, more detailed sculpting features, drifting races (introduced in <em>NFS:U</em> and replaced by drag races in <em>NFS:MW</em>) and the new car classes. The PC, PS3 and Xbox 360 versions offer online multiplayer, missing from the PS2, GC and Xbox releases. Up to eight players can race together, in the Pursuit Tag or Pursuit Knockout modes, with a few variations. Pursuit Tag is a race of one civilian car against cop cars. To become the civilian car, you have to tag it and then try to fend off the cops as long as possible until you are tagged again by other players. In Pursuit Knockout everyone starts as a civilian car, but the last one at the end of the first lap becomes a cop and needs to cause as much damage as possible to the other speeders. Another mode allows you to drive cooperatively (up to four players) in a single race.</p><p>The city and the surroundings in the career mode have been divided into different territories, controlled by gangs. You are either invited or challenged to race in the sections and claim them as your own. To do so, you have to impress the gang leader by winning races until he challenges you for a duel - first in the city, then over the narrow roads of Carbon Canyon. Scores are based on proximity. You need to follow the boss in the first race, and he is in pursuit in the second one. There are 4 boss duels in total.</p><p>The crew feature, with room for up to 6 cars, allows you to assign three roles to racers: drafters, scouts and blockers. These are supporting characters you can hire to help you win races. Drafters leave behind a coloured trail that makes it easier to find the way, scouts discover hidden shortcuts, and blockers try to cause mayhem to slow your opponents down. If you hire a scout, you get access to the new AutoSculpt feature. It enables you to modify the height of every part of your car through sliders, solely for visual effect. You can also buy full body kits.</p>"},{"name":"Need for Speed: Hot Pursuit 2","year":2002,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Hot%20Pursuit%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6548520883,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>Dream Machines Getaway Speeds<br>All-Out Police Pursuit<br>Stunning Supercars<br>Online Multiplayer Competition<br>Be the Cop<br>Open-Road Thrills<br>* Own the road in the world's most elite exotics - Ferrari, Lamborghini, Porsche, McLaren and more<br>* Intense police pursuit with full squads of cruisers, choppers, and road blocks.<br>* Immense, richly-detailed open-road courses.<br>* Choose your own reward path: Unique unlock system for cars, tracks, and more!<br>* Hot EA GAMES Trax including Bush, Uncle Kracker, Rush, Course of Nature, and Hot Action Cop.</p>"},{"name":"Need for Speed: Most Wanted","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Most%20Wanted%20%28Europe%29%20%28En%2CNl%2CSv%29.zip","filesize":5994833050,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing > Vehicle simulator","desc":"<p><em>Need for Speed: Most Wanted</em> is in fact a cross between the Underground and the Hot Pursuit spin-offs. The player must gain notoriety by racing in the streets and attracting the attention of the cops in order to ascend in the Black List of illegal racers. In the end he must face no.1, Razor who tricked him out of his own car and used it to get to the top.</p><p>Many racing modes are carried on from NFSU2 with the addition of \"Milestones\", special events where the driver must evade capture and/or disable police cars by bringing down Pursuit Breakers, specially marked buildings such as gas stations and water towers. For each one of the 15 Blacklisted opponents, the player must win a specific number of events from each of the two main types and gain enough notoriety in the process. The player can invest bet money to buy new cars or improve his existing one's looks and performance so that he remains competitive.</p><p>In <em>Most Wanted</em>, Josie Maran replaces Brooke Burke as the racer girl. The plot is furthered through use of FMV video with live actors and digital sets, which has been heavily enhanced so that it looks quite real.</p>"},{"name":"Need for Speed: Most Wanted (Black Edition)","year":2005,"developer":"","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Most%20Wanted%20-%20Black%20Edition%20%28USA%29.zip","filesize":6001765275,"score":7.4,"genres":"Special edition > Digital extras > Extra content / game > Physical extras","desc":"<p>This is a special edition of Need for Speed: Most Wanted that celebrates the 10th anniversary of the Need for Speed series.</p><p>This edition includes:</p><ul><li>Need for Speed: Most Wanted</li><li>2 exclusive vehicles: a '67 Camaro, the only American classic in Need for Speed Most Wanted, and a specially-tuned BMW M3 GTR street machine right out of the box in Online (Xbox only) and Quick Race modes.</li><li>8 custom rides - Eight specially-tuned rides with hand-selected body kits, spoilers, rims, roof scoops, and more are unlocked and available in Online (Xbox only) and Quick Race modes. Featured cars: Supra, Lotus Elise, Porsche 911 GT2, Mercedes-Benz SL65 AMG, Corvette C6, Mercedes-Benz SL 500, Porsche 911 Carrera S, and Corvette C6.R.</li><li>Exclusive Pursuit Challenge that features waves of supercharged SUV cops and the most aggressive police tactics.</li><li>3 exclusive races, unlocked and available to drive right from the start.</li><li>Exclusive and unlocked vinyls</li><li>Bonus DVD with vehicle showcases, an exclusive car art gallery, ten Need for Speed Most Wanted movies, a behind-the-scenes look at the creation of the in-game cinematics with Josie Maran</li></ul>"},{"name":"Need for Speed: Underground","year":2003,"developer":"Electronic Arts Black Box","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Underground%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6345897604,"score":7.6,"genres":"Racing / Driving > 1st-person > Behind view > Real-time > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p><em>Need For Speed: Underground</em> is the seventh game in the long running <em>Need For Speed</em> racing series. </p><p>The game revolves around illegal night time street racing with heavily modified import cars and has been greatly influenced by the movie <em>the Fast And The Furious</em> and its sequel. Players get the chance to build their own racing machine almost from the ground up, with hundreds of real licensed parts and lots of licensed cars, including the Mazda RX-7 and the Nissan Skyline GT-R. The game also features over 100 single player races and a hip hop/hard rock soundtrack including artists such as Mystikal, Rob Zombie, and the Crystal Method.</p>"},{"name":"Need for Speed: Underground 2","year":2004,"developer":"Electronic Arts Black Box","url":"microsoft_xbox_n_part1/Need%20for%20Speed%20-%20Underground%202%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%2CNl%2CSv%29.zip","filesize":6155886478,"score":7.7,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Direct control > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>This installment in the Need for Speed series, Underground 2 is a racing game based on illicit, night time races, with the player gaining street credit, cash and access to unique tuner parts by schooling the competition.</p><p>Taking place in a massive, open city, NFS Underground 2 allows players to explore the city at will, engaging random challengers and moving into the coveted Underground Racing League. Once in the Underground Racing League, the player advances first by race wins, then with building up their tuner car and taking on tougher opponents. The objective is to win all Underground Racing League engagements and trick out your car to the max.</p><p>The PC version is the only version that allows the user to save magazine screen shots of your tricked out car to disk.</p>"},{"name":"Neighbors from Hell","year":2005,"developer":"JoWood Vienna","url":"microsoft_xbox_n_part2/Neighbours%20from%20Hell%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6774234982,"score":6.2,"genres":"Puzzle > Side view > 2D scrolling > Real-time > Stealth > Contemporary > Comedy","desc":"<p>The GameCube and Xbox versions of <em>Neighbors from Hell</em> are unique releases which include episodes from the Windows versions of both Neighbors from Hell and Neighbors from Hell: On Vacation, with some of the first game's episodes being edited to feature Mr. Rottweiler's mother. There are also unique intro and ending cutscenes.</p>"},{"name":"New Legends","year":2002,"developer":"Infinite Machine, Inc.","url":"microsoft_xbox_n_part2/New%20Legends%20%28Europe%2C%20Australia%29.zip","filesize":5759570460,"score":6.2,"genres":"Action > 3rd-person (Other) > Fighting > Sci-fi / futuristic","desc":"<p>You are Sun Soo, a young noble fighting to free the Soo Kingdom and the rest of China from the tyranny of the evil Xao Gon. You beat up bad guys with melee weapon combos and guns. The artwork is a mixture of Chinese historical and gritty high-tech. Some locations are based upon scenic places in China.</p>"},{"name":"NFL 2K2","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part2/NFL%202K2%20%28USA%29.zip","filesize":5595259625,"score":8.2,"genres":"Sports > Diagonal-down > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>NFL 2K2 is a complete football simulation, giving you a variety of ways to play.  You can compete in a single exhibition game, start up a franchise, or move directly to the playoffs.</p><p>NFL 2K2 uses a TV-style presentation, featuring telestration, action replays, sideline animations, stadium lighting and a director feature that zooms in on the play.</p><p>Included in NFL 2K2 are all the teams and plays from the 2001-2002 season, including stadiums and uniforms.</p><p>You have the option to choose a team and select your own roster, or you can create your own team and take them through a franchise.</p>"},{"name":"NFL 2K3","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_n_part2/NFL%202K3%20%28USA%29.zip","filesize":6384853412,"score":8.6,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Multiple units/characters control > Football (American) > Licensed","desc":"<p>Sega brings another season of its football game in NFL 2K3.  With new lifelike player animations, new play-calling intelligence, an on-the-fly audible system, and a brand new ESPN broadcast system with the famous overlays, scores, and highlights, it adds a whole new feel to the series. In these days of free agency when championships are won or lost in the front office as well as down on the field, NFL 2K3’s new Franchise mode gives you total team control as player, coach, and general manager -- track the best players, make the smartest trades, and build the most dominant team in the league. It is complete with all of the updated rosters, NFL alignment changes, and authentic stadiums redesigned in full 3D for the 2002 season.  Also new to the series is online play.</p>"},{"name":"NFL Blitz 2002","year":2002,"developer":"Midway Games, Inc.","url":"microsoft_xbox_n_part2/NFL%20Blitz%202002%20%28USA%29.zip","filesize":6474046003,"score":7.4,"genres":"Sports > 3rd-person (Other) > Top-down > Arcade > Football (American) > Licensed","desc":"<p>The <em>NFL Blitz 20-02</em> incarnation promises deeper gameplay, more animations, better AI, more mini-games, and even harder hits. Still focusing on its roots of hard-hitting football action with no rules whatsoever, the game hopes to hit the consoles as hard as its players hit each other.</p>"},{"name":"NFL Blitz 2003","year":2002,"developer":"Point of View, Inc.","url":"microsoft_xbox_n_part2/NFL%20Blitz%202003%20%28USA%29.zip","filesize":6552311413,"score":7.7,"genres":"Sports > 3rd-person (Other) > Direct control > Football (American) > Licensed","desc":"<p>This latest update to the NFL Blitz series offers more options and refines the options presented earlier in the series.  Of significant note is the create a player option.  By desiging the look of the player as well as assigning various stats to their abilities, you can craft a whole team to compete in the league.  Also improved is the artificial intelligence in the one-player game setting.  Fantasy Stadiums in exotic locales and Fantasy Players are another new option.  Updated rosters, schedules, uniforms, and stadiums including the addition of the Houston Texans.</p>"},{"name":"NFL Blitz Pro","year":2003,"developer":"Midway Home Entertainment, Inc.","url":"microsoft_xbox_n_part2/NFL%20Blitz%20Pro%20%28USA%29.zip","filesize":6423705660,"score":"","genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NFL Blitz Pro</em> is the 2003 entry in Midway's arcade football series. Like NHL Hitz Pro however, this entry moves away from its arcade roots toward more of a simulation style, while still retaining some arcade flavor in that there are no penalties or injuries and players can \"catch on fire\". The main changes to the predecessors are full 11-on-11 teams, standard 10 yard downs and more support for running plays.</p><p>Game modes include Quick Play and Exhibition, a full Season, a 10-season Franchise and 4- or 8-player tournaments. There also is a create-a-player feature. While there are no hot routes and audibles are limited to a pre-determined set of four, the Impact Player feature allows control of one specific player who can make last-minute adjustments. Only the PlayStation 2 version includes an online mode for multiplayer games and roster updates.</p><p>The game has many special features unlockable through the Blitz Shop. Credits for the shop are earned by performing feats in non-franchise games. Available for purchase are fantasy teams and stadiums, and new game modes: in Butterfingaz mode, every hit leads to a fumble, while Cyberleague features robot teams and an exploding ball. Also available is the customary Big Head mode, among several others. Old-school Blitz series arcade gameplay is available in Blitz Classic mode.</p>"},{"name":"NFL Fever 2002","year":2001,"developer":"Microsoft Corporation","url":"microsoft_xbox_n_part2/NFL%20Fever%202002%20%28USA%29.zip","filesize":5615717948,"score":7.6,"genres":"Sports > 3rd-person (Other) > Football (American)","desc":"<p>NFL Fever 2002 is Microsoft's first foray into console football gaming.  Fever '02 includes every NFL team and stadium, each accurately detailed and represented.  It also makes full use of the X-Box's power.  Volumetric grass, accurate reflections, clothes that get dirty over the course of the game, snow that leaves footprints, then gradually turns to grass as you stomp on it, then gets covered again.</p><p>Fever offers many game modes, including Season and Dynasty.  In Dynasty mode, you guide one or more teams through multiple seasons, managing every aspect of your team.  Rosters, positions, build the dream team that everyone fears.</p>"},{"name":"NFL Fever 2003","year":2002,"developer":"Microsoft Game Studios","url":"microsoft_xbox_n_part2/NFL%20Fever%202003%20%28USA%29%20%28Rev%201%29.zip","filesize":5603694669,"score":"","genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p><em>NFL Fever 2003</em> is the second entry in Microsoft's in-house football series for the Xbox.</p><p>The included teams and players have been updated for the 2002 NFL season, with the newly formed eight divisions and the expansion team Houston Texans included. All the predecessor's game modes return, which include Practice, Single Games and Season. Practice mode has added tactical tutorials called Chalk Talks. Season mode again includes the 25-season dynasty mode, and replaces last year's Fantasy Challenge with the Classic Challenge, a ladder tournament against classic NFL teams. A new addition to dynasty mode is the Super Bowl challenge - when winning the Super Bowl, the dynasty team is challenged by a previous champion. Defeating champions in the Super Bowl or Classic Challenge unlocks classic players and teams for use.</p><p>New options are Xbox Live support for online multiplayer and downloadable roster updates. Local multiplayer via System Link is also supported. New customization options include a play editor for custom plays and playbooks as well as as uniform and stadium editors.</p>"},{"name":"NFL Fever 2004","year":2003,"developer":"Microsoft Game Studios","url":"microsoft_xbox_n_part2/NFL%20Fever%202004%20%28USA%29.zip","filesize":5923287653,"score":7.2,"genres":"Sports > 3rd-person (Other) > Football (American) > Licensed","desc":"<p>Microsoft's own football game returns with updated Graphics and Roosters. There are now even more tackles, and avoiding moves to be learned. Play on any Nfl stadium possible, while the power of xbox giving you your own music, and real-to-real football penalties, players, fields, clothes, and the crowd cheering you on. Customize your own coverage, how you want.</p><p>Play 1-4 players in a game, or 1-8 system link. Play Xbox live with a friend with, multiplayer, voice, friends, scoreboard</p>"},{"name":"NFL Head Coach","year":2006,"developer":"EA Tiburon","url":"microsoft_xbox_n_part2/NFL%20Head%20Coach%20%28USA%29.zip","filesize":6681186478,"score":6.4,"genres":"Simulation > Sports > Strategy > 3rd-person (Other) > Managerial / business simulation > Football (American) > Licensed","desc":"<p>Taking a detour from its traditional football games, Electronic Art presents its first 3-D NFL strategy game, <em>NFL Head Coach</em>, focusing more on a coaching perspective than a player's perspective. You experience the day to day job as a NFL coach, recruiting big players, meeting with assistant coaches and running practice drills.</p><p>Become a legend in the coaching industry by creating pro bowl caliber players, winning Super Bowls and mentoring coordinators into great coaches themselves in hopes of earning a spot in the Hall of Legends. You can also use the USB Headset to call plays like a real coach, giving you a much more realistic feel to the game as well. It gives you an idea of how tedious a head coaches job can really be.</p>"},{"name":"NFL Street","year":2004,"developer":"EA Tiburon","url":"microsoft_xbox_n_part2/NFL%20Street%20%28Europe%29.zip","filesize":6536251055,"score":7.9,"genres":"Action > Sports > Diagonal-down > 2D scrolling > Tricks / stunts > Football (American) > Licensed","desc":"<p><em>NFL Street</em> is an arcade style football game that is based on pick up football. <em>NFL Street</em> is 7 on 7 with players playing both offense and defense. There are no helmets or stadiums in <em>NFL Street</em>, instead the games are played in parks, on the street and in the dirt lots.</p><p>In <em>NFL Street</em>, the player should strive not just to win but to look good doing it. The player can achieve this by performing style moves during a play. These might be a taunting run, a spectacular spin, or a crazy pass.</p><p><em>NFL Street</em> has Quick Game, Pickup Game, NFL Challenge and Online game modes.</p>"},{"name":"NFL Street 2","year":2004,"developer":"EA Tiburon","url":"microsoft_xbox_n_part2/NFL%20Street%202%20%28Europe%29.zip","filesize":6223227292,"score":7.6,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Direct control > Football (American) > Licensed","desc":"<p><em>NFL Street 2</em> is the second game in EA's arcade football series. Players try to become the world's best urban footballer by conquering other teams using several gravity-defying tricks like up-the-wall passes, off-the-wall catches, and highlight-reel wall jukes.</p><p>Like the other games in the Street franchise, the game is played with a small amount of players and a focus on arcade gameplay. Unlike the first game, the walls can now be used for run-up passes and receptions, or bonuses by aiming for posters and hotspots.</p><p>There are twelve arenas to compete in (2 unlockable) and the players are licensed from the 2004 NFL rosters. Multiplayer is available on the PS2, PSP and Xbox versions. In singleplayer, there are various game modes such as NFL Challenge where the player has 150 days to build a team to take on a squad of legends. Progress is based on milestones where you sharpen specific skills to reach the top or beat sufficient teams. When five days are left, the team enters a final tournament.</p><p>Another one is the new Own the City mode, where the player create a new character and has to win all street games in the city. New players need to be recruited from pick-up games. The final team to beat consists of rapper Xzibit and a team of NFL stars. Characters created in this mode can be imported into the NFL Challenge, but also in Madden NFL 06.</p><p>The PSP version is a faithful port, with some of the cut scenes removed, and 3 new street modes added for Wi-Fi multiplayer: Street Slalom (an obstacle course), Style Point Challenge, and Style Standoff, a end zone dance contest, similar to Space Channel 5, next to the regular multiplayer modes. Up to four players can play on a single PSP in the Party Play game modes such as the 2 Minute Challenge and Jump Ball Challenge.</p>"},{"name":"NHL 06","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part2/NHL%2006%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.zip","filesize":6582151001,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>New rules and updated rosters and season schedules feature in this update of the longrunning <em>NHL</em> series, as do many new features.</p><p>Deking is now performed using the left analog stick, with swift signature moves of star players that confuse opponents and reward skill. The same stick is used to increase the accuracy when shooting. While preparing for a shot, a bull's-eye appears in the enemy goal and you can quickly move the target to the corners for precision. To add to the individual qualities, statistics such as speed and size are now reflected during gameplay in the players' momentum and turning radius. To get past opponents quickly, you can generate momentum for quick speed boosts.</p><p>With the introduction of R.P.M. (Realistic Puck Momentum) dynamics, there is more randomness with the puck, as a shot off the mask can now stun goalies. Another small addition is the deformation of the ice during the match. In the player creation mode, where you can now apply bruises, broken noses, black eyes and scars to your players, the thumbstick is used for \"face sculpting\" - changing the different features.</p><p>All the regular game modes are present, of which the Dynasty Mode from the previous version is the most complete, with scouting and full management options, inside and outside the arena. Contrary to the last game, you can now intervene during simulated AI games and win the match for your team.</p><p>The PC, PS2 and Xbox version support online multiplayer games, and as a special bonus, the original NHL 94 game, one of the first in the series, has been included with the PS2 edition.</p>"},{"name":"NHL 07","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part2/NHL%2007%20%28Europe%29%20%28En%2CFr%2CSv%2CFi%29.zip","filesize":6525785265,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>EA Sports' 2007 installment of their NHL Hockey franchise refreshes all of the existing NHL team rosters and schedules and adds the Czech Elite League teams to the European Elite League rosters.</p><p>Player modeling has been improved and features new life-like player specific moves and styles. Additional enhancements to the analog stick controls have also been made, making players easier than ever to control, while still mainting the realism of true hockey.</p><p>Other features returning from previous editions include GM Mode, single game and season play, Dynasty mode and online play.</p><p>The XBOX 360 Version now includes support the for Skill Stick controller for precision player control.</p>"},{"name":"NHL 2002","year":2001,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part2/NHL%202002%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6796476939,"score":8.1,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>NHL 2002 is EA's latest incarnation of their NHL series.</p><p>New features over previous years includes the \"Breakaway Cam\", which causes the game to slow down, turn blue, and go into letterbox mode when you're one on one with the goalie, and \"EA GameStory\", which tracks your progress and rewards you for outstanding performance.</p><p>NHL 2002 is the first in the series to include NHL Cards, which is the equiviliant of Madden's NFL Cards.  By performing special moves, such as scoring within the first 30 seconds or winning 10 face-offs, you get points, which you can then use to buy cards.</p><p>NHL 2002 includes all the professional NHL teams, as well as the International teams, such as Team Canada and U.S.A.  Every stadium is included, and so is every player.</p><p>NHL 2002 has many game modes, including Season, Quick Play, Shootout, and Exhibition.  It also has a \"Create-A-Skater\" mode.</p>"},{"name":"NHL 2003","year":2002,"developer":"Electronic Arts Canada","url":"microsoft_xbox_n_part2/NHL%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%2CCs%29.zip","filesize":6549502762,"score":7.8,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>This year's edition features many different modes of gameplay for the NHL enthusiast.  Players can start the game right away in play now mode, play an international game, play through a playoff series, or start a franchise. The franchise mode puts you in charge of a team for a 10-year legacy. You can either play every game during a season or simulate each game and take a manager role. After each season, you have the option to play around with the roster in anticipation of next season. You can draft new players, sign free agents, make trades with other teams, and retire old players. Statistics are kept throughout the life of a franchise in several categories.</p><p>Also new this year is the use of the right analog stick to execute manual dekes and slip the puck past the goalkeeper.</p>"},{"name":"NHL 2004","year":2003,"developer":"Electronic Arts Black Box","url":"microsoft_xbox_n_part2/NHL%202004%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.zip","filesize":6528545221,"score":8.1,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>The \"best selling pro hockey franchise\" is back with the 2004 edition, and it's loaded with more.</p><p>Like Madden NFL 2004, NHL 2004 has a deep career mode, titled Dynasty Mode. You take on the role of GM for up to twenty seasons. As GM, you'll have to negotiate contracts, conduct drafts, make trades, sign free agents, make sure your players are getting the training they need, and more. If you're good enough, you may make it into the GM Hall of Fame.</p><p>Besides Dynasty mode, you've got the basic game modes; Season, Exhibition, and Playoffs.</p><p>The control for NHL 2004 has been refined, allowing for more precise movement than in the previous games. Precise passes, shots, and accurate skating are accomplished by simply tapping the button.</p><p>NHL 2004 features a new fighting engine, allowing for more accurate and realistic fights. The right analog stick controls \"Bruise Control\", which lets you perform different moves by tilting the stick in different directions. Before you get into fights, you'll need to agitate a player, and this is where his Agitation Meter comes in. Losing the game, being checked, making sloppy passes all raises his Agitation Meter, until he is ready to burst and will fight at the slightest poke check.</p><p>NHL 2004 contains the EA Sports Bio, which is a feature found on all console versions of EA Sports game. Playing more EA Sports titles, playing them for a long time, and winning special accomplishments (such as your first shutout in NHL 2004 or your first number one finish in NASCAR Thunder 2004) will earn you a higher Gamer Level, and will reward you with bonuses, such as cheat codes and new stadiums. This feature isn't found on the PC version.</p><p>In addition to the standard roster of NHL teams, there are thirty nine international teams for you to choose from, such as Germany's DEL or Sweden's Elitserien, plus the usual U.S.A., Canada, and other regulars.</p><p>The PlayStation 2 and Windows versions of NHL 2004 support online play.</p>"},{"name":"NHL 2005","year":2004,"developer":"Electronic Arts Black Box","url":"microsoft_xbox_n_part2/NHL%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CSv%2CFi%29.zip","filesize":6532554287,"score":7.7,"genres":"Sports > Behind view > Diagonal-down > Side view > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>EA sports long running hockey franchise continues for the 2005 season. This year tweaks features from last year and adds some new enhancements to the game engine. </p><p>The graphics have been even more improved from last year. Now the 'cyber players' look so close to their real life counterparts that their hard to distinguish. Player models are updated with more life like skin, hair and features. This includes more facial animations and emotions. The coaches are also redone in this manner. The in-game meanwhile adds a whole slew of new animations, cutscenes, goalie animations and enhancements to the fighting engine.</p><p>In the control department, NHL 2005 adds a new feature called Open-Ice control. This feature lets you potentially control players without the puck, set up for picks, double team and more. Shooting wrist shots and slap shots are also now mapped to separate buttons for more flexibility.</p><p>The gameplay introduces a new feature as personalities for players. Such that a player like Tie Domi will play more like an enforcer, while Markus Naslund will rely more on finesse and skill. You will be relied on to balance this personalities on each line of a team to create chemistry. The dynasty mode has been redone with a new interface and tweaks. Free Agency and Trading has been tweaked along with the handling of a team. The new system allows you to keep up to date on weekly injuries/streaks reports, letters from your owner, players, etc. </p><p>This year adds new modes such as the World Cup tournament and  Free-for-All. In Free-For-All players compete 2 on 2 trying to score on the other while also defending. Along with the modes come minor tweaks, such as the options for no touch icing, delayed offsides and shootout options for tied games. The create a team feature remains in this year but create a player didn't make it in. Jim Hughson and Craig Simpson return with commentary.</p>"},{"name":"NHL 2K3","year":2002,"developer":"Treyarch Corporation","url":"microsoft_xbox_n_part2/NHL%202K3%20%28Europe%29.zip","filesize":6466689622,"score":8,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p><strong>NHL 2K3</strong> is the first hockey game on the XBox to support XBox Live.</p><p>Using it's partnership with the ESPN sports network, Sega has created NHL 2K3 using the same presentation method as ESPN. Natural camera transitions, cut scenes, and overlay graphics are all used in cooperation with ESPN to give the game a more realistic feel.</p><p>All the standard game modes are here, from exhibition games and playoff games, to a very in depth Franchise mode that gives you complete control over your team. You act as the general manager, coach, scout and player. You can negotiate contracts, make trades, and draft rookies.</p><p>On the ice, you have a lot of control over your team as well. You can anchor lines with key players, rotate your lines to always be matched up, and make sure you have the advantage every which way.</p><p>You can also play online via XBox System Link or XBox Live. The latter allows you to connect to a player from anywhere, and engage in a game of hockey. Using the headset, you can taunt or compliment your opponent, without any interruption to the game.</p><p>Rosters are from the 2002-2003 season.</p>"},{"name":"NHL 2K6","year":2005,"developer":"Kush Games, Inc.","url":"microsoft_xbox_n_part2/NHL%202K6%20%28USA%29.zip","filesize":6208149919,"score":7.9,"genres":"Sports > Diagonal-down > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Among the <em>2K6</em> edition's new features is the Crease Control, which allows you to take direct control of the goalie and slow everything down for a matter of seconds, giving you time to find where the puck is and prepare a save.</p><p><em>NHL 2K6</em> has a complete feature set, including Franchise Mode, Exhibition, ProControl, On-The-Fly Coaching, the Enforcer system, and, of course, multiplayer over Xbox Live.</p><p>Most of the rule changes adopted by the NHL following the lockout of the past season are incorporated into the game.</p><p>All your teams are here, from the Toronto Maple Leafs to the Boston Bruins to the Ottawa Senators and the Tampa Bay Lightning. There are also All-Star and Legend teams to play.</p>"},{"name":"NHL 2K7","year":2006,"developer":"Kush Games, Inc.","url":"microsoft_xbox_n_part2/NHL%202K7%20%28USA%2C%20Europe%29.zip","filesize":6196268219,"score":7.8,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Hockey > Licensed","desc":"<p>Updated to the 2007 NHL season, the <em>NHL 2K7</em> ice-hockey game also includes a few changes from NHL 2K6, including an improved camera that gives a better view of the action while still showing the field. This parametric camera is closer down than a typical top-down camera and includes automatic zooming and turning based on the players' position on the ice. Other improvements are the option to shadow opponents to put pressure on them and increase their chance of making a mistake. This is done by holding the left bumper and steering the right control stick towards another player. The amount of pressure can then be determined through taps, with hard tapping inevitably leading to a powerful check.</p><p>Aside from that, the game modes from the previous version are identical, as is most of the gameplay and the mini-games included. It has a new rivalry system where statistical bonuses and takeaways are created depending on how players play in games against their rival teams. The main improvements introduced to the Xbox 360 version of the game, such as the \"cinematic\" presentation system, are not carried over. This is most visible in the graphical area.</p>"},{"name":"NHL Hitz 2002","year":2001,"developer":"Black Box Games","url":"microsoft_xbox_n_part2/NHL%20Hitz%202002%20%28Europe%29.zip","filesize":6661649840,"score":7.9,"genres":"Sports > 3rd-person (Other) > Hockey > Licensed","desc":"<p>Midway introduces hockey with its no-rules twist that is seen in NFL Blitz.  Hockey may have fewer rules than football, but NHL Hitz features hard-hitting action and very simple 3-on-3 gameplay.  The game has franchise modes for a created team that you can design along with championship and exhibition modes.  You earn attribute points and credits that you can use to unlock items and improve your players along the way.  There are several mini-games and extras hidden deep in the game for you to unlock.  NHL Hitz is Midway's attempt at making the most action-packed hockey game to ever hit consoles.</p>"},{"name":"NHL Hitz 2003","year":2002,"developer":"Black Box Games","url":"microsoft_xbox_n_part2/NHL%20Hitz%202003%20%28Europe%29.zip","filesize":6486991589,"score":8,"genres":"Sports > Diagonal-down > 2D scrolling > Hockey > Licensed","desc":"<p>This game uses the same three-on-three style that debuted in Hitz 2002.  The 2003 installment has larger rinks, bigger crowds, a referee, and animated coaches.  All 30 NHL teams are represented with motion-capture animation, and you can build your own players with the Create-Player option. The game's Season mode now allows for trades, stat tracking, and player awards.</p><p>Up to four players can play each other in exhibition mode. Season mode puts you into a standard NHL schedule, but you can change to a shorter season if you want. There is also a small numer of hockey-related minigames, such as keep-away. Franchise mode is where you pick and name your team, name your players, and play against other teams to earn experience points. Those points can be used to upgrade your players in categories such as toughness, speed, passing, and agility. After beating all the lesser teams in a tier, you can move on to battle a \"boss team\" for that region. Beating that team nets you some new equipment for your players, which also improves their stats.</p>"},{"name":"NHL Hitz Pro","year":2003,"developer":"Next Level Games, Inc.","url":"microsoft_xbox_n_part2/NHL%20Hitz%20Pro%20%28Europe%29.zip","filesize":6519700847,"score":7.8,"genres":"Sports > 3rd-person (Other) > Top-down > Hockey > Licensed","desc":"<p>NHL Hitz Pro is Midway's 2003/2004 entry into the licensed hockey market. For the 2004 sports season, Midway introduced a directive to move their sports titles away from over-the-top arcade-style gameplay, and introduce a more sim-like approach to sports. For NHL Hitz Pro, this meant moving away from 3-on-3 hockey to 5-on-5 hockey gameplay to make the game more authentic for the demands of the sim hockey player. While NHL Hitz Pro still maintains many of the arcade-style elements that were a signature feature of the Hitz series such as checks over the boards and hits through glass, the gameplay has been tuned to provide an experience that is accurate to the sport of hockey. That being said, the player has extensive options for tuning the gameplay for either a fast-paced arcade experience, or a slower, more sim-like style of play.</p><p>As with competing titles, Hitz Pro supports a franchise mode, season and exhibition gameplay and a game tutorial/practice mode. The title also sports a pickup hockey mode with several environments that are reminiscent of playing hockey in outdoor venues.</p>"},{"name":"NHL Rivals 2004","year":2003,"developer":"Microsoft Game Studios","url":"microsoft_xbox_n_part2/NHL%20Rivals%202004%20%28Europe%29.zip","filesize":6098238724,"score":6.9,"genres":"Sports > Diagonal-down > 2D scrolling > Direct control > Hockey > Licensed","desc":"<p><em>NHL Rivals 2004</em> is the first NHL title for the Xbox, developed by MGS (Microsoft Game Studios), and the second title developed under the XSN Sports banner - the development team's first foray into hockey on console.</p><p>At the time of its release, the visuals in this game were its major selling point, with each player's face mapped onto their model ingame. The game features a fully animated polygonal crowd, tons of motion-captured animations, NHL licensed players, teams and arenas. The look and feel of the game are much different than games like EA's NHL series.</p><p>This was also the first hockey game on Xbox that let players play in online tournaments and leagues over Xbox Live and XSN Sports. Rosters were updated as the season went on via content downloads over Xbox Live, though were only available for a limited time.</p><p>Rivals 2004 features the gameplay mode of 3-on-3 pond hockey. This pickup-game style of play is meant for those who prefer instant action, and it can also be played over Xbox Live. Players can connect and join in on a recreational game intended to simulate the fun pickup games that many people played as kids.</p><p>The gameplay is arcade-like, with fast play and quick passing via a button or in specific directions using the analog stick.</p>"},{"name":"Nickelodeon Party Blast","year":2002,"developer":"Data Design Interactive Ltd","url":"microsoft_xbox_n_part2/Nickelodeon%20Party%20Blast%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6038361135,"score":"","genres":"Action > Racing / Driving > Sports > Diagonal-down > 2D scrolling > Fixed / flip-screen > Party game > Basketball > Fantasy > Licensed","desc":"<p><em>Nickelodeon Party Blast</em> is a party game for up to four players with Nicktoons characters from Nickelodeon. Game modes are Blast, Replay, Cup Challenge and Party Play (multiplayer only). There are several game modes where characters need to complete stages through different events. The eight playable characters are Angelica, Invader Zim, Spongebob, Eliza Thornberry, Otto Rocket, Reggie Rocket and Jimmy Neutron. They come from the series <em>Invader Zim</em>, <em>Jimmy Neutron</em>, <em>Rocket Power</em>, <em>Rugrats</em>, <em>SpongeBob SquarePants</em> and <em>Wild Thornberrys</em>.</p><p>A game generally consists of several types of stages based around a mini-game with a boss at the end. There is Food Fight where characters throw food at each other in a single-screen environment, there is a squirting game called Squirt and Splash, a basketball game mixed with skating elements, Pipe Challenge where pipes need to be put together to blast rockets, a racing game and so on. There are also bonus stages with different gameplay. Stars can be earned to unlock additional cups as series of stages.</p>"},{"name":"Nightcaster II: Equinox","year":2002,"developer":"Jaleco Entertainment, Inc.","url":"microsoft_xbox_n_part2/Night%20Caster%20II%20-%20Equinox%20%28Europe%29.zip","filesize":6655491742,"score":5.7,"genres":"Action > Diagonal-down > RPG elements > Fantasy","desc":"<p>The fight against darkness continues in this sequel to Nightcaster: Defeat the Darkness. Defeat the new minions of the executor of evil with magical spells and melee combat, as either Madelyn or her husband Arran (the hero of Night Caster I). The game controls allow the player to control movement in one direction while spells are aimed in another. Magic spells are defined in four different schools - Fire, Water, Dark, and Light. Interactive game music changes to match the events in the game world as they unfold. Supports cooperative play for 2 players.</p>"},{"name":"Nightcaster: Defeat the Darkness","year":2001,"developer":"VR1 Entertainment, Inc.","url":"microsoft_xbox_n_part2/Night%20Caster%20-%20Defeat%20the%20Darkness%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6774291765,"score":6,"genres":"Role-playing (RPG) > Behind view > Diagonal-down > Puzzle elements > Fantasy","desc":"<p><em>Nightcaster: Defeat the Darkness</em> is a third-person, single-player, action-adventure game featuring spell combat and exploration. Players take the role of Arran, a novice wizard whose magical power grows as he ages throughout his quest to collect spells and rid the world of eternal night.</p><p>Players can choose brute force or smart tactics. Each school of magic is effective against a different color of enemy, and different schools will have spells with different effects as they level up. The schools are made up of over 40 spells, either light, dark, fire, or water. Spells can either be summoned right in front of Arran, or, by dislodging the magic stone on his staff and guiding it around him with the right thumbstick, fired with precision in any direction. Many items can be found hidden in levels that will provide Arran with bonuses, like increased health or the ability to power up a spell, and these bonuses carry between levels.</p>"},{"name":"Ninja Gaiden","year":2004,"developer":"Team Ninja","url":"microsoft_xbox_n_part2/Ninja%20Gaiden%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5969107369,"score":8.7,"genres":"Action > 1st-person > 3rd-person (Other) > Diagonal-down > Cinematic camera > Hack and slash > Direct control > Japan (Ancient/Classical/Medieval) > Medieval > Martial arts > Regional differences","desc":"<p>When the Vigoor Empire attacks Ryu Hayabusa's village and steals the Dark Dragon Blade, the ninja vows to seek revenge with his Dragon Sword. Gifted with an impressive sets of moves, combining both melee and projectile weapons, you will need to defeat hordes of ninjas and monsters. During your journey, you acquire new moves and abilities such as the Art of the Inferno (fire), Ice Storm and Inazuma (thunder-like). Other moves include running over water, wall-based combos and ultimate techniques. You have to search or shop for special items, armlets, weapons and scrolls that enhance your abilities.</p><p>This fast-paced game is known for its hard difficulty (true to the series) and smart enemy AI that hardly relies on patterns. The Live! features allow for participating in the Master Ninja Tournament, a nationwide competition with prizes.</p>"},{"name":"Ninja Gaiden Black","year":2005,"developer":"Team Ninja","url":"microsoft_xbox_n_part2/Ninja%20Gaiden%20Black%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5912935936,"score":8.9,"genres":"Action > Behind view > Hack and slash > Puzzle elements","desc":"<p><em>Ninja Gaiden Black</em> is a re-release of Ninja Gaiden for the Xbox but with new content such as unlockable costumes, a mission mode, and more difficulty modes. Hard mode is unlocked right away if you have completed the original Ninja Gaiden and the saved file is present on your Xbox. Ninja Dog mode is also included for fans who felt the game on normal was too hard. This is unlocked by dying three consecutive times on the first chapter in normal mode. There are also two more levels of difficulty (very hard and master ninja), which are unlocked consecutively with the completion of the game on the previous difficulty setting.</p><p>There are new enemies not included in the original release of the game and a new weapon called Lunar First seen in the Hurricane bonus packs. Mission mode includes 50 missions. Those who have ever played the Xbox Live! downloadable Hurricane packs (also included in this release) will be familiar with these. The missions are of varying length and difficulty. Your score is tracked for an online leaderboard over Xbox Live!, so you can compare your ninja prowess with your peers.</p><p>There are some new in-game cutscenes.All three Ninja Gaiden games from the Nintendo era have been removed for a faithful emulation of the Ninja Gaiden arcade game originally released in the late eighties (which even requires to press a button to simulate the act of inserting a coin in the coin-op machine to start playing)</p>"},{"name":"Nobunaga no Yabou - Ranseiki","year":2002,"developer":"KOEI Co., Ltd.","url":"microsoft_xbox_n_part2/Nobunaga%20no%20Yabou%20-%20Ranseiki%20%28Japan%29.zip","filesize":6673999349,"score":"","genres":"Strategy > Point and select > Historical events > Japan (Ancient/Classical/Medieval) > War","desc":"<p><em>Nobunaga no Yabou: Ranseiki</em> is a tactical strategy game set in 16th century feudal Japan. It is ninth game in <em>Nobunaga's Ambition</em> war simulation series.</p>"},{"name":"NRL Rugby League","year":2003,"developer":"Sidhe Interactive"}]