[{"name":"ObsCure","year":2004,"developer":"Hydravision Entertainment","url":"microsoft_xbox_o_part1/ObsCure%20%28Europe%29.zip","filesize":6848663788,"score":7.2,"genres":"Action > 3rd-person (Other) > Cinematic camera > Horror","desc":"<p>Something is very wrong at Leafmore High. The entire school has turned dark and foreboding, strange sounds echo in the halls, and several people have mysteriously gone missing. One group of brave teens decides to find out what's going on... no matter what. They have no idea what kind of horrors have gripped the school and everyone in it. In the darkness, the evil has power... but add light and they can be defeated. Will they survive the night ahead?</p><p>In Solo Mode, choose from 5 characters with different personalities, aptitude and perspectives. Change between them at any time (as long as they are still alive).</p><p>The player can also select a second person (as a \"teammate\") to accompany the player by going to a \"gathering point\" in the game. At any time during play, the player can switch control between the first character and the second, thereby accessing their special talents.</p><p>There are several basic types of weapons used in the game: contact (a baseball bat for instance), pistols, guns, and more exotic, high-powered \"special\" weapons. Ammunition is specific for each gun or pistol and is not interchangeable. Weapons can be swapped between characters and ammunition found is stored in the group's reserves for sharing amongst them.</p><p>The player will also be gathering up first-aid kits, discs (for saving games), keys, screwdrivers and other tools. Other objects are required for solving riddles within the game.</p>"},{"name":"Oddworld: Munch's Oddysee","year":2001,"developer":"Oddworld Inhabitants Inc.","url":"microsoft_xbox_o_part1/Oddworld%20-%20Munch%27s%20Oddysee%20%28Europe%29.zip","filesize":6694568928,"score":7.6,"genres":"Action > 3rd-person (Other) > Puzzle elements > Direct control > Fantasy","desc":"<p>Munch is a lonely Gabbit - a gentle frog-like creature who communicates with other members of its species through echolocation. Munch searches in vain for others of his kind: his entire race has been exterminated, since the Gabbit eggs (\"gabbiar\") is a delicacy, and their lungs have been used by the chain-smoking, powerful Glukkons to replace their own. The last of the Gabbits is captures by two Vykkers, owners of Vykkers Labs, where they conduct experiments on living creatures. The two implant a sonar device in Munch's head, concocting a plan to enslave him and use him to trap other animals. However, Munch discovers that the implant has given him new powers; using those, he begins to free the vicious Fuzzles, whom the Vykkers have been using in their laboratories, hoping to escape himself and help other creatures who suffer under the yoke of the Glukkons.</p><p><em>Munch's Oddysee</em> is set in the fictional Oddworld universe; its events take place after those of Abe's Exoddus. The player controls Munch as well as Abe, the hero of the previous <em>Oddworld</em> games. Abe's abilities haven't changed much since the last installment: as before, GameSpeak must be used to communicate with other creatures, leading them to safety. His fellow Mudokons can now be ordered to attack enemies. Abe can also grab and toss Mudokons or Munch to lead them to area they cannot access otherwise. Possessing enemies also comes into play, and is needed to solve many of the puzzles. Possession abilities can now be used to ignite quarrels between enemies and make them fight each other. </p><p>The player can change between Abe and Munch instantly throughout most of the game. Munch brings on the table new abilities of his own: he can use his sonar to control or immobilize specific creatures, as well as swim. Another new addition is the possibility to use vending machines, which sell various items that enhance the abilities of the protagonists. At certain points Abe and Munch can also remote-control mechanical creatures.</p>"},{"name":"Oddworld: Stranger's Wrath","year":2005,"developer":"Oddworld Inhabitants Inc.","url":"microsoft_xbox_o_part1/Oddworld%20-%20Stranger%27s%20Wrath%20%28Europe%29.zip","filesize":6486392152,"score":7.9,"genres":"Action > 1st-person > 3rd-person (Other) > Behind view > Platform > Puzzle elements > Shooter > Steampunk","desc":"<p>A bounty hunter known only as the Stranger is pursuing and capturing various criminals, trying to earn enough money for a mysterious operation. When he hears that a town populated by Grubbs has been invaded by a demon, the Stranger ventures there. The town was once protected by a race of creatures known as the Steef, who now appear to be completely extinct. The Stranger soon discovers that a nearby river has been dried up by a dam, built by a person called Sekto. The Stranger must confront this person as he continues to hunt down outlaws, revealing nothing about his past.</p><p><em>Oddworld: Stranger's Wrath</em> is set in the fictional Oddworld universe, differing in many ways from the preceding installment. The game incorporates two basic genres: third-person platforming action and first-person shooter. The player can switch between the modes at any time by using a melee or a ranged weapon, respectively. The goal of the game, for the most part, is to bag the outlaws and bring them in, collecting \"moolah\" (the game's currency) in the process. The Stranger can stun or knock down enemies, as well as use a stealthy approach, e.g. hiding in long grass to surprise the enemy.</p><p>The Stranger's weapon is a double-barrel crossbow, upon which the player can load up to 81 combinations of \"live ammo\". Literally, the ammo is alive, from the wise-cracking ChipPunk, to the explosive BoomBat. These critters live in the wild, and can either be bought in bulk at centrally located stores run by the chicken-like Clakkerz in town, or can be hunted in the wilds.</p><p>Missions are selected by the player when they accept bounties at the Bounty Store. To help steer them in the right direction, the Clakkerz that are walking around town will offer bits of sometimes helpful, but always sarcastic conversation when the protagonist communicates with them. Moolah can be spent to upgrade weapons, ammunition, and armor, as well as acquire various items.</p>"},{"name":"Open Season","year":2006,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_o_part2/Open%20Season%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6716306729,"score":6.3,"genres":"Action > Behind view > Puzzle elements > Licensed","desc":"<p>In this game the player takes the role of Boog, a domesticated bear who tries to return to the civilization after being released in a nearby forest due to an unfortunate misadventure, and Elliot, a crazy, one-horned deer who desires to be Boog's partner.</p><p>In order to achieve his goal, Boog will have to prove himself to the creatures of the forest by helping them to get rid of the hunters. By gaining their respect, Boog will be able to convince the creatures to help him reach his hometown.</p><p><em>Open Season</em> is a third-person view action game based on Sony Animation Studios' first movie. The player controls the main character in the forest and uses the different forest creatures to resolve simple puzzles (considering the target age for the game) by throwing them. The player can collect \"achievement points\" (not related to the Xbox 360 Achievement points) that will unlock new abilities for Boog.</p>"},{"name":"Operation Flashpoint: Elite","year":2005,"developer":"Bohemia Interactive Studio s.r.o.","url":"microsoft_xbox_o_part2/Operation%20Flashpoint%20-%20Elite%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6656395774,"score":6.5,"genres":"Action > Compilation > Simulation > 1st-person > Shooter > Tactical shooter > Flight / aviation > Helicopter > Tank > Cold War > Spy / espionage","desc":"<p>Operation Flashpoint: Elite is a port of the original Operation Flashpoint and its expansion Resistance for Xbox, but adds some additional content. It also includes individual single missions, a mission editor and co-op or competitive online play over Xbox Live. </p><p>As with the PC release, Operation Flashpoint: Elite is a realistic soldier simulation where players get to control both individual soldiers, full squads and various vehicles including helicopters and tanks. In total, the campaigns contain more than 60 missions. Through Xbox Live, 50 multiplayer missions are available.</p>"},{"name":"Otogi 2: Immortal Warriors","year":2003,"developer":"FromSoftware, Inc.","url":"microsoft_xbox_o_part2/Otogi%202%20-%20Immortal%20Warriors%20%28Europe%29%20%28En%2CJa%29.zip","filesize":5959166001,"score":7.5,"genres":"Action > Behind view > Beat 'em up / brawler > Fantasy","desc":"<p><em>Otogi 2: Immortal Warriors</em> combines fantasy with real life folklore and fast paced action. It starts where its predecessor ended and this time Raikoh, the hero of the first game, is not alone. Five new warriors join him and combine their powers to tackle the task of saving the world from a new demonic threat.</p><p>Gameplay is pretty much your regular hack &amp; slash, and there is lots of it. The player advances through levels, destroying huge amounts of mystical enemies with different attacks, both physical and magical, while collecting experience which lets one improve the skills of the characters. New weapons and accessories can be purchased from a store between levels. Challenge levels separate from the main game open up as levels are completed, such as ones that task you wish surviving against a never ending horde of monsters, or destroying 100 arches in a limited time. Almost everything in the game's levels are destroyable, from trees to buildings, and the six playable characters are all different so one level might be easier to complete with one character than the other.</p>"},{"name":"Otogi: Myth of Demons","year":2002,"developer":"FromSoftware, Inc.","url":"microsoft_xbox_o_part2/Otogi%20-%20Myth%20of%20Demons%20%28Europe%29.zip","filesize":6516071631,"score":7.3,"genres":"Action > Behind view > Hack and slash > Fantasy","desc":"<p><em>Otogi: Myth of Demons</em> is a third-person action game which lets you play as Raikoh. Once a mighty warrior, he has been resurrected by a mysterious princess to free Japan of an army of demons and is held in the world of the living by her powers.</p><p>Battle your enemies with either your sword, your magic, or both, and buy new weapons, spells and other items between missions to better your performance. The battle system, while simple at its roots, lets you execute a number of combinations of basic, heavy, spell, and dash attacks to strike at your enemies. Since Raikoh can stay long in mid-air and even rise up higher by executing certain slashes, fights take place in all three directions of the area.</p>"},{"name":"Outlaw Golf","year":2002,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Golf%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6580627388,"score":6.8,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Golf","desc":"<p>The first game in the Outlaw series of sports titles, <em>Outlaw Golf</em> is what you get when you take the classic game of golf and throw in lesbian strippers, wannabe rappers, ex cons and other wild personalities. The game has a bad attitude chock full of sexual themes and language that puts Happy Gilmore to shame.</p><p><em>Outlaw Golf</em> pits you as one of ten over-the-top golfing personalities (paired with equally over-the-top caddies) to compete in over 30 different tour events from where you attempt to unlock new characters, better clubs and balls as well as improving your golfer's skills along the way with 12 different mini-games. The game also sports a composure response system, which simply means that when you do well, the game is easier and when you aren't doing so well you will find your shots not going exactly where you want them. Composure too low? Beat up your caddy and you can relieve some of that stress to regain your lost composure. Multiplayer supports 8 different game modes, including stroke play, match play, skins, best ball and casino with up to four players.</p>"},{"name":"Outlaw Golf 2","year":2004,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Golf%202%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6685541330,"score":7.1,"genres":"Sports > 3rd-person (Other) > Golf","desc":"<p>Following the style of its predecessor, the original Outlaw Golf, the game stays true to bad attitude, sexual themes and bunch of losers who just happen to find something in common to take upon - a game of golf. The magnificent four are back, Harley, Summer, El Suave and Ice Trey, with several more characters to be unlocked as you blast through the courses, speaking of which, the former three from the original are back, and again, with newer ones to be played after earned and unlocked. If you wanna practice your moves and skills, you can select exhibition mode, or if you feel contempt enough, go take a tour and show 'em what you're made of. There are several additions not seen in the original game, such as different game modes as well as golf cart racing which lets you earn the legendary burning shot, though the beating of your caddy to raise your composure is still included. The game also supports online play.</p>"},{"name":"Outlaw Golf: 9 More Holes of X-Mas","year":2003,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Golf%20-%209%20More%20Holes%20of%20X-Mas%20%28USA%29.zip","filesize":6779824317,"score":"","genres":"Action > Sports > 3rd-person (Other) > Golf","desc":"<p>A Blockbuster Video Exclusive release. This is another 9 holiday holes of Outlaw Golf like last year's Outlaw Golf: Holiday Golf. This time it's Summer and Trey in their holiday dress playing on 9 never-before seen courses. This short version has all the clubs unlocked, so use that bigger stick.</p>"},{"name":"Outlaw Golf: Holiday Golf","year":2002,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Golf%20-%20Holiday%20Golf%20%28USA%29.zip","filesize":6792747198,"score":"","genres":"Action > Sports > 3rd-person (Other) > Golf","desc":"<p>It's the holidays and here are 9 all-new holes for the holidays. A small taste of Outlaw Golf but on slippery slopes, frozen greens, and other cold wintery conditions to challenge you on these courses.</p>"},{"name":"Outlaw Tennis","year":2005,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6765059654,"score":6.5,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>The Outlaw gang is back, this time to take on the world of Tennis. The game features all your favorite characters from the previous Outlaw games and adds a few new ones for a total of 16 playable characters. Like the other Outlaw games, there are a number of unlock-able items including new characters, racquets, balls, courts and mini-games and a hard rock soundtrack.</p><p>The game follows the traditional rules of tennis and adds the unique humor and special features common to the series including player fights, exploding balls, changing weather, character improvements, outfits and other accessories.</p><p>There are 6 game modes including: Exhibition, Tour (50 Tour Matches - Singles, Doubles &amp; Canadian Doubles mixed), Random Play, Drills and Network play. Special matches include Classic, Hot Potato, Casino, Baseball, Football, Pinball and Ping Pong which are similar in nature to the other games in the series.</p>"},{"name":"Outlaw Volleyball","year":2003,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Volleyball%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6614586054,"score":7.1,"genres":"Action > Sports > Diagonal-down > Volleyball","desc":"<p><em>Outlaw Volleyball</em> is the second game in Simon &amp; Schuster's growing Outlaw franchise.</p><p>As the title suggests, you play various games of volleyball with shady and dirty characters, from a slutty biker to an ex con to a pair of strippers. There are sixteen players in total. Each character has his or her own unique personality, strengths and weaknesses.</p><p>There are four different modes you can compete in; Exhibition, which is a standard volleyball game, Tour, which is the career mode that spans fifty different events, and Drills, which are sort of like practice games that awards points you can use to improve your player's abilities. The fourth mode is Xbox Live enabled, allowing you to play with people over the Xbox Live service.</p><p>There are ten different courts to play on, each one with it's own backgrounds and animation. You can play on a beach, at a carnival, or even in a prison.</p><p><em>Outlaw Volleyball</em> utilizes the same momentum feature first seen in Outlaw Golf, which allows you to earn \"beating tokens\" that you can spend on beating up the other team. If you are doing lousy, beating up a member of the other team refills your momentum meter, allowing you to come back and possibly win.</p><p>Over Xbox Live, the game supports voice chat and scoreboards, so you can see your ranking whenever and wherever. It also supports downloadable content for future items.</p><p><em>Outlaw Volleyball</em> comes with a bonus CD that contains music from the band Diffuser, who is touted as \"Outlaw's official band\".</p>"},{"name":"Outlaw Volleyball: Red Hot","year":2003,"developer":"Hypnotix, Inc.","url":"microsoft_xbox_o_part2/Outlaw%20Volleyball%20-%20Red%20Hot%20%28USA%29.zip","filesize":6834797094,"score":"","genres":"Action > Sports > 3rd-person (Other) > Fighting > Volleyball","desc":"<p>A Blockbuster Video Exclusive game for the 2003 Halloween season. This acts like a demo for those not familiar with Outlaw Volleyball and has some new features for those who are. Some of the new items: Halloween costumes for many of the female characters and a new court.</p>"},{"name":"OutRun 2","year":2004,"developer":"SEGA-AM2 Co., LTD.","url":"microsoft_xbox_o_part2/OutRun%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6760600880,"score":8,"genres":"Racing / Driving > Behind view > Arcade > Automobile > Street racing","desc":"<p>Arcade style racing action meets challenge based skills driving. Driving between different zones to reach the finish point with choices of which route to take along the way means you can select the difficulty along the way. This is the sequel to the original arcade classic and has a very similar style graphically and gameplay.</p>"},{"name":"OutRun 2006: Coast 2 Coast","year":2006,"developer":"Sumo Digital Ltd (Sheffield)","url":"microsoft_xbox_o_part2/OutRun%202006%20-%20Coast%202%20Coast%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6861888419,"score":7.8,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Automobile > Street racing > Licensed","desc":"<p>Like its predecessors, <em>OutRun 2006</em> is an old-school arcade racer, which means that your cars don't have realistic physics, don't get damaged and have insanely fast speed.</p><p>Since this title is officially licensed by Ferrari, you drive with 15 original models from the DINO 246 GTS over the F430 to the all-new Enzo Ferrari. The heart of the game is the Coast 2 Coast mode in which you race against up to 5 AI players on 15 US themed tracks. In addition you have to impress different girlfriends. She tells you what she wants to see (a hard slide around a curve or a close take-over for example) and you have to perform it to win her heart.</p><p>There are 3 other game modes available in singleplayer: OutRun, Time Attack and OutRun2SP. In OutRun2SP you get access to 15 arcade tracks from the original OutRun 2. In OutRun however you need to drive your girlfriend through various checkpoints to the goal before the timer hits zero. In Time Attack you just have to beat the highscore of the current track. You can either race against the clock or against ghost cars.</p><p>In every mode you get OutRun miles after the race. These are the currency of the game and are needed to unlock new cars, upgrades and additional music-stations.</p><p>If you feel alone, even with your virtual girlfriend in the car, you can race online against 5 other players.</p>"}]