[{"name":"Pac-Man World 2","year":2002,"developer":"Namco Hometek Inc.","url":"microsoft_xbox_p/Pac-Man%20World%202%20%28USA%29.zip","filesize":6762653518,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform > Direct control > Fantasy","desc":"<p>Long ago, an evil stronger then anything before or after it, was trapped underneath a tree, which grew the five golden fruits. Years later the band of ghosts, who continue to roam Pac-World, have stolen the fruits from the tree. Unknown to them, they have also unleashed the evil that lurked beneath the tree on a helpless Pac-World. Only one Pac can return the five golden fruits to the tree and stop both the ghosts and the new evil from destroying Pac-World, and that's Pac-Man.</p><p>Using his famous munching skills, Pac-Man must explore 20 monster, pit and trap filled levels. But of course, the Pac-Pills can be found across each map to aid Pac-Man in his quest.</p><p>The game also features four classic <em>Pac-Man</em> games to unlock, all taken from different Namco compilations. They are, in order of appearance:</p><ul><li>Pac-Man (taken from Namco Museum Vol. 1)</li><li>Ms. Pac-Man (taken from Namco Museum Vol. 3)</li><li>Pac-Mania (taken from Namco Museum Vol. 5)</li><li>Pac-Attack (remake taken from Namco Anthology 2)</li></ul>"},{"name":"Pac-Man World 3","year":2005,"developer":"Blitz Games Ltd","url":"microsoft_xbox_p/Pac-Man%20World%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6422736957,"score":6.8,"genres":"Action > Behind view > Platform","desc":"<p>Pac-Man is teleported by Orson through 15 different levels to fight Erwin, his army of robots, monsters and Spectral Entities to save the world, Pac-Land and the Spectral Realm. Erwin plans to siphon spectral energy from the Spectral Realm to power his army of robots in order to rule the world. Pac-Man uses punching, Rev Rolls, Butt-Bouncing and various new Power Pellets to defeat Erwin and his minions. Pac-Man also pilots Toc-Man in a battle against Erwin’s robot army.</p><p>Joined by Pac-Man’s old enemies, Orson, Clyde and Pinky, and new friends along the way, Pac-Man adventures through different levels from a boneyard of old bots to a burning tower, up mountains, through deserts and the Spectral Realm to destroy all of Erwin’s Spectral Syphons. In this title, Pac-Man has also been given full speech, voiced by Martin T. Sherman.</p>"},{"name":"Painkiller: Hell Wars","year":2006,"developer":"People Can Fly, Sp. z o.o.","url":"microsoft_xbox_p/Painkiller%20-%20Hell%20Wars%20%28Europe%29.zip","filesize":6009373655,"score":7.1,"genres":"Action > Compilation > 1st-person > Shooter > Fantasy > Horror","desc":"<p>This Xbox version of Painkiller is a collection of the best levels from the original game and its expansion pack, Battle Out of Hell. As Daniel Garner, a once normal man that died in a car accident, you have been sent to Purgatory during a war between Heaven and Hell. You'll blast your way through hordes of monsters as you fight for your purification.</p><p>Like the original game, <em>Painkiller: Hell Wars</em> is a retro shooter that plays very similarly to Quake. Your weapons don't need to be reloaded, and switching from weapon to weapon is very quick (no weapon switching animations), a nod to the original <em>Quake</em>. You can collect souls from your fallen enemies to gain health, and collecting 66 souls will turn you into an invincible demon that can instantly kill his enemies with a screen-blurring projectile. If you do well, you'll even be rewarded with power-ups in the form of tarot cards.</p>"},{"name":"Panzer Dragoon Orta","year":2002,"developer":"Smilebit","url":"microsoft_xbox_p/Panzer%20Dragoon%20Orta%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6076579345,"score":8.3,"genres":"Action > 3rd-person (Other) > Arcade > Rail shooter > Flight / aviation > Post-apocalyptic","desc":"<p>The fourth installment of the Panzer Dragoon series has you playing Orta, a young girl who has been imprisoned by the Empire. Under a wave of attack, the prison camp is broken through by a mysterious dragon, and Orta takes it upon herself to ride the dragon, and destroy the Empire once and for all. Along the way, she will also discover her own destiny, and the mystery surrounding her new friend.</p><p>Simply put, you have limited control of the dragon for most of the game, as your trigger finger will be shooting non-stop at the enemies that fly around the area. Orta will be your main source of fire-power when you simply press the fire button, but by pressing and holding, the aim cursor will change, allowing you to fire a burst of power from the dragon at whatever the cursor aims at. </p><p>The dragon itself can change into three forms at a press of a button. Each form has a different style of attack and power ability.</p><p>A port of the original Panzer Dragoon is included.</p>"},{"name":"Pariah","year":2005,"developer":"Digital Extremes Toronto","url":"microsoft_xbox_p/Pariah%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6554707301,"score":6.7,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>You play Jack, a doctor on a transport ship. The ship is transporting a woman who suffers from a previously unknown disease and who've been put in stasis to be taken to a research facility. On route the ship is shot down and you find yourself in the middle of nowhere with hostile people coming at you. In the standard first-person shooter setup you battle to uncover the truths of the disease.</p>"},{"name":"Party Blast","year":2002,"developer":"Data Design Interactive Ltd","url":"microsoft_xbox_n_part2/Nickelodeon%20Party%20Blast%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6038361135,"score":"","genres":"Action > Racing / Driving > Sports > Diagonal-down > 2D scrolling > Fixed / flip-screen > Party game > Basketball > Fantasy > Licensed","desc":"<p><em>Nickelodeon Party Blast</em> is a party game for up to four players with Nicktoons characters from Nickelodeon. Game modes are Blast, Replay, Cup Challenge and Party Play (multiplayer only). There are several game modes where characters need to complete stages through different events. The eight playable characters are Angelica, Invader Zim, Spongebob, Eliza Thornberry, Otto Rocket, Reggie Rocket and Jimmy Neutron. They come from the series <em>Invader Zim</em>, <em>Jimmy Neutron</em>, <em>Rocket Power</em>, <em>Rugrats</em>, <em>SpongeBob SquarePants</em> and <em>Wild Thornberrys</em>.</p><p>A game generally consists of several types of stages based around a mini-game with a boss at the end. There is Food Fight where characters throw food at each other in a single-screen environment, there is a squirting game called Squirt and Splash, a basketball game mixed with skating elements, Pipe Challenge where pipes need to be put together to blast rockets, a racing game and so on. There are also bonus stages with different gameplay. Stars can be earned to unlock additional cups as series of stages.</p>"},{"name":"Peter Jackson's King Kong: The Official Game of the Movie","year":2005,"developer":"Ubisoft Pictures SAS","url":"microsoft_xbox_p/Peter%20Jackson%27s%20King%20Kong%20-%20The%20Official%20Game%20of%20the%20Movie%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%2CNo%2CDa%2CFi%29.zip","filesize":6754412954,"score":7.7,"genres":"Action > 1st-person > Behind view > Shooter > Interwar > Licensed","desc":"<p>Jack Driscoll, scriptwriter, follows director Carl Dernham and actress Ann Darrow to Skull Island where Dernham intends to film his next movie. But primeval creatures await them: giant insects, dinosaurs, and King Kong. Based on Peter Jackson's 2005 remake, King Kong lets you play as Jack Driscoll and Kong himself.</p><p>Jack's levels are HUDless FPS levels set on Skull Island. Jack must use a variety of weapons, traps, and fire to kill or repel Skull Island's fauna. Kong's levels are third-person brawlers set on Skull Island and New York City, where Kong must puzzle his way through environmental obstacles and thrash his opponents.</p><p>The PSP version is shorter, with some parts cut out which featured in the console and PC releases.</p>"},{"name":"Phantasy Star Online: Episode I & II","year":2003,"developer":"Sonic Team","url":"microsoft_xbox_p/Phantasy%20Star%20Online%20Episode%20I%20%26%20II%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%29.zip","filesize":6552173411,"score":7.9,"genres":"Action > Role-playing (RPG) > Behind view > Direct control > Sci-fi / futuristic","desc":"<p>The epic Phantasy Star Online gets revamped for the Nintendo GameCube. Both the Sega Dreamcast titles, Phantasy Star Online and Version 2, are included plus an exclusive new adventure, dungeons, enemies, new rare items and more.</p><p>Phantasy Star Online allows up to 4 players to co-operate online or on the one GameCube console in an adventure spanning countless fantasy battles in highly detailed worlds. Four players can also play a range of different mini-game types including Battle Mode and Challenge Mode.</p>"},{"name":"Phantom Crash","year":2002,"developer":"Genki Co., Ltd.","url":"microsoft_xbox_p/Phantom%20Crash%20%28Europe%29.zip","filesize":6441147554,"score":7.3,"genres":"Action > Behind view > Shooter > Mecha / giant robot > Sci-fi / futuristic","desc":"<p>In the year 2025 Tokyo changed.Due to air pollution, all the people moved to New Tokyo and the Old Tokyo got deserted. Now it's used for a sport called Rumbling, which is a brutal, action filled sport and the stars are customised mecha-like machines which battle against each other in arenas made exclusively for the sport. Little by little, the sport got a foothold and now is one of the most successful things in entertainment.  </p><p>There is a story mode, which sees the player fight her way through the ranks of opponents, each one a bit harder than previous. She must use the credits won from the battles to soup up the mech with different parts and weapons. One can also choose the coloring of her mech which adds to the uniquity of each fighting machine.Missiles fly and explosions shatter the ground as these huge metal monsters take on each other both outside and inside buildings, and also the time of day changes so the battle could take place during the day or night. Once in a while, player has to battle a boss and earn some sweet rare parts if it is defeated. There is also multiplayer with 2-4 players fighting in split-screen mode.</p>"},{"name":"Phantom Dust","year":2004,"developer":"Microsoft Game Studios Japan","url":"microsoft_xbox_p/Phantom%20Dust%20%28USA%29.zip","filesize":6220442234,"score":8,"genres":"Action > Behind view > Cards / tiles > Cyberpunk / dark sci-fi > Post-apocalyptic > Sci-fi / futuristic","desc":"<p>An action/strategy card game set in a post-apocalyptic world where the barren surface world has been covered in mysterious dust and everyone has lost their memories of the world before.  A band of humans who have developed special powers called Espers, have discovered two people locked away in hibernation capsules.  One person is a mysterious man named Edgar who may harbor answers to why the cataclysm has taken place.  The other sleeper is you.</p><p>Phantom Dust boasts over 100 single player quests, more than 300 skills or cards, destructible environments, custom soundtracks, split-screen multiplayer, and online play through Xbox Live, complete with downloadable content such as new cards and skills.</p>"},{"name":"Pilot Down: Behind Enemy Lines","year":2005,"developer":"Wide Games","url":"microsoft_xbox_p/Pilot%20Down%20-%20Behind%20Enemy%20Lines%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5849146403,"score":5.5,"genres":"Action > 1st-person > Behind view > Stealth > World War II > War","desc":"<p>Over 180,000 Allied airmen were shot down on enemy territory during WW2. This game is about one of those men, trying to get to safety of Switzerland through hostile territory.</p><p>The gameplay is mostly about sneaking around varied environments such as a lumberyard, wilderness and so forth trying not to be detected by the German troops and making as little commotion as possible. With the aid of different objects (such as cigarette packs for distracting guards or apples for a quick stamina replenishing) the player must make it through the levels. The player character has a stamina which means that it's not very good idea to be standing in a freezing cold water for too long because if the stamina meter runs out, the health meter starts to deplete. Because of it, it's a good idea to warm up by campfires or eat something once in a while, thus restoring stamina.Of course there is some weapons also, which one can use to dispatch enemies that wander too close. They range from a piano string to machine pistols.</p>"},{"name":"Pinball Hall of Fame: The Gottlieb Collection","year":2004,"developer":"FarSight Technologies Inc.","url":"microsoft_xbox_p/Pinball%20Hall%20of%20Fame%20-%20The%20Gottlieb%20Collection%20%28USA%29.zip","filesize":6863356102,"score":7.2,"genres":"Action > 1st-person > Pinball > Licensed","desc":"<p><em>Pinball Hall of Fame</em> aims to bring eight classic tables from 50s to the 90s to the modern day by realizing them in full 3d with sounds just like the originals had. You'll be able to choose from tables like Ace High, Central Park, Big Shot, Genie, Black Hole, Victory, Tee'd Off and a secret unlockable table.</p><p>You'll also be able to unlock additional gameplay modes, artwork, interesting information and neat little distraction games like a love tester machine or a Xolten fortune teller machine.</p><p>The game also features realistic ball physics to attempt to duplicate the experience of the actual machines and six different views so you can get the view you want. When you finish going through the tables by yourself, you can invite three of your friends over to see who can get the highest score.</p><p>The Xbox version also lets you upload your best scores up to Xbox Live! to compete against the world.</p>"},{"name":"Pirates of the Caribbean","year":2003,"developer":"Sea Dog","url":"microsoft_xbox_p/Pirates%20of%20the%20Caribbean%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":5648427119,"score":6.7,"genres":"Role-playing (RPG) > Behind view > Naval / watercraft > Licensed","desc":"<p><em>Pirates of the Caribbean</em> is a role-playing game in which the player takes the role of a pirate who has to grow in skill by fighting, trading and solving quests. The player can buy and upgrade a ship, sign-up a crew, and try to rule the seas of the Caribbean.</p>"},{"name":"Pirates: The Legend of Black Kat","year":2002,"developer":"Westwood Studios, Inc.","url":"microsoft_xbox_p/Pirates%20-%20The%20Legend%20of%20Black%20Kat%20%28Europe%29.zip","filesize":6565156403,"score":7.2,"genres":"Action > 1st-person > 3rd-person (Other) > Naval / watercraft > Fantasy","desc":"<p>Mara Rousseau, the fearless leader of the Pirates of Skull Cove, decided to settle down one day. She married Marcus de Leon, the governor of the Pirate Isles, and they had a daughter named Katarina. The governor always wanted to protect her from the dangers of a pirate's life - especially after her mother disappeared without a trace. But when the ruthless Captain Hawke begins to terrorize the islands with his gang, the Crimson Guard, Katarina realizes she must find a way to stop him at all costs.</p><p><em>Pirates: The Legend of Black Kat</em> is an action game consisting of two main modes: sailing and land exploration. While sailing, Katarina's ship encounters hostile vessels and may engage in naval battles. The player must explore islands on foot to find special items that would unlock new areas on the map. Each island is a fairly linear area with respawning enemies hindering Katarina's progress. The player can also find keys allowing him to unlock treasure chests, and search for various items for collecting purposes.</p>"},{"name":"Pitfall: The Lost Expedition","year":2004,"developer":"Edge of Reality, Ltd.","url":"microsoft_xbox_p/Pitfall%20-%20The%20Lost%20Expedition%20%28Europe%29.zip","filesize":6671104424,"score":6.9,"genres":"Action > Behind view > Metroidvania > Puzzle elements > South America","desc":"<p>You play as Pitfall Harry, intrepid adventurer on a mission to rescue an archaeological expedition that has gotten lost in the Peruvian jungle.  Along the way you'll do battle with your arch rival, Jonathan St. Claire, and help fulfill an ancient prophecy to save the world.</p><p>Gameplay takes the form of classic platformer action meets Metroid-style adventure as you explore through jungles, ruins, caverns, and mountains, looking for items that will open new avenues for exploration in a huge, connected world.</p>"},{"name":"Playboy: The Mansion","year":2005,"developer":"Cyberlore Studios, Inc.","url":"microsoft_xbox_p/Playboy%20-%20The%20Mansion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6675080563,"score":5.8,"genres":"Simulation > Strategy > Diagonal-down > Free-roaming camera > Real-time > Managerial / business simulation > Adult > Licensed","desc":"<p>Live the life of Hugh Hefner in this \"Virtual Hef\" simulation.</p><p>As a young Hugh Hefner, it is the player's goal to build the Playboy empire through sexy parties and putting together Playboy magazine every month. Build friendships and business contacts with celebrities, political figures, musicians, sports stars and more through hosting events and charming over people. </p><p>On the business side, Hef has to hire a staff to take photos and write articles for the magazine. The \"Playboy Photoshoot\" mode allows the player to take the role of photographer. On the personal side, invite friends into your inner circle, and find a girlfriend... or two.... or more. The better the parties Hef throws, the more fame he gets, as well as more interesting people to fill the magazine. More money means a larger staff, and more items (toys and furniture) for Hef to display in the Mansion.</p><p>Doing well in the game earns Hef points which can be used to purchase extra features, such as cheats and archive photos of Hef and past issue covers.</p>"},{"name":"PocketBike Racer","year":2006,"developer":"Blitz Arcade","url":"microsoft_xbox_p/PocketBike%20Racer%20%28USA%29.zip","filesize":6799030827,"score":6,"genres":"Action > Racing / Driving > Behind view > Direct control > Motorcycle > Track racing","desc":"<p>Mini motorcycles in the King's garden. Jump on a pocketbike and let 'er rip in this budget title from Burger King. Pocketbike's are small motorcycles that go really really fast. In <em>Pocketbike Racer</em> you get to choose from various Burger King characters including; The King, Brooke Burke, Subservient Chicken and Whopper Jr along with a biker and some generic humans.</p><p>The racing levels feature power-ups and weapons to use against your competition. You also have a Turbo bar that builds up depending upon your racing skills. The levels include, King's Garden, Burger King Parking Lot, and Fantasy Ranch which features streets of cheese. The levels themselves include hairpins, straightaways, and jumps where you can test out the game's cartoony physics. </p><p>The game also features a somewhat limited create-your-own-character mode where you can recolor all the non-mascot characters.</p><p>The weapons you can use on the tracks include the standard rockets and lightning bolts as well as firecrackers and an attack to reverse an opponents control for several seconds. Your turbo/weapons meter is charged by passing through gates set up on each level. This can be used for turbo boosts of course, but it also controls the weapons. The weapons are not picked up, but are available whenever you have your meter full enough to power them with the stronger weapons using more of the meter.</p>"},{"name":"Pool Shark 2","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_p/Pool%20Shark%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5666028487,"score":6.7,"genres":"Sports > 1st-person > Pool / snooker","desc":"<p><em>Pool:shark 2</em> is a simulation of the pool sport. Its most unique aspect is its setting: instead of high class tournaments, the player finds themself in smoky pubs with opponents like truck-drivers and lightly clad biker women. The handling, however, is similar to other pool games. The player has a lot of opportunities to tweak the position of the cue. A analog stick or mouse movement simulates the shot.</p><p>The game features ten pool variants, including popular ones like Eight-Ball and trick shots or exotic ones like snowboat pool. When playing the career mode (called \"Hustler\"), the player can bet money. The winnings are reinvested in clothes or pieces of equipment which look different but have no bearing on gameplay. Every successful match unlocks the next from a roster of 20 opponents overall.</p>"},{"name":"Power Drome","year":2004,"developer":"Argonaut Sheffield","url":"microsoft_xbox_p/Power%20Drome%20%28USA%29.zip","filesize":6059871094,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Sci-fi / futuristic","desc":"<p>An update of an Amiga and ST game, <em>Powerdrome</em> is racing in its purest form. </p><p>Breathtaking speeds of 1,000 miles per hour make Powerdrome the fastest and most dangerous racing sport. 12 riders risk all each with their own personality, racing style, and friends or foes.</p><p>Push your skills to the max in single player and multiplayer action, including split screen, and system link for the XBox.</p>"},{"name":"Predator: Concrete Jungle","year":2005,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_p/Predator%20-%20Concrete%20Jungle%20%28USA%2C%20Europe%29.zip","filesize":6420832686,"score":5.3,"genres":"Action > 3rd-person (Other) > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>When a sweltering night arrives in the summer of 1930, New Way City is visited by a creature of extraterrestrial origin. He is not there it conquer or to make first contact; he is there to hunt, and his prey is Man. After taking on warring mobsters the Predator is shot in the eye and hastily escapes, but leaves some of his equipment behind. While attempting to escape from the city in his ship, rubble falls onto the wounded hunter and pins him in place. In a suicidal attempt at preventing his remaining gear from being pilfered by humans, the Predator causes his ship to self-destruct; However, he survives and is rescued by his clan-folk. By committing the grave taboo of allowing his prey to obtain Predator technology, the one-eyed Predator is exiled to a hostile desert planet.</p><p>Fast forward one hundred years and the Predator, now known as Scarface, returns to the city of his botched hunting trip. New Way City has grown into the futuristic Neonopolis, where gangs still reign in terror. In order to regain his honor, Scarface must regain his captured hunting gear and will not let anyone stand in his way. Just like the natural variant, the concrete jungle is a competitive and unwelcoming place where only the fittest survive. Scarface faces brutal gangs, hulking robots, heavily armed soldiers, cyborgs, and even his own kin in his quest to retrieve his lost technology. The hunt is on.</p><p>In <em>Predator: Concrete</em> Jungle the player assumes the role of Scarface, the dishonored Predator on trail of his stolen equipment. It is a 3rd-person action game where the player often has to resort to hand-to-hand combat. Players make use of various upgradeable weapons such as glaives, mauls, a combistick, and famous wrist blades to take on enemies of increasing difficulty and specific weaknesses. Projectile weapons include a spear gun that can pin enemies to walls and the notorious shoulder-mounted plasma caster. Scarface also has access to the iconic cloaking device and a helmet with thermal vision. The player can tear the skulls and spinal cords out of certain enemies to claim as trophies to display in Scarface's ship. The city is \"level\" based, often requiring the play to complete certain objectives before moving on to the next \"level\". Players can also unlock special costumes for Scarface, many of which are from the various <em>Predator</em> / <em>Aliens vs. Predator</em> films.</p>"},{"name":"Prince of Persia: The Sands of Time","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_p/Prince%20of%20Persia%20-%20The%20Sands%20of%20Time%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6628779949,"score":8.4,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Middle East","desc":"<p>The King and the Prince of Persia are besieging the Maharajah's castle to plunder the treasures hidden inside. In order to impress his father, the Prince sneaks inside to recover the magical Dagger of Time. He quickly learns that this dagger has the ability to control time. The malevolent Vizier has other plans for the dagger, however, and tricks the Prince into unlocking a mysterious secret of the Dagger that causes the King and many of his subjects to be turned into sand zombies. Now, the Prince must figure out what has happened and try to set things right again.</p><p><em>Prince of Persia: The Sands of Time</em> is an action game with platforming and puzzle-solving elements. It updates many of the gameplay concepts from the previous games, and brings them into a fully three-dimensional world. The Prince will engage in sword fighting, wall climbing, spike dodging, puzzle solving, and more in his quest. The Prince also carries the Dagger of Time, which allows him to unleash several magical powers. The most important of these powers is the ability to reverse time. This ability allows the player to reverse their actions when they lead the Prince to his death.</p>"},{"name":"Prince of Persia: The Two Thrones","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_p/Prince%20of%20Persia%20-%20The%20Two%20Thrones%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6628846586,"score":7.9,"genres":"Action > Behind view > Platform > Puzzle elements > Quick Time Events (QTEs) > Fantasy > Middle East","desc":"<p>After many dangerous adventures, the Prince finally makes his way home to Babylon, bringing with him his new bride Kaileena, the Empress of Time. Their hopes for a peaceful and happy future together are dashed, however, when they arrive in Persia to find the land ravaged by war. Kaileena is promptly captured and murdered by the evil Vizier, and her death unleashes the Sands of Time, from which the Vizier derives terrifying new powers.</p><p>Once again the Prince of Persia must stand to fight, but this time he will be stronger than ever, thanks to his new alter ego the Dark Prince, born of the Prince's contact with the Sands. As he fights to reclaim his kingdom from the hands of a madman, he must also battle with his own inner demons as the Dark Prince threatens to consume him entirely.</p><p>The game is very similar (in terms of fight and puzzle sequences) to the previous installments of UbiSoft's Prince of Persia trilogy: The Sands of Time and Warrior Within. There are some major innovations like the character of the Dark Prince, who possesses the main protagonist from time to time and offers him new combos and moves. There is also a new ability, called \"Speed Kill\", which is very effective against all opponents in the game (victims are attacked from behind and murdered in brutal and stealthy fashion).</p><p>In Prince of Persia: The Two Thrones player will explore not only the streets of Babylon, but also a ruined palace of his father, a temple and the famous Hanging Gardens.</p>"},{"name":"Prince of Persia: Warrior Within","year":2004,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_p/Prince%20of%20Persia%20-%20Warrior%20Within%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6546055001,"score":7.7,"genres":"Action > 1st-person > Behind view > Platform > Puzzle elements > Fantasy > Middle East","desc":"<p><em>Prince of Persia: Warrior Within</em> is the direct sequel to Prince of Persia: The Sands of Time. Seven years later, the Prince is hunted by a monster known as Dahaka. He finds out that anyone who manipulates the Sands of Time is destined to die shortly afterwards; but the Prince has escaped his fate, and that's the reason for Dahaka's rage. Now the Prince must travel to the mysterious Island of Time, where he hopes to find the Empress of Time and, through time manipulation, somehow prevent her from creating the Sands in the first place...</p><p>The game comes with a new, darker look for the Prince and his surroundings. The fights are more brutal and take a larger part in the game, as the Prince now has enhanced fighting moves including new attack moves via walls and poles.</p><p>Even though the fights make up a large part of the game, the puzzle sections are still present and more complicated than before. A new move in the puzzle sections of the game is the curtain slide, which allows you to slide down to the ground slowly. There are still plenty of options for time manipulation and the storyline also lets you travel back and forth in time, visiting the same locations in an alternate time period.</p>"},{"name":"Prisoner of War: World War II","year":2002,"developer":"Wide Games","url":"microsoft_xbox_p/Prisoner%20of%20War%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6495857025,"score":6.7,"genres":"Action > 3rd-person (Other) > Stealth > World War II > War","desc":"<p>It is World War II, and the player takes the role of an American pilot, Captain Lewis Stone, who is thrown into a prison camp of the Nazis. While attempting to escape the camp, Captain Stone discovers that the Germans are developing a secret weapon they intend to use against the Allies. Soon his personal wish of escape turns into a desire to save the world from the destruction the Nazis are planning.</p><p><em>Prisoner of War</em> can be described as a stealth game. Unlike most other games of its kind (e.g. the Thief series), the game relies on stealth entirely, without offering violent options. The protagonist is helpless in the prison camp, and his only weapon is his wit. Sneaking past guards to deliver an important object to a fellow prisoner, hiding items, staying in shadows to avoid being recognized, and other stealth-based activities occupy the largest portion of the game.</p>"},{"name":"Pro Cast: Sports Fishing Game","year":2003,"developer":"Capcom Production Studio 3","url":"microsoft_xbox_p/Pro%20Cast%20-%20Sports%20Fishing%20Game%20%28Europe%29.zip","filesize":6888665452,"score":"","genres":"Sports > Behind view > Direct control > Fishing","desc":"<p>FISH ON!<br>Get back to the nature and experience the struggle of man versus fish in the most comprehensive bass fishing simulation game available on the Xbox. Pro Cast Sports Fishing recreates in-depth angler strategy involved in landing the biggest fish. Become the top angler in tournament fishing, customize your weather and time settings and earn points to gather valuable fishing tips and buy the best fishing gear. As you progress, discover a treasure trove of hidden secrets that may lead you to the legendary big mouth bass that has spawned fish tales for years!<br><br>* Battle countless schools of bass in pristine natural environments!<br>* 3 modes of play to suit your fishing style: Arcade, Free Fishing and Simulation<br>* Earn valuable fishing points to buy the best fishing gear!<br>* Loaded with hidden secrets that only the best angler can unlock!</p>"},{"name":"Pro Fishing Challenge","year":2004,"developer":"Opus Corp.","url":"microsoft_xbox_p/Pro%20Fishing%20Challenge%20%28USA%29.zip","filesize":6789171200,"score":"","genres":"Sports > Behind view > Direct control > Fishing","desc":"<p><em>Pro Fishing Challenge</em> is a fishing game featuring:* 4 levels each with changing weather, water temperature and wind speeds</p><ul><li>Customisable angle appearance and equipment</li><li>Online multiplayer support</li></ul>"},{"name":"Pro Pinball: Trilogy","year":2005,"developer":"Cunning Developments"},{"name":"Pro Race Driver","year":2003,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_p/Pro%20Race%20Driver%20%28USA%29.zip","filesize":6375897234,"score":7.8,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Race Driver</em> adds a storyline and career structure to the Codemasters touring car racing lineage. You are Ryan McKane, son of a fatally crashed racer and younger brother of a very successful racer. Guide Ryan to the top of closed-wheel racing.</p><p>A wide roster of championships and cars are featured. You can race a Mercedes DTM silhouette car, a BTCC Peugeot, Australia's V8 Supercars, and more. Realistic circuits are included, although many have to be unlocked. The physics engine is realistic, and multiple camera angles are on offer.</p><p>The Director's Cut release has extra tracks and some of the championships are updated.</p>"},{"name":"Project Gotham Racing","year":2001,"developer":"Bizarre Creations, Ltd.","url":"microsoft_xbox_p/Project%20Gotham%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.zip","filesize":6599213905,"score":7.9,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Track racing","desc":"<p><em>Project Gotham Racing</em> takes you and your car onto the streets at night, where there are people to impress with your driving ability. You can race through cities such as New York and London. Pick one of the 25 cars and customise it to your tastes.</p><p>Two innovative features set the game apart from previous racers. The Kudos system awards points based on specific stunts and sharp driving, in a manner more typical of shoot 'em ups than racing games. Also, you can record your own CDs for use in the game, played in random order by a talking DJ.</p>"},{"name":"Project Gotham Racing 2","year":2003,"developer":"Bizarre Creations, Ltd.","url":"microsoft_xbox_p/Project%20Gotham%20Racing%202%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%2CZh%2CKo%29.zip","filesize":6035396988,"score":8.8,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Street racing","desc":"<p>Two years after the original game, <em>Project Gotham Racing</em> is back. There's no storyline: it's all about becoming the best driver of the world by finishing first in races through famous cities, such as Chicago, Edinburgh, Florence, Barcelona, Washington, Hong Kong and Moscow.</p><p>The kudos system, which awards points based on driving style, has been improved. Perform power slides, 360° turns, drive on two wheels or stay in the slipstream of your opponents to build up a stash. With those points, you can unlock new venues and faster race monsters, such as the Ferrari Enzo, Porsche GT2, BMW Z4, Pontiac GTO, Mini Cooper S and many others.</p><p>The game can be played both over System Link or Xbox Live. You can race friends online or download ghosts of the fastest drivers all around the world to improve your own skills.</p><p>Each city has its own soundtrack, but you can create and store your own playlists as well.</p>"},{"name":"Project: Snowblind","year":2005,"developer":"Crystal Dynamics, Inc.","url":"microsoft_xbox_p/Project%20-%20Snowblind%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6360196932,"score":7.1,"genres":"Action > 1st-person > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Spy / espionage","desc":"<p><em>Project: Snowblind</em> is a first-person spy action game set in the year 2065. You play Lt. Nathan Frost, a cybernetically enhanced super-commando sent to Hong Kong to stop a terrorist plot to shut down all of the world's electronic systems. Player abilities include cyborg enhancements such as cloaking devices and ballistic shields, the ability to take control of robots and vehicles, and the typical FPS assortment of weapons.</p>"},{"name":"ProStroke Golf: World Tour 2007","year":2006,"developer":"Gusto Games Ltd.","url":"microsoft_xbox_p/ProStroke%20Golf%20-%20World%20Tour%202007%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6703771446,"score":6.4,"genres":"Simulation > Sports > 1st-person > 3rd-person (Other) > Golf","desc":"<p><em>ProStroke Golf: World Tour 2007</em> is a golf simulation which unique feature is the innovative control scheme. In contrast to other golf simulations the tee is performed in first person mode. After choosing the club and the feet position the player needs to use both analog sticks. With the left one he simulates the swing and with the right one he relocates his body weight. It is not enough to relocate it simply in the right direction, the player needs to achieve a constant back and forth movement. </p><p>This only works when using a gamepad, alternatively there is also a more traditional three-click control scheme in 3rd person. There the player chooses the body weight movement before the strike. With the first click he strikes out, with the second one he determines the precision and with the last one the strength. This, however, is still different to other golf simulations because the kind of swing is not chosen beforehand but determined by the swing parameters.</p><p>Less innovative are the playing modes. The game features the usual training, single tournament and career mode. The career mode however are just many tournaments tacked together. The player character improves his rank with successes but this just influences the conditions of participation for other tournaments and not the gameplay itself.</p><p>The game features nine licensed golfers, 18 courses (two licensed) and three real-life golf-commentators. With the editor the player can build own courses and tournaments.</p>"},{"name":"Psi-Ops: The Mindgate Conspiracy","year":2004,"developer":"Midway Games, Inc.","url":"microsoft_xbox_p/Psi-Ops%20-%20The%20Mindgate%20Conspiracy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6434825060,"score":7.8,"genres":"Action > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Spy / espionage > Regional differences","desc":"<p><em>Psi-Ops</em> is an action game with a twist: no longer do you have to rely solely on big weapons and explosions to progress through it - you also have the aid of psychic powers to take down army after army of enemy soldiers.</p><p>In the game you take the role of Nick Scryer, a secret agent who had his face reconstructed and mind wiped clean in order to infiltrate a growing psychic organization calling itself The Movement. Nick, however, is captured, but manages to free himself and continue his mission to stop The Movement, regaining his psychic abilities along the way.</p><p>The game mixes regular weapons with the weapons of the mind. You'll have access to a series of mind powers, such as Telekinesis (the ability to fling object and soldiers around), Pyrokinesis (the ability to set things on fire), Mind Drain (for draining Psi power out of foes' minds) and Remote Viewing (leaving your body behind and exploring the level).</p>"},{"name":"Psychonauts","year":2005,"developer":"Double Fine Productions, Inc.","url":"microsoft_xbox_p/Psychonauts%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6426952764,"score":7.8,"genres":"Action > Behind view > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>At a summer camp for up-and-coming psychics, a young boy with an unusually high level of psychic ability inexplicably shows up. The boy, named Raz, is allowed to stay at the camp until his father comes to pick him up, but his arrival coincides with very strange circumstances. Soon, evidence that someone is psychically tampering with the campers' minds reveals itself, and Raz is the only one who can stop it. Raz must project himself into the psyches of several different people in order to figure out what is going on and who is behind the recent occurrences.</p><p><em>Psychonauts</em> is a 3D platform game with a rather unorthodox style. The characters' inner worlds are the game's levels. Each world reflects the personality of the person whose psyche it represents, often resulting in unique, surreal creations, and influencing the gameplay style. For example, the psyche of a giant lungfish is presented as a large city populated by fish people, in which Raz himself becomes a giant monster who can destroy entire buildings; the psyche of a mental patient is a huge board game, where Raz has to command armies in order to defeat Napoleon, etc.</p><p>There are also many gameplay elements and tasks which are common for all the levels. These include Raz fighting the (not very numerous) regular enemies, defeating level bosses, collecting currency, \"figments of imagination\" needed to upgrade his powers, and bonus items such as complete sets of the character's memories and others. Many of the game's puzzles require the usage of psychic powers, which Raz obtains in a more or less strict order. These powers range from combat abilities such as Psy Shield to Telekinesis (moving objects without touching them) and Clairvoyance (reading other people's minds). </p><p>The camp itself serves as the game's \"hub\", in which the player can explore, interact with characters, search for secret areas and items, and so on.</p>"},{"name":"Psyvariar 2 (Extend Edition)","year":2004,"developer":"Skonec Entertainment, Co., Ltd","url":"microsoft_xbox_p/Psyvariar%202%20-%20Extend%20Edition%20%28Japan%29.zip","filesize":6861222702,"score":"","genres":"Action > Top-down > 2D scrolling > Arcade > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p>Psyvariar 2 is another specimen of the recent breed of \"newschool\" arcade shoot'em'ups (other examples being Ikaruga and Border Down). As many other recently released shoot'em'ups, it combines basic arcade shooter gameplay with modern 3D graphics to liven up the genre. The level backgrounds as well as all enemies are modeled in full 3D, with the action taking place in a vertically scrolling two-dimensional plane which moves through the level.</p><p>As most of the other new-style SHMUPs, Psyvariar 2 has a gimmick: getting close to enemies or shots without actually being hit is called \"buzzing\" and yields massive extra score. In addition, the player ship's rate of fire is rather slow by default and can be raised by shaking the ship left and right a few times and then keeping moving horizontally - as soon as the horizontal movement stops, the fire rate drops down to normal again. </p><p>As in most other of the new Japanese style of shoot'em'ups, there are usually an extremely high number of enemy shots on the screen. All these factors combine to make learning precise control a central part of the game.</p>"},{"name":"Pulse Racer","year":2002,"developer":"Ketsujin Russian Studio","url":"microsoft_xbox_p/Pulse%20Racer%20%28USA%29.zip","filesize":6651747120,"score":4.6,"genres":"Racing / Driving > 3rd-person (Other) > Shooter > Sci-fi / futuristic","desc":"<p><em>Pulse Racer</em> is a racing game set in 2024 in futuristic vehicles that resemble karts. They have weaponry power-ups, where the car is linked directly to the driver, allowing the player to speed up at the cost of the character's heart rate and to race on life energy instead of fuel. Included are quick race, time trial, career, and multiplayer modes. Also of interest is the INFINITRAX system, which generates custom tracks that can be saved on the hard disk. While progressing through the game the game, more and more sliders are unlocked, allowing heavier customization of the maps.</p><p>Some of the weapons are mines, plasma beams and missiles. When the vehicle is stressed because of consistently using the unlimited speed boost, the character will have a heart attack and flatline. They then need to stop for a short moment to recover. Characters are visible inside the vehicles. By pulling the characters you can make the characters shoot beams that attach themselves to orbs around the track. That way they can grab onto poles to propel themselves forward or to take sharper corners. Most of the turning is also done by having the characters lean.</p><p>There are nine vehicles and fifteen tracks, and up to four players can compete offline on a split screen.</p>"},{"name":"Pump It Up: Exceed","year":2005,"developer":"Andamiro Co., Ltd.","url":"microsoft_xbox_p/Pump%20It%20Up%20-%20Exceed%20%28USA%29.zip","filesize":6807271886,"score":7.4,"genres":"Simulation > Arcade > Music / rhythm","desc":"<p><em>Pump It Up: Exceed</em> is a dancing game similar to the games in the Dance Dance Revolution series. The <em>Pump It Up</em> dance mat is different from the norm as the arrows are set on diagonals and includes a button in the middle which allows for more complexity in the dance moves that are required to be performed in the game.</p><p>The general gameplay has the player watching a music video as symbols scroll by. The player must match the symbols on the screen with the symbols on the <em>Pump It Up</em> dance pad with their feet. Hitting the arrows in sync with the music will keep the players life bar up and give the player a good rating, while doing the opposite will drain the life bar and give bad ratings. If the life bar drains all the way, the game ends.</p><p>The game has several mode to choose from:</p><ul><li>Arcade Mode has the player trying to achieve an “A” or an “S” rating on three consecutive songs. Doing that allows the player to play an extra song. Successfully completing songs in the Arcade mode opens them for play in Home Mode.</li><li>Home Mode allows the player to choose any song they have available to them.</li><li>Sudden Death Mode forces the player to perform a song flawlessly or the game ends. </li><li>Survival Mode - This mode becomes available after the player completes twenty songs in the Home Mode. This is an endurance test for the player, as the game keeps giving the players songs to go through until their life bar is finally depleted.</li><li>Video Mode - This mode is unlocked after the player completes a total of twenty songs in either Home or Arcade Mode. It allows the player to just watch the videos for any song they've completed.</li><li>Tutorial mode - Teaches the player how the game works.</li></ul><p>The game also keeps track of the players statistics (the rating grades they received for each song). </p><p>The PS2 version of the game features 101 songs, while the Xbox version contains 97 songs, but offers the option to download more songs. As some songs are more difficult then others, the game provides a rating from one to twenty to inform the player on just how hard of a task they are taking on by choosing a particular song.Two dance mats will be required for some songs that offer a freestyle option if the player chooses that setting.</p>"},{"name":"Punisher, The","year":2005,"developer":"Volition, Inc.","url":"microsoft_xbox_p/Punisher%2C%20The%20%28Europe%29.zip","filesize":6649300029,"score":7.2,"genres":"Action > 1st-person > Behind view > Quick Time Events (QTEs) > Shooter > Direct control > Licensed","desc":"<p>The Punisher is a third person action game that pits the player against the darkest scum of the Marvel Comics' universe.  With over a dozen grimy New York locales, this superhero adaptation embraces the feel of the 30 year comic series.</p><p>Featuring loads of weapons, brutal environmental kills and an innovative new interrogation engine where the player controls every last aspect of over 70 torture scenarios, the Punisher  provides a rich gaming experience for fans of dark, intense action.</p><p>Story written by comics authors Garth Ennis and Jimmy Palmiotti.</p>"},{"name":"Pure Pinball: American Pinball Reborn","year":2004,"developer":"A.S.K. Homework","url":"microsoft_xbox_p/Pure%20Pinball%20%28USA%29.zip","filesize":6814570031,"score":6.5,"genres":"Action > 3rd-person (Other) > Top-down > Arcade > Pinball","desc":"<p>The Xbox version of Pure Pinball contains all the content of the original with enhanced visuals and audio, as well as one extra table with an outer space theme. High scores can be shared over Xbox Live.</p>"},{"name":"Puyo Pop Fever","year":2004,"developer":"Sonic Team","url":"microsoft_xbox_p/Puyo%20Pop%20Fever%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6591737303,"score":7.6,"genres":"Puzzle > Side view > Fixed / flip-screen > Anime / Manga > Real-time > Falling block puzzle > Direct control","desc":"<p>Accord, teacher of the local magic school, has lost her magic flying cane. There is word of an award so the students are busy searching high and low for it. Naturally, our heroes Amitie and her school nemesis Raffine make their way toward the distant dark castle, challenging - and being challenged by - everyone you come across in a game of Puyo Pop.</p><p><em>Puyo Pop Fever</em> is a puzzle game of the falling-block variety, the goal of which is to clear your blocks (Puyos) by combining four or more of the same color, which will then vanish. This will produce Nuisance Puyos. These colorless Puyos will fall onto your opponents screen, thus blocking chains and combos they could create. These pesky Puyos can only be exterminated by removing neighboring Puyos.</p><p>When an opponent sends Nuisance Puyos to your screen you can try to \"offset\" by clearing your own Puyos and limiting the number that would fall on your screen. This will also increase your Fever Meter. When this meter fills you will be given a set of prearranged Puyos with which you can wrack up giant combos and send tons of Nuisance Puyos to your opponent. When any player's field becomes so full that they can no longer drop Puyos they lose the game.</p><p>The game features a two-player mode. Some versions allow for more people such as the DS version which allows up to eight players to compete in free-for-all or team modes.</p>"}]