[{"name":"R:Racing Evolution","year":2003,"developer":"Namco Limited","url":"microsoft_xbox_r/R-Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6627112102,"score":6.4,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Track racing > Europe > Oceania","desc":"<p><em>R:Racing Evolution</em> is a racing game featuring several modes of gameplay:</p><p><strong>Racing Life</strong>: This is a single player story mode. You play the part of Rena Hayami who begins the story as an ambulance driver. After successfully racing the vehicle to the hospital, you're offered a chance to drive a racecar. Rena's saga to become champion and defeat her rivals will unfold in various cut scenes between races and driving challenges that you must complete. There are 14 chapters total. </p><p><strong>Event Challenge</strong>: There are a variety of racing events you can enter, each with an entrance few you must earn by winning previous challenges. You can also tune up your car or buy new cars.</p><p><strong>Arcade Mode</strong>: Here you can run a single race against computer controlled cars on the track of your choice. You can set several game options, such as the number of laps and rival cars.</p><p><strong>Time Attack</strong>: Choose a racetrack and car, and try to earn the best time!</p><p><strong>VS. Mode</strong>: This is a two player game. Choose a track, and two players race for either the best time or earn the most points.</p><p>The game features a variety of racing options you can set, including brake assist (will automatically brake for you if you enter a turn too fast), transmission types (automatic or manual), race difficulty, and adjustments to your cars performance. There are a variety of cars available, each with unique speed and steering characteristics. You can also unlock more cars by playing Racing Life and Event Challenge. There is also a pressure meter: when driving behind another vehicle, you will begin to apply psychological pressure to the driver which is indicated by a meter above the car. When full, the driver will be very likely to make a mistake giving you an opportunity to pass easily! There is an instant replay option, and you can save your best (or worst!) races for viewing later on.</p>"},{"name":"R/C Helicopter: Indoor Flight Simulation","year":2002,"developer":"Aqua System Co., Ltd."},{"name":"RalliSport Challenge","year":2002,"developer":"Digital Illusions CE AB","url":"microsoft_xbox_r/RalliSport%20Challenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.zip","filesize":6799857987,"score":8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>RalliSport Challenge puts you into the seat of one of 29 different licensed rally cars to compete in 4 different rally race types: Hill Climb, Ice Racing, Rallycross and traditional Rally.</p><p>The cars range from classic Group B cars to modern day Hill Climb monsters and include such unique vehicles as the Beetle Rally Cup Car and the Pikes Peak winning Toyota Tacoma.</p><p>Tracks are located in 8 different locations around the world and each location is highly realistic with modeled objects, swaying trees and grass, moving clouds, animated crowds and animals, breakable and movable objects, bushes that bend when you drive over them, and much more.</p><p>Custom ripped music from your CD collection, an intense Career Mode, 4 player split screen multiplayer, modifiable car settings, car damage/dirt, great sound effects, wide-screen support, Dolby 5.1 support, and more special features.</p>"},{"name":"RalliSport Challenge 2","year":2004,"developer":"Digital Illusions CE AB","url":"microsoft_xbox_r/RalliSport%20Challenge%202%20%28World%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6852902088,"score":8.5,"genres":"Racing / Driving > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>Drive some of the fastest and most robust cars ever to grace mud, gravel, tarmac, ice and snowy race tracks. Prove yourself in the career mode to unlock more tracks and cars to take online and prove yourself. Take part in one of races on Xbox Live! or take part in pre-arranged tournaments and seasons through the XSN Sports website.</p>"},{"name":"Rally Fusion: Race of Champions","year":2002,"developer":"Climax (Brighton) Ltd","url":"microsoft_xbox_r/Rally%20Fusion%20-%20Race%20of%20Champions%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6831957148,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Licensed","desc":"<p><em>Rally Fusion: Race of Champions</em> is a racing game that lets you compete in the Race of Champions and the Nations Cup.</p><p>The Race of Champions is a single event where you race head to head with identical cars on parallel courses. The Nations cup is an off-road cup where up to eight teams race it out in a knock-out competition. Each mode can be raced in three difficulty levels of which the harder two must be unlocked first by finishing the easier class. Each difficulty comes with different cars and adjustments to the tracks. Besides these two main modes the game also comes with: duel, rally, circuit, rally cross, driving, hill climb, elimination and follow-the-leader game modes. Tracks from all over the world are included as well as 30 professional world-class drivers from the featured events.</p>"},{"name":"Rapala Pro Fishing","year":2004,"developer":"Torus Games Pty. Ltd.","url":"microsoft_xbox_r/Rapala%20Pro%20Fishing%20%28World%29.zip","filesize":6848891260,"score":6.4,"genres":"Sports > 3rd-person (Other) > Fishing","desc":"<p>Rapala Pro Fishing takes you through 12 locations such as Mille Lacs Minnesota, Sam Rayburn Texas, Lake Okeechobee, and the Amazon.</p><p>You'll fish for 13 game fish species such as largemouth and smallmouth bass, catfish, muskie, walleye and king salmon. Choose from over 750 Rapala brand lures. A fishing guide will help you if you're not sure what the best lure, location or strategy is.</p>"},{"name":"Rayman 3: Hoodlum Havoc","year":2003,"developer":"Ubi Soft Entertainment Software","url":"microsoft_xbox_r/Rayman%203%20-%20Hoodlum%20Havoc%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6142501933,"score":8,"genres":"Action > Behind view > Platform > Puzzle elements > Fantasy > Comedy","desc":"<p>Globox, a friend of Rayman, has placed the world into a deadly possibility. By eating Andre, the Lord of the Dark Lums, Globox has enraged the Hoodlums, who plan to take back their master no matter what the cost to the world around them. It's up to Rayman to save the day and find a cure to rid the Dark Lord from Globox. </p><p><em>Rayman 3: Hoodlum Havoc</em> is a 3D third-person platform game. Rayman, the main hero, jumps and punches his way through numerous colorful levels, with Globox (and Andre inside him) tagging along and occasionally commenting on the goings-on. Rayman's main weapon is his fist; he can use it to shoot projectiles at the attacking Hoodlums and other foes, and the projectiles are more powerful when the fist is charged by holding down the \"shoot\" button. </p><p>The game is divided into several worlds, each divided into a couple of levels; the game is saved automatically after each level. In between the worlds, the player has to complete a mini-game where he has to surf along light-beams in a psychedelic environment. </p><p>Rayman can also come across power-ups which temporarily give him a special power: the green power-up allows him to shoot tornadoes, the blue power-up gives him the ability to use a grappling hook, the yellow power-up allows him to fly for a short while, the orange power-up allows him to shoot precisely guided missiles and the red power-up grants him a very powerful fist that can bash doors. These power-ups are always necessary to defeat an enemy or a boss, or to get to the next part of the level. </p><p>Rayman can find and free the Teensies locked in cages throughout the level; the freed Teensies will express their gratitude by opening up the next part of the map or by summoning some bonuses to collect. Each six Teensies freed increases Rayman's health bar. </p><p>There are numerous bonuses hidden throughout the levels; completing the levels with lots of score will unlock humorous animations and mini-games. </p><p>The Game Boy Advance <em>Rayman 3</em> links to the Gamecube through the link port, allowing you to play exclusive mini-games on both systems, and download new levels to the GBA.</p><p>The PS3 and Xbox 360 versions are straight ports of the original game with HD textures and a smooth framerate. They also add nine short mini-games.</p>"},{"name":"Rayman Arena","year":2002,"developer":"Ubi Soft Entertainment Software","url":"microsoft_xbox_r/Rayman%20Arena%20%28USA%29.zip","filesize":6627796882,"score":6.5,"genres":"Action > Racing / Driving > Behind view > Side view > Fighting > Fantasy","desc":"<p><em>Rayman Arena/Rayman M</em> is the first multiplayer game in the Rayman series. It's not a platformer like earlier games of the Rayman franchises but a race and arena battle game. The game is divided in five leagues (beginner, advanced, expert, extreme and bonus). The first four have each three racing tracks and three arenas that increase in difficulty.</p><p>The racing mode is split in four different race types:</p><ul><li>Training: for exploration and practice of the racecourse and setting personal records;</li><li>Race: up to four different characters race each other over several rounds with the first one crossing the finish line winning;</li><li>Popolopoï: one must reach the finish line before time runs out. Time can be replenished by shooting some kind of butterflies called Popolopoï and no opponents are to be beaten;</li><li>Lums: over three laps, a certain amount of Lums have to be collected and one must beat the other opponents to the finish line.</li></ul><p>The arena battle mode is split in three different battle types:</p><ul><li>Lum Spring: the first to collect five Lums/crystals or the one with the most Lums when time runs out wins. Ice bullets can be fired at an opponent to temporarily freeze them and beat them to the Lum;</li><li>Lum Fight: all players start with five hit points each that need to be shot off with weapons found around the arena. A point is scored if a player shoots off the last hit point of another player. The first to reach a certain amount of points or the one with the most points when time runs out wins. When killed through one’s own actions, a negative point is scored;</li><li>Capture the Fly: the goal is to find and capture a Light-Fly. The fly follows you around and gives you a point when a certain amount of time has passed. One loses control of the fly when hit by an opponent's bullet. The first to reach a certain amount of points or the one with the most points when time runs out wins.</li></ul><p>Playable characters include:</p><ul><li>Rayman: the series main protagonist. A creature without arms, legs and neck but with hands, feet and a head that can move independently from his body;</li><li>Globox: some kind of frog and Rayman's best friend;</li><li>Teensies: a pair of strange dwarfs working together;</li><li>Tily: a cat-like fairy;</li><li>Admiral Razorbeard: the final boss of Rayman 2;</li><li>Henchman 800: one of the Robo-Pirates from Rayman 2;</li><li>Henchman 1000: an other Robo-Pirate;</li><li>Razorwife: Admiral Razorbeard's wife.</li></ul><p>To unlock rewards such as bonus levels, additional leagues, character skins, and new characters, finishing first in races and arenas is required.</p>"},{"name":"Raze's Hell","year":2005,"developer":"Artech Studios Ltd.","url":"microsoft_xbox_r/Raze%27s%20Hell%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6117644645,"score":7.2,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p><em>Raze's Hell</em> is a unique take on good vs. evil as the player takes control of a monster named Raze as he travels through 20 different lands to free his planet from the cute and cuddly Kewletts. The Kewletts and their leader, the Twisted Princess, is bent on turning the planet and its inhabitants into them at all costs and it's up to Raze to stop them.</p><p>The gameplay mostly consists of traveling around while destroying enemies with weapons such as grenades, sniper rifles and even acid projectiles that Raze spits out of his mouth. The player must also watch out for the Kewletts weaponry which consists of bunny rocket launchers, lollipop axes and even exploding jack in the boxes.</p>"},{"name":"Real World Golf","year":2006,"developer":"Aqua Pacific Ltd.","url":"microsoft_xbox_r/Real%20World%20Golf%20%28USA%29.zip","filesize":6878903563,"score":7.1,"genres":"Sports > Behind view > Motion control > Golf","desc":"<p><em>Real World Golf</em> is a golfing game that makes use of the Gametrak system. The Gametrak is an external piece of hardware that is included with the game. The Gametrak can, through the use of gloves which are connected to it with tiny wires, accurately read out the swing the player makes with the included tiny golf club. It determines the power with which you hit, but also any effects you may put on the ball. The Gametrak can read out speeds ranging from 2000 miles per hour to 1 millimeter per hour.</p><p>Once you start the game you no longer need to use your keyboard or gamepad, all menus can be navigated with use of simple hand gestures. The game itself contains ten 18-hole courses which have to be unlocked one by one. You can play in various modes such as tournament, championship, training and party. Party mode includes several mini games such as hitting cars in the parking lot, hitting a giant bulls-eye in the sky, hitting as close to a target as possible or hitting through hoops. Each game mode can be played against the AI or friends in hotseat multiplayer.</p>"},{"name":"Red Dead Revolver","year":2004,"developer":"Rockstar San Diego, Inc.","url":"microsoft_xbox_r/Red%20Dead%20Revolver%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6334252591,"score":7,"genres":"Action > Behind view > Quick Time Events (QTEs) > Shooter > Direct control > North America > Western > Crime","desc":"<p>Orphaned by bandits and left for dead on the frontier, Red Harlow grew up with a scar burned into his hand and the lust for revenge burned into his heart. Surviving as a bounty hunter in the rough-and-tumble Old West, Red stays ever watchful for some clue that could lead him to the men who murdered his father and mother -- and then one day, that clue appears. Step into Red's spurred boots, and take up his mission of revenge.</p><p><em>Red Dead Revolver</em> features environments and artistry inspired by the classic spaghetti westerns films, mixed with third-person shooter gameplay similar to that of Max Payne. The gameplay and story proceed linearly through stages, including several levels in which you play as different characters (a British trick shooter, a female rancher, a renegade Mexican general, a stealthy native warrior, and a Buffalo Soldier). Each character has his own signature move: for instance, Red's \"Dead-Eye\" slows down time and allows you to set up targets for a rapid \"fan fire\" takedown, while General Diego's flare rifle lets you specify a target for bombardment by Diego's cannons.</p><p>Beating each level will earn you reward money (and chaining together many limb shots and multiple kills will earn you bonus money). You can spend your cash on unlockable characters (for the multiplayer game), journal entries that offer backstory and character info, or an array of canonical Old West weaponry, including pistols, rifles, and shotguns of many varieties, as well as knives, molotovs, poison and dynamite.</p><p>The game features pistol dueling with certain boss characters, as a mini-game mechanic in which you time your draw to an opportune moment and prepare targets as you raise your gun. There is also a multiplayer game (split-screen only, not networked), which you can play with friends and/or AI bots. Multiplayer incorporates a wide array of powerups, an alternative dueling showdown mode, and two kinds of optional poker sub-games (based on stud or Texas Hold 'Em) that mix some strategy into the action.</p>"},{"name":"Red Faction II","year":2003,"developer":"Volition, Inc.","url":"microsoft_xbox_r/Red%20Faction%20II%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6012600787,"score":7,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>Long since the revolt from the mining of Mars, a new group has taken over Red Faction, and their sights are set on the dictator, Chancellor Sopot. Sopot originally created the Red Faction soldiers using a form of nano technology but, fearing they would fight back, ordered them to be destroyed.</p><p>As the leader of the group, your task is to take back freedom that was lost, and save your skin as well as that of those who work with you.</p><p>As was originally designed in the first Red Faction, Geo-Mod builds the world around you as a means to destroy it. Using rockets, mines and the many other weapons available, you can take down walls, blast through doors (therefore deleting the need for a security key) and bring down enemies by destroying the floor that they stand on. Vehicles can also be used to help in your tasks.</p><p>Multiplayer modes are also included for up to 4 players, as well as a collection of bots. As a note, the PC version does not have multiplayer.</p>"},{"name":"Red Ninja: End of Honor","year":2005,"developer":"Tranji Studio","url":"microsoft_xbox_r/Red%20Ninja%20-%20End%20of%20Honor%20%28USA%2C%20Europe%29.zip","filesize":6673359068,"score":5.2,"genres":"Action > 3rd-person (Other) > Free-roaming camera > Stealth > Japan (Ancient/Classical/Medieval) > Martial arts > Regional differences","desc":"<p>The game is set in medieval Japan, at the time of \"warring states\". Shingen Takeda and Nobunaga Oda clans are fighting each other, trying to gain supremacy over the entire Japan. The heroine of the game is a young girl called Kurenai (\"crimson\"), the daughter of a prominent Japanese engineer whose new invention (apparently, a destructive weapon) has drawn the attention of the warring clans. Ninjas sent by Nobunaga Oda attack his workshop, kill him, and leave Kurenai hanging from a tree tied by tetsugen, a piece of wire used by ninjas as a weapon. But a kind woman saves Kurenai, and trains her to be a ninja herself. This is where her quest for revenge begins.</p><p>\"Red Ninja\" is an action game with stealth elements. The primary weapon Kurenai uses is the deadly tetsugen. During the game you'll learn to perform new moves with this weapon. You can also use other weapons, such as a blowgun and throwing knives. Kurenai can jump, hang from ledges, and roll. There is a fair amount of platform-like sequences where she will have to demonstrate her acrobatic ninja technique. An effective way to kill enemies is to use stealth. Kurenai can approach enemies silently and hide behind objects. She can also \"seduce\" enemies, by talking to them in a sexy way and luring them to their death - a move that doesn't always work.</p>"},{"name":"RedCard 20-03","year":2002,"developer":"Midway Games, Inc.","url":"microsoft_xbox_r/RedCard%2020-03%20%28USA%29.zip","filesize":6391111283,"score":7.3,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p><em>Red Card 2003</em> is Midway's soccer title in its extreme sports series. The gameplay is comparable to NFL Blitz or NHL Hitz.</p><p>Players choose from one of 32 international teams and duke it out in the most realistic of Midway's 2003 extreme sports games. This game features full size teams and plays much like a real soccer title until you dropkick one of your opponents to the ground. It doesn't go all out like most of Midway's hard-hitting games, but it definitely stands closer to Midway's extreme sports games than a traditional simulation.</p>"},{"name":"Reign of Fire","year":2002,"developer":"Kuju Entertainment Ltd.","url":"microsoft_xbox_r/Reign%20of%20Fire%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5419720904,"score":6.5,"genres":"Action > 3rd-person (Other) > Shooter > Fantasy > Licensed","desc":"<p>Based on the film of the same name. Play as either a human or a dragon: As a human, you take the role of a resistance fighter, in a 3rd person vehicle-based shooter. As a dragon, you play as a maturing dragon in a 3rd person airborne shooter.</p>"},{"name":"Rent a Hero No. 1","year":2003,"developer":"Aspect Co., Ltd.","url":"microsoft_xbox_r/Rent%20a%20Hero%20No.%201%20%28Japan%29.zip","filesize":6388176332,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fighting > Sci-fi / futuristic","desc":"<p>16-year old Taro Yamada is an average kid, living in the suburbs of Japan with his family. One day, while his parents are hosting a party, Taro ends up with the duty of ordering pizza; the pizza deliveryman arrives bearing not only the meal but an additional gift: the Rent A Hero combat armor. After unwittingly knocking his father out, Taro seeks training from the Sega fighting master Segata Sanshiro and becomes a part-time hero fighting crime and taking odd jobs, eventually going up against the evil Dr. Trouble.</p><p><em>Rent A Hero No. 1</em> is a remake of the 1991 Mega Drive original. The game plays out as an action RPG with a fighting system similar to Spikeout. The player controls Taro Yamada as he takes jobs from the SECA Corporation to pay the equipment fees for his Rent A Hero combat armor. He learns a wide variety of moves throughout the game, but must remember that he can only do anything useful with his power armor, and must make sure he keeps his batteries charged (by purchasing authentic Sanyo-brand batteries at the local convenience store). The game is steeped in Sega references and Japanese culture, with even the game's manual patterned on the comic magazine <em>Big Comic Spirits</em>.</p>"},{"name":"Reservoir Dogs","year":2006,"developer":"Volatile Games","url":"microsoft_xbox_r/Reservoir%20Dogs%20%28Europe%29%20%28En%2CFr%29.zip","filesize":5207083445,"score":6.1,"genres":"Action > Behind view > Shooter > Direct control > Contemporary > Crime > Licensed","desc":"<p>This game, based on the famous Quentin Tarantino movie <em>Reservoir Dogs</em>, fills in the gaps in the movie that are only briefly mentioned (like the robbery at the jewelry store). Throughout the story you get to play all seven main characters, from Mr. Blonde to Mr. White. </p><p>The missions are introduced by game engine cutscenes, which often recreate moments from the film. For example, in the first mission you see Mr. Pink holding his famous monologue \"I don't think we got set up, I know we got set up!\" and then you play Mr. Blue as the police arrives at the jewelry where your goal is to get out alive.</p><p>To do so, you have two choices: be a psychopath and shoot your way out, or try the subtle approach without harming anyone. For instance, if you do not want to harm anyone you can take a hostage and then threaten the police to lay their weapons down and order them to face the wall. There are a few missions in which you must drive a car but mostly you walk through them. Like in the Hitman series, the game shows at the end of every mission how well you have done.</p>"},{"name":"Return to Castle Wolfenstein: Tides of War","year":2003,"developer":"Gray Matter Interactive Studios, Inc.","url":"microsoft_xbox_r/Return%20to%20Castle%20Wolfenstein%20-%20Tides%20of%20War%20%28World%29.zip","filesize":6108762649,"score":7.7,"genres":"Action > 1st-person > Shooter > Direct control > Fantasy > Sci-fi / futuristic > World War II","desc":"<p><em>Return to Castle Wolfenstein: Tides of War</em> is an updated re-release for the Xbox based on the original PC version Return to Castle Wolfenstein. Next to the full, original singleplayer campaign, there are 7 new prologue levels that show how B.J. and Agent One first met and how they got captured and imprisoned at Wolfenstein Castle. There is also a secret bonus awarded at the end of every level when every secret area has been found.</p><p>Next to the original features this port introduces a new shotgun weapon (singleplayer as well as for the Soldier and Engineer in multiplayer games), new equipment (Holy Cross, EMP Device and X-Shield), and new enemies (Occult Priest and X-Shepard). Multiplayer games support a split-screen two-player co-op mode, and matches with up to sixteen players through a system link or over Xbox Live. Downloadable content is also available. As a bonus, a fully playable version of the original Wolfenstein 3D can be played.</p>"},{"name":"Richard Burns Rally","year":2004,"developer":"Warthog Sweden","url":"microsoft_xbox_r/Richard%20Burns%20Rally%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6655595479,"score":7.5,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Off-roading > Track racing > Vehicle simulator > Licensed","desc":"<p>Licensed by the late 2001 World Rally Champion, Richard Burns, this rally game tries to find a niche by adding more depth and realism to the racing experience. This is reflected in the car handling, the influence of the weather and the endless tweaking of the car set-up. There are eight officially licensed cars to choose from, with familiar names such as the Subaru Impreza, Citroen Xsara, Peugeot 206, Mitsubishi Lancer Evo and Toyota Corolla, but you need to unlock them by finishing school lessons, winning a rally or making it to the end of a season.</p><p>Next to the usual training, quick races, rally seasons and multiplayer mode (only 4-player 'hot-seat'), you can test your skills in the Richard Burns Challenge, a time trial mode in which get the chance to go head to head with Burns himself. There are 36 stages in total, divided over six countries. The in-game music has been produced by Paul Oakenfold, Andy Hunter, Pepe Deluxe and the Plump DJs.</p>"},{"name":"Ricochet: Lost Worlds","year":2004,"developer":"Reflexive Entertainment Inc."},{"name":"RoadKill","year":2003,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_r/RoadKill%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6397869222,"score":7.1,"genres":"Action > Racing / Driving > Shooter > Cyberpunk / dark sci-fi > Post-apocalyptic","desc":"<p>Long into the future, where the world is a wasteland full of crime and filth, driving is the only way you can survive. RoadKill is the name of the game, where you build a reputation in your suped-up beast machine of a car, driving it through the burned out city scape of Hell County.</p><p>30 missions are on offer with various objectives (destroy other cars, kill citizens and build alliances with other clans), with your ultimate goal being the leader of the gang that everyone fears.Weapons and upgrades keep your car ahead of the pack, but to do so you need to search out the parts. Scavenger hunts for blueprints is the only way to do so, building the ultimate weapons while improving the speed and reliability of your machine.</p>"},{"name":"Robin Hood: Defender of the Crown","year":2003,"developer":"Cinemaware, Inc.","url":"microsoft_xbox_r/Robin%20Hood%20-%20Defender%20of%20the%20Crown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6734820117,"score":6.4,"genres":"Action > Strategy > 1st-person > 3rd-person (Other) > Isometric","desc":"<p>A complete remake of the classic 1986 title <em>Defender of the Crown</em> (not to be confused with the \"Remastered\" Windows version released in 2002), in <em>Robin Hood: Defender of the Crown</em> the player plays as the legendary folk outlaw in his quest to reclaim the throne of England after Richard Lionheart was captured in the crusades and his brother, John Lackland, usurped the throne and left him for dead in the Holy Land, attracting the ire of several knights. In a heated argument, he considered them to be traitors, causing a civil war to start.</p><p>Several gameplay features were changed from the classic title such as the player being Robin Hood himself (instead of picking one of four pretenders), full 3D graphics, a plot included with the game and the goal being to be the first to reach and conquer King John's stronghold in Cornwall. To do so, the player must build an army large enough to hold enough shires, which generate money from taxes. This money can then be used to hire new troops (peasants, archers, footmen and the mighty knights and catapults) or pay King Richard's ransom, which allow to enlist loyalist knights.</p><p>As with the original game, action occurs in a turn-based map of England where the player decides which actions to take: conquer a neighbouring shire with Little John's army and hire soldiers either for him or territory defense, raid a castle or caravan, build strongholds, hold tournaments or spy on the other lords using Maid Marian's contacts on the court. Each of the attacking actions bring a quick minigame to be played:</p><ul><li>The first mini-game that appears is the archery raid; in this mode, the player sees the action directly from Robin Hood's eyes while he lurks on a tree, the goal being to use Robin's trustworthy bow and arrow to hit cavalry guards and the convoy as they pass by his spot. As some guards are also armed with a bow, Robin can also hide behind the log for cover.</li><li>If the player attacks a guarded territory, the game enters a strategic mode where the battle takes place on a three-lane field, and the goal is to vanquish the enemy defenses of force him to flee by launching direct attacks on each lane.</li><li>Sword fighting pits the player against one or more opponents, depending on the setting. The goal is simple: slash everyone by throwing blows and dodge/parry the opponents' own. During raids there is also a timer that represents the time before sunrise - failing to escape before that or being killed results on Robin's imprisonment.</li><li>Battles are done on a real-time fashion, where both armies are placed on the far-sides of a multi-lane battlefield. The player chooses which lane to attack (or defend) and if successful, the opponent will lose enough units to flee or simply wait for their deaths.</li><li>Jousting in a tournament allows the player to fight for fame, and then for gold and land. To do so, after picking an opponent, he starts by building enough speed, and then slam the spear into the opponent, the goal being to knock him from his horse.</li><li>Some shires are protected by castles, and to conquer them, first a siege must be laid in. This requires the player to load up on catapults and then destroy each wall of the fortification by throwing boulders at it. Each wall represents a part of the defending army: the most damage done, the easier it becomes to invade it.</li></ul>"},{"name":"RoboCop","year":2003,"developer":"Titus Interactive, S.A.","url":"microsoft_xbox_r/RoboCop%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6850903650,"score":5.5,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Crime > Licensed > Regional differences","desc":"<p><em>Robocop</em> places you in the titanium-coated-with-kevlar boots of Alex Murphy, killed in the line of duty and resurrected as the cyborg officer Robocop. The 2003 game features a new plot not featured in any of the films. Crime is up in Neo-Detroit due to the rapid proliferation of a new designer drug \"Brain Drain,\" and the efforts of crime lord William Nexx to control its profitable distribution. Meanwhile, a mayoral race is heating up and getting dirty. And of course, mega-corporation OCP's role in all this is almost certain, but unclear. </p><p>Robocop will have to get to the bottom of all of these mysteries through 9 missions. Gameplay is handled as a typical first-person-shooter, with various Robocop enhancements. His HUD is projected on screen and points out available targets. The player can mark up to three targets with a lock-on button, who Robo will then auto-aim at in sequence. Thermal vision can be activated to see through walls in a limited distance. Multiple weapons are also available, from the signature automatic pistol, to missile launchers and energy weapons.</p><p>Objectives are given for each mission, from rescuing hostages to finding clues. Clues can be examined after each mission to explore the story (also updated through TV news breaks, in the style of the films). If the player can target and shoot a enemy's pistol, they will surrender and can be arrested. Should the player kill a hostage or surrendered enemy, they will take damage, forcing the player to follow Robocop's ethics and \"prime directives.\"</p>"},{"name":"Robot Wars: Extreme Destruction","year":2002,"developer":"Gamezlab","url":"microsoft_xbox_r/Robot%20Wars%20-%20Extreme%20Destruction%20%28Europe%29.zip","filesize":6826585705,"score":"","genres":"Action > Racing / Driving > Simulation > 1st-person > 3rd-person (Other) > Isometric > Arcade","desc":"<p>A sequel to BBC Multimedia's first Robot Wars game, Robot Wars: Arenas of Destruction.This game is based on the TV show Robot Wars. In the game you get to create your own robot, or use robots from the TV show, and battle your way through all the competitions.The sequel brings you 8 new and improved arenas, new weapons, all new robots, and a much improved robot creator.</p>"},{"name":"Robotech: Battlecry","year":2002,"developer":"Vicious Cycle Software, Inc.","url":"microsoft_xbox_r/Robotech%20-%20Battlecry%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6615537040,"score":7.4,"genres":"Action > 1st-person > 3rd-person (Other) > Anime / Manga > Shooter > Flight / aviation > Mecha / giant robot > Sci-fi / futuristic > Licensed","desc":"<p><em>Robotech: Battlecry</em> tells the entire Macross saga of <em>Robotech</em>, from the first contact with the Zentraedi invasion force over the skies of Macross city, to the final battle between human and Zentraedi in the scorched ruins of Earth. The player takes the role of Jack Archer, an ace Veritech pilot in the SDF. His missions range from hunting down and destroying Zentraedi Lieutenants in destroyed cities to defending shuttles traveling through deep space wreckage fields. Characters from the show, voiced by the same actors who did the voices in the <em>Robotech</em> cartoon, will make cameo appearances throughout the game.</p><p>As the game progresses Jack will gain access to new Veritech models, which have different stats but mostly the same abilities. In Fighter mode the Veritech can fire a rapid fire Gunpod bullets or homing missiles as well as drop a decoy pod that will attract enemy missiles. Guardian mode is slower than Fighter mode and loses the ability to drop decoy pods, but can aim Gunpod bullets, gains more powerful missiles, and can pick up mission critical items. Battloid mode can not fly or fire missiles, but can rapidly aim the Gunpod and automatically shoot down enemy missiles. Battloid can also go into sniper mode and hit enemies at a distance with a very powerful charged Gunpod shot. Each mode can be switched between instantly and whenever desired. Medals are awarded for achieving milestones in the game, such as shooting down enemy units or winning boss battles, and these can unlock new Veritech models, paint jobs, and arenas for two-player mode.</p>"},{"name":"Robotech: Invasion","year":2004,"developer":"Vicious Cycle Software, Inc.","url":"microsoft_xbox_r/Robotech%20-%20Invasion%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5423017401,"score":6.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Flight / aviation > Mecha / giant robot > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>In the 21st century, humankind was freed from the confines of the solar system through the discovery of an alien technology known as Robotech. Contact with the stars also brought war with the Invid, a race of parasitic aliens bent on conquering and transforming the Earth into their new home world. Now it is up to the battlehardened survivors of the Robotech Expedition to lead the way for one final attempt to liberate the Earth from the Invid Invaders.</p>"},{"name":"Robots","year":2005,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_r/Robots%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6598976440,"score":6.2,"genres":"Action > Behind view > Platform > Sci-fi / futuristic > Licensed","desc":"<p>A gifted young inventor, Rodney Copperbottom, moves to the big city to realize his dreams of working for his childhood hero, Bigweld. But the latter is mysteriously absent and the corporation is now run by Ratchet and his evil bots. With the help of the Rusties, a group of colourful outmodes who help him discover Ratchet's evil plot, Rodney has to defeat an army of mechanical minions to restore order to the city.</p><p>Following roughly the same plot as the Blue Sky movie, Robots is a classic style third person, 3D platformer where the player control Rodney and battle evil bots, upgrading his various weapons and gadgets along the way. In addition to playing as the movie's hero, the player will also be able to play as his mechanical sidekick, Wonderbot - using him to explore areas that are inaccessible to Rodney. A few levels let you drive the Transport Pod, a giant metal ball Rodney uses as a vehicle. The game takes the player to locations from the movie: Rivet Town, Robot City, Big Weld's Factory, the Outmode Zone, Robot City Sewers, Big Weld's Mansion and Madame Gasket's Chop Shop.</p>"},{"name":"Rocky","year":2002,"developer":"Rage Games Ltd.","url":"microsoft_xbox_r/Rocky%20%28USA%29.zip","filesize":6736995938,"score":7.8,"genres":"Sports > 3rd-person (Other) > Full Motion Video (FMV) > Boxing > Licensed","desc":"<p>Based on the famous movie series of the same name about good boxer Rocky Balboa (played by Sylvester Stallone).</p><p>The boxing simulator game has several modes, including Movie Mode, Exhibition and Knockout Tournament. In Movie Mode you can follow the movie series, starting each part with three minor opponents and finishing the big boss in the end. Each character has personal weaknesses. Also you can train Rocky prior to each fight.</p>"},{"name":"Rocky: Legends","year":2004,"developer":"Venom Games","url":"microsoft_xbox_r/Rocky%20Legends%20%28World%29%20%28En%2CFr%2CDe%29.zip","filesize":6558368837,"score":7.2,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing > Licensed","desc":"<p>Be Rocky, Apollo Creed, Clubber Lang, or Ivan Drago in this fighting game prequel to the movie series.  Using classic Rocky characters, locations, and music, Rocky: Legends puts the player in the boxing, ring recreating or rewriting the careers of the boxing franchise's heroes and villains.  </p><p>Play the career mode or jump into a 1-2 player slugfest. As you progress through the career mode, you must train to improve your skills just like a professional would, and use your fight purse to unlock more playable characters, arenas, movie trailers and more. Combinations of punches can be executed powerfully.</p>"},{"name":"Rogue Ops","year":2003,"developer":"Bits Studios Ltd.","url":"microsoft_xbox_r/Rogue%20Ops%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6303804231,"score":6.5,"genres":"Action > 3rd-person (Other) > Quick Time Events (QTEs) > Stealth > Spy / espionage","desc":"<p>In <em>Rogue Ops</em> you control Nikki Connors; after your family is killed by terrorists, you are recruited into the covert anti terrorist group Phoenix. Now you are seeking revenge on Omega 19, the terrorist group which you suspect is responsible for your family's death. There are eight missions to complete which have a combination of action and puzzle solving elements. You will often need to use stealth to be successful, making sure you quietly infiltrate an area without being seen, or if you are seen making sure no one sounds an alarm.</p><p>You can hide in the shadows, in crates and vents, hang from the ceiling, and sneak up on guards to kill them before they see you. Of course, when action is required, there are a wide variety of weapons that will be used throughout the game; some weapons you'll come across are a pistol, a rifle, a crossbow, grenades, proximity mines, and more. There are three different difficulty levels available.</p>"},{"name":"Rogue Trooper","year":2006,"developer":"Rebellion Developments Ltd.","url":"microsoft_xbox_r/Rogue%20Trooper%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6267526057,"score":6.9,"genres":"Action > Behind view > Shooter > Direct control > Cyberpunk / dark sci-fi > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>A planned attack on Nu Earth goes wrong when a General turns traitor resulting in the massacre of Rogue's comrades.</p><p>The game starts with Rogue and his comrades launched from a drop-ship.  They come under fire from the Norts due to the information that had been leaked by the General.  Upon landing the first mission is a tutorial in how to use Rogue’s skills and also the Bio-chips of Gunnar and then Bagman.  The third Bio-chip of Helm is received in a later mission.  The Bio-chips have their own abilities.  Gunnar is stuck to the side of Rogue’s rifle and can be used as a sentry while Rogue flanks the enemy.  Bagman provides ammunition and upgrades for Rogue’s equipment made from salvage collected along the way and also looks after his health.  Helm is used for accessing computer consoles and panels allowing Rogue access into prohibited areas.</p><p>Rogue works his way through the various levels as stealthily as is possible trying to take the Norts by surprise with kill moves but with the arsenal at his disposal he is quite capable of also unleashing hell and going toe to toe with the enemy.  Tracking the traitor General, Rogue eventually catches up in the final mission with an abundance of Norts trying to stop him.</p><p>The game is identical across all platforms allowing the user to create numerous profiles and using a checkpoint save feature ensuring that you don’t have to go too far back in the level if you get Rogue killed.  There are 3 different skill levels (Normal, Hard and Massacre) which when completed will unlock cheats.The Windows version uses a combination of keyboard (reconfigurable) and mouse, the mouse being essential for aiming and firing.The Xbox and PS2 versions are identical using the left thumb-stick for movement and the right thumb-stick for aiming and right trigger / shoulder button for firing with the other buttons used for various other actions such as weapon changing or grenade throwing.</p><p>Within each platform, multiplayer is available with the option to play as Rogue, Helm, Gunnar and Bagman, each character having their own attributes.  There are 5 arenas of either Stronghold or Progressive.  Each map will have an objective such as defending for a certain amount of time against waves of Norts on Stronghold or getting to an objective point on Progressive maps.  High scores will be saved with the user’s profile.</p>"},{"name":"RollerCoaster Tycoon","year":2003,"developer":"Chris Sawyer Productions","url":"microsoft_xbox_r/RollerCoaster%20Tycoon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6825416859,"score":6.7,"genres":"Compilation > Regional differences","desc":"<p><em>RollerCoaster Tycoon: Gold Edition</em> is a compilation of the theme-park management title <em>RollerCoaster Tycoon</em> with its expansion packs. Altogether, this package includes the following:</p><ul><li>RollerCoaster Tycoon (base game)</li><li>RollerCoaster Tycoon: Corkscrew Follies (first expansion pack)</li><li>RollerCoaster Tycoon: Loopy Landscapes (second expansion pack)</li></ul><p>Despite being called <em>RollerCoaster Tycoon</em>, the Xbox version also includes both add-ons. This is the first release on that platform.</p>"},{"name":"Rolling","year":2003,"developer":"Rage Games Ltd.","url":"microsoft_xbox_r/Rolling%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6659727343,"score":"","genres":"Sports > Behind view > Tricks / stunts","desc":"<p>Rolling is a game about the exciting world of inline skating.There are 21 of the world's best skaters to choose from, plus a few hidden ones as well. You can also create a custom character from scratch if the ones provided aren't good (or good-looking) enough. All the clothes and equipment are from real life, so expect to see your favorite skates and street clothes on those created skaters.Players can take their skater through 10 big outdoor city themed levels, 4 different competitions and even make their own levels with a handy level editor. There are a plethora of licensed music from the bands such as The Hives, Chuck D and Del Tha Funky Homosapien.</p>"},{"name":"Room Zoom: Race for Impact","year":2003,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_r/Room%20Zoom%20-%20Race%20for%20Impact%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6705862569,"score":"","genres":"Action > Racing / Driving > Behind view > Contemporary","desc":"<p><em>Room Zoom: Race for Impact</em> is an arcade racing game where you race across a house called the Room Zoom manor.</p><p>The game can be played in single player (including a championship), multiplayer and online. A roster of sixteen cars is available as well as eight tracks. Not all cars and tracks are available at the start of the game and have to be unlocked. While racing across the house the player can pick up power-ups. These include a shield, nitro, fire ice and lighting. Two bonus modes are also included: car soccer and domination mode.</p>"},{"name":"Rugby 06","year":2006,"developer":"Electronic Arts Canada","url":"microsoft_xbox_r/Rugby%2006%20%28Europe%29.zip","filesize":6777092096,"score":7.4,"genres":"Sports > 3rd-person (Other) > Direct control > Rugby > Licensed","desc":"<p><em>Rugby 06</em> is another update to EA Sports' rugby franchise.</p><p>As ever, the game featured updated teams and squad lists. New features include an overhaul of the tackle and off-load systems and enhanced weather graphics. The BBC's Ian Robertson and former All Black Grant Fox provide commentary, with additional comments from Murray Mexted.</p><p>The majority of the world's major tournaments are licensed including the Six Nations, Tri-Nations, Super 14 and Guinness Premiership competitions.</p>"},{"name":"Rugby 2005","year":2005,"developer":"HB Studios Multimedia Ltd.","url":"microsoft_xbox_r/Rugby%202005%20%28Europe%29.zip","filesize":6779461377,"score":7.3,"genres":"Sports > 3rd-person (Other) > Direct control > Rugby > Licensed","desc":"<p><em>Rugby 2005</em> is the first update to EA Sports' rugby franchise. The game is now powered by EA's FIFA engine. Features include overhauled gameplay, motion captured animation, crowd chants for major stadiums, and unique heads for famous players. The BBC's Ian Robertson and former All Black Murray Mexted provide commentary. Mexted also guides the player through extensive interactive training drills.</p><p><em>Rugby 2005</em> includes up to date listings for all the major international teams, plus options to edit squads and create new players. Players can compete in tournaments such as the 6 Nations, Tri Nations, Super 12 and European Trophy championships.</p>"},{"name":"Rugby Challenge 2006","year":2006,"developer":"Swordfish Studios Limited","url":"microsoft_xbox_r/Rugby%20Challenge%202006%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6131195678,"score":"","genres":"Sports > Managerial / business simulation > Rugby > Licensed","desc":"<p><em>Rugby Challenge 2006</em> is a single player game which contains both rugby simulation and managerial features. The game has multiple game modes:* Friendly: in which the player can play as any club against an any other club</p><ul><li>Competition: which features the World Championship, the RBS 6 Nations, Three Nations, European Cup, a Tour, Leagues, and Cups.<br>In the Tour the player can select any of the international teams represented and tour Europe, Oceania, Africa, or America with differing numbers of nations to play against in each location.<br>The Leagues available include the English Premiership, the Top 14 (France), the Celtic League (now, 2015, called the Pro 12 and featuring teams from Ireland, Italy, Scotland and Wales), and the Southern League which comprises teams from New Zealand, Australia and South Africa. There is also an option to create a custom league.</li></ul><p>The Cups that can be competed for mirror the leagues that can be played in, they are the English Cup, French Cup, Celtic Cup, Southern Cup, Super Cup and again there is an option to create and compete for a custom cup.</p><ul><li><p>Challenge: There are five game options in this category.</p><ul><li>Classic Matches. South Africa had been undefeated for sixty years when New Zealand brought that run to an end in 1956. In the first challenge the player controls the South African team and tries to prevent the defeat. There are ten 'Classic Matches' in all, the remaining nine are locked until the first challenge has been completed, they include playing as Scotland and trying to beat England; playing as the British isles and trying to neat New Zealand; playing as the USA and trying to beat France; playing as Wales and trying to beat Ireland.</li><li>Try Survival: The player competes in a series of matches which become progressively more difficult and must score an increasing number of tries in each</li><li>Hot Potato: A variation on the standard game where a player cannot hold the ball for more than three seconds, any player that does gets hit hard.</li><li>Old Time Rugby: Here games are played under old rules where no points are scored for a try, they can only be scored from the penalty that follows.</li><li>Superstars: In this variation of the standard game only one nominated player from the players team can score points.* Career Mode: This is a rugby management side of the game where the player takes control of a team in Division Four of a mythical league and must manage them through the seasons to become a champion team. Players can be traded, and trained, the clubs finances need to be managed, coaches appointed etc.</li></ul></li><li><p>The game also has a training mode and many bonus features such as additional stadiums, teams, balls and game effects all of which are locked until the player achieves specific goals.</p></li></ul><p>Matches can be three, five, seven or fifteen minutes long, can be played during the day or night, have weather effects and use one of the three difficulty settings Fun, Normal or Intensive Care.</p>"},{"name":"Rugby League","year":2003,"developer":"Sidhe Interactive","url":"microsoft_xbox_r/Rugby%20League%20%28Australia%29.zip","filesize":6607411514,"score":"","genres":"Sports > 3rd-person (Other) > Rugby > Licensed","desc":"<p><em>NRL Rugby League</em> is a New Zealand-developed rugby sports game in the tradition of console based sports titles. It features 30 licensed teams, several major leagues and interantional test matches, 25 realistic stadiums, commentary by Andrew Voss, variable weather conditions, and all the action on the field you would expect from a game based on the sport, including advanced moves such as offloads, fend offs, side steps and dummy passes. You can create your own players, teams and competitions, with detailed statistics, and you have to take injuries, sin bins and send offs into account.</p>"},{"name":"Rugby League 2","year":2006,"developer":"Sidhe Interactive","url":"microsoft_xbox_r/Rugby%20League%202%20%28Australia%29.zip","filesize":6378098597,"score":"","genres":"Sports > 3rd-person (Other) > Rugby > Licensed","desc":"<p><em>Rugby League 2</em> is the sequel to the highly successful NRL Rugby League. The sport is similar to rugby union, but features set tackles rather than rucks and mauls - once a player is successfully tackles he plays the ball back to a team-mate behind him, with the team losing possession if tackled 6 times.</p><p>The game features more teams, more stadiums and more competitions than the original, as well as extra graphic detail including motion capture and realistic player appearances. Also added is the franchise mode, allowing the player to control a team in the NRL or Super League for ten years, and online multiplayer.</p>"},{"name":"Run Like Hell","year":2003,"developer":"Digital Mayhem"}]