[{"name":"Samurai Shodown V","year":2006,"developer":"Yuki Enterprise","url":"microsoft_xbox_s_part1/Samurai%20Shodown%20V%20%28USA%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6754530176,"score":6.2,"genres":"Action > Side view > 2D scrolling > Anime / Manga > Fighting > Japan (Modern/Futuristic)","desc":"<p>Seven years after the fourth game in the series, <em>Samurai Shodown</em> returns. In the game's time frame, this is the earliest game, hence the Japanese title <em>Samurai Spirits Zero</em>. It takes place in 1786 from January through the later summer. The game is therefore considered a prequel to the series.</p><p>The overall gameplay was slightly altered. It is a little faster, and the Slash/Bust system has been removed. Each character now has only one version, or the Bust mode is simply replaced by a new character of very similar setup. Combo slashes, sidestepping and fatalities have also vanished. The basic moves have been modeled after the first games in the series. They consist of three types of slashes, a single kick, and various dodge maneuvers similar to Samurai Shodown II.</p><p>There are 24 characters, a familiar cast with some new faces. Unlike the previous games, it is not possible to kill your opponent.</p>"},{"name":"Samurai Warriors","year":2004,"developer":"Omega Force","url":"microsoft_xbox_s_part1/Samurai%20Warriors%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":4762183766,"score":7.1,"genres":"Action > 3rd-person (Other) > Arcade > Hack and slash > Historical events > Japan (Ancient/Classical/Medieval)","desc":"<p>Samurai Warriors is Koei's extension of the popular Dynasty Warriors series.  Instead of taking place during the Three Kingdoms era in China, Samurai Warriors takes you back to feudal Japan, during the warring states era.  In the game, you take control of actual historical figures such as Yukimura Sanada, Nobunaga Oda, and Hattori Hanzo.  Altogether, there are fifteen characters, ten of whom need to be unlocked.</p><p>Basically, gameplay is almost identical to that of Dynasty Warriors.  The main differences are things like the inclusion of indoor castle levels, and a greater variety of enemies.  In Dynasty Warriors, enemies were basically either soldiers or archers.  In Samurai Warriors, there are soldiers, archers, musketeers, and many different types of ninjas.  In terms of story, there are basically only five levels, but depending on your actions in a certain level specific to each character, the story will branch of into two different stories, leading to a good ending or a not as good ending.  Updated graphics and a more \"techno-ish\" soundtrack top off the additions.</p>"},{"name":"Scaler","year":2004,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_s_part1/Scaler%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6440926531,"score":6.8,"genres":"Action > 1st-person > 3rd-person (Other) > Platform","desc":"<p>Bobby Jenkins lives next door to Leon a scientist on the verge of discovering a device that can stabilize and control portals that connect the planets within the multiple universes. Leon is transported to weird dimension during his experiments where the evil Looger and his cohorts steal the portal travel technology and uses it to break into our world to perfect the technology. Once here, they are discovered by Bobby who is captured and questioned about Leon’s work. Bobby manages to escape and is teleported to their world where the story takes place.</p><p><em>Scaler</em> is an action platform game in which the player controls Bobby Jenkins, who turns into a lizard in the “bizarre dimension” and tries to stop the evil Looger and his cronies. Scaler has many abilities, such as climbing walls to reach new areas and riding vines to charge up his electric bomb attack. He can use camouflage to sneak by deadly traps and confuse your enemies. Scaler attacks with his tongue or claws, which can be upgraded during the game. The Electric Bomb attacks several enemies at once. Scaler can also transform into some of the enemies he defeats after defeating enough of them and use the special abilities of that creature.</p><p>The player can break open cocoons and shells to collect Klokkies and Crystal Gems which in turn can be used to get new abilities and upgrade existing ones. If the player collects 100 Crystal Gems in the game, an alternate ending will be shown. Lizard Eggs can be gathered to unlock more levels and to keep Looger form mutating them into monsters. The game also features a picture gallery; as the player accumulates Crystal Gems more pictures become available.</p>"},{"name":"Scarface: The World Is Yours","year":2006,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_s_part1/Scarface%20-%20The%20World%20Is%20Yours%20%28USA%2C%20Europe%29.zip","filesize":5773263967,"score":7.3,"genres":"Action > Racing / Driving > 1st-person > Behind view > Sandbox / open world > Shooter > Direct control > Licensed > Regional differences","desc":"<p>Miami in the '80s: gangs, drugs and hookers dominate the scene and a Cuban called Tony Montana rises up to be the most powerful drug dealer, controlling the whole of Miami. This is the story of the 1983 movie <em>Scarface</em> in which Tony Montana dies during a attack from a rival gang on his mansion at the end. The game now puts the player in the shoes of Tony a few moments before the gang hits his office.</p><p>After he successfully defends his mansion, his empire lies in ruins. But Tony wouldn't be Tony Montana if he would just give up, so it is the player's goal to reclaim Miami once again. To do so, he has to earn money and respect. The only way to earn money in Miami is to deal drugs. At the beginning the stuff is bought in small amounts and personally sold to the dealers. Eventually, however, Tony can set up so-called \"Fronts\" which are legitimate shops (like a car seller) in which drugs are sold in very large amounts. By overtaking \"Fronts\", Tony also increases his control over the current district of Miami. To completely overtake one part of town, all the enemy gangs scattered around in small groups must be eliminated.</p><p>After a deal, Tony has to launder the money at the local bank and have it transferred to his account. He then can buy \"exotics\" for his mansion like an expensive vase or a new car with a driver.</p><p>When talking with a dealer or trying to get cop heat down, the player has to play a mini-game that determines if Tony is successful and if so, how much he gets for the drugs or how much heat he loses.</p><p>Respect is earned by increasing Tony's territory, buying exotics and earning \"balls\" in fights and while driving. The enemies have different target zones which give a different amount of balls on a hit. This also fills up Tony's 'ball-meter\". Once this is full he can enter a kind of god mode in which he is invulnerable and has unlimited ammo. Tony also gets health when killing someone in this mode. If he is driving a car he gets balls when making stunts like driving on the wrong side of the road or dodging an incoming car.</p><p>As in Grand Theft Auto: Vice City, the player is free to roam the city of Miami and there are also some side-missions with racing events.</p>"},{"name":"Scooby-Doo!: Mystery Mayhem","year":2004,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_s_part1/Scooby-Doo%21%20Mystery%20Mayhem%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6053857462,"score":6.5,"genres":"Action > Adventure > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>The gang is at it again!  This time, Mystery Inc. must stop an evil business tycoon who has used a device called the Tome of Doom and release monsters from another dimension to distract the gang from what is going on.  They must grab the Tome and send the monsters back to where they came before it's too late.</p><p>The player takes control of Shaggy and Scooby with the ability to switch between the two, each with their own special abilities to set traps and capture monsters, and wearing disguises to sneak past them as well.  The gameplay is mostly consisted of puzzle-solving (i.e. moving objects into certain spots to open doors) and players can explore a movie set, The Wild West, a bayou and a laboratory.</p><p>Features the actual voices of the Scooby Doo cartoons and features artwork and stills of the shows.</p>"},{"name":"Scooby-Doo!: Night of 100 Frights","year":2003,"developer":"Heavy Iron Studios, Inc.","url":"microsoft_xbox_s_part1/Scooby-Doo%21%20Night%20of%20100%20Frights%20%28USA%29.zip","filesize":6386063528,"score":7.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p>Scooby, Shaggy, Fred, Daphne and Vilma arrive at 'Mystic Manor' to meet Daphne's friend Holly. There she explains that her inventor-uncle is missing. Soon the rest of the gang ends up missing too and alone as Scooby you must find them all, and along the way solve the mystery of the Mastermind. This guy has brought back the gangs old fiendish villains and is probably the cause of all the havoc.</p><p>The levels have you running, jumping and swinging around, all the while taking out baddies, collecting scooby snacks and finding secret passages. You also have to locate special inventions scattered around the place, that can give Scooby extra capabilities.</p>"},{"name":"Scooby-Doo!: Unmasked","year":2005,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_s_part1/Scooby-Doo%21%20Unmasked%20%28USA%2C%20Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6347664463,"score":6.7,"genres":"Action > 3rd-person (Other) > Puzzle elements > Detective / mystery > Licensed","desc":"<p>Fred brings the rest of Mystery, Inc. along to meet his cousin, Jed, who works at the Monstrous Fright &amp; Magic. MFM is a special effects company that creates monster costumes with a special formula they invented called, “Mubber”, that makes the costumes seems so real that the wearer literally becomes the actual monster. When they arrive, they found the location in shambles. Winslow Stanton, the creator of Mubber and owner of MFM, told them someone has stolen the Mubber formula and by using it with their animatrons, destroyed the building and disappeared. He believes it is Jed’s doing because he, too, disappeared. Looks like it’s up to Scooby and the gang to find Jed, destroy the costumed monsters and unmask the truth behind this great mystery!</p><p>In <em>Scooby-Doo! Unmasked</em>, you will guide Scooby to help Mystery, Inc. uncover clues, fight monsters and occasionally save your friends from danger. You will be visiting many several worlds including a China Town and a museum. You will encounter various monsters like the Chinese Zombie and the Black Knight and the only way to get past them is by attacking them with your spin, slide, roll and smash attacks! Also, by collecting mubbers, you can create special costumes that will give you special powers. For example, with the Kung Fu Costume, you will be able to move around with greater agility and force. Be sure to watch your health level which is indicated by the number of Scooby Medals you have. If you reach zero, you will restart at the last save point but you can restore your health by collecting enough Scooby snacks that can be found throughout the game. Also, by collecting food items you can get Shaggy to cook you a special meal that will increase the total number of medals you have.</p><p>In each world, when you’ve collected enough clues, Velma will ask you a few questions in order to figure out who is behind everything, and you must select the clues that you feel will answer these questions. When that’s completed, you will have to fight a boss before Velma will reveal who the identity of the villain.</p><p><em>Scooby-Doo! Unmasked</em> can be saved at any point in the game simply by selecting Save Game in the Pause Menu. You can also turn on the Autosave function which will enable the game to automatically save at different points. You can replay any level as many times as you want so you can collect any missing items you still lack. In the extra menu, you will find Bonus Arts that features various conceptual art pieces used in the making of the game.</p>"},{"name":"SeaBlade","year":2002,"developer":"Vision Scape Interactive, Inc.","url":"microsoft_xbox_s_part1/SeaBlade%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":5736882558,"score":6.1,"genres":"Action > Behind view > Arcade > Shooter > Sci-fi / futuristic","desc":"<p>Seablade is an action/arcade game similar to a 3D version of the old classic Choplifter, with a strong storyline and white knuckle arcade shooter action to add to the gameplay.</p><p>With Earth's northern hemisphere submerged due to a massive subterranean earthquake of biblical proportions, and three tyrannical despots oppressing and exploiting the populations, SeaBlades are sent to liberate the oppressed, crush the tyrants and investigate an unknown power.</p>"},{"name":"Second Sight","year":2004,"developer":"Free Radical Design Ltd.","url":"microsoft_xbox_s_part1/Second%20Sight%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6442219000,"score":7.3,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Stealth > Sci-fi / futuristic > Detective / mystery","desc":"<p>After waking up in a high security medical facility with no recollection of how he got there, John Vattic's memory slowly returns through a series of playable flashbacks to his days as a civilian advisor to a military operation in Siberia. In the past, he worked with a group of soldiers known as WinterICE, attempting to locate an elderly scientist who has been conducting research into psychic powers. In the present, John attempts to piece together what he remembers and locate members of WinterICE in the hope that he can clear his name, work out what actually happened, and discover how he came to have psychic powers himself.</p><p><em>Second Sight</em> is a 3D shooter with stealth elements. The player mostly controls John from a third-person perspective, though it is possible to switch to first-person view under certain circumstances. During the course of the game the player gets to use telekinesis, healing, charm, projection and possession powers and two types of psychic attack, plus a variety of weapons. Most situations can be tackled with stealth, mindless violence or psychic powers, or a combination of the three.</p>"},{"name":"Secret Weapons Over Normandy","year":2003,"developer":"Totally Games, Inc.","url":"microsoft_xbox_s_part1/Secret%20Weapons%20over%20Normandy%20%28Europe%29.zip","filesize":6468698463,"score":7.5,"genres":"Action > Behind view > Flight / aviation > Historical events > World War II","desc":"<p>In Secret Weapons Over Normandy, you take the role of James Chase, an American pilot who joins a secret elite squadron of Royal Air Force pilots during World War 2. As a member of the Battlehawks, you must take part in missions in several war theaters including Western and Eastern Europe, North Africa and the Pacific, experiencing historical battles and encounters like the Battle of Britain, Stalingrad, D-Day and the Battle of Midway. The primary enemy of the Battlehawks is their German Luftwaffe counterpart, called Nemesis.</p><p>The game features over 20 flyable historical aircraft, 15 campaign missions and 20 optional \"challenge\" missions. Between missions, the player's plane can be upgraded with things like better armor and engines. The game also features unlockable bonuses like new planes and movies.</p>"},{"name":"Sega GT 2002","year":2002,"developer":"Wow Entertainment, Inc.","url":"microsoft_xbox_s_part1/Sega%20GT%202002%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6742980447,"score":7.4,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator","desc":"<p>Race everything from street-legal 60hp $6,000 cars to 350hp $150,000+ race cars bought with prize money. Earn money by winning races in theme race mode or career mode. After finishing all career mode races in a set players will be challenged to a license test in a stock car, and completing it will unlock more career races as well as increase the rewards and competition in special races. Players have their own personal garage to display trophies and decorations. New parts can be purchased for cars, improving their performance, however over several races parts and tires will degrade and need to be repaired or replaced.</p><p>Outside of career mode players can also play the Chronicles mode, which challenges players to bring bring a single car from the 1970s through several races against cars of different eras. Winning races in a high position reward points that are used to buy upgrades between races, and completing every race, either for a single car for or an entire decade of races, will unlock additional cars in quick race mode.</p>"},{"name":"Sega GT 2002 / JSRF: Jet Set Radio Future","year":2002,"developer":"","url":"microsoft_xbox_s_part1/Sega%20GT%202002%20%2B%20JSRF%20-%20Jet%20Set%20Radio%20Future%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5881290461,"score":"","genres":"Compilation","desc":"<p>This twin pack contains:</p><ul><li>Sega GT 2002</li><li>JSRF: Jet Set Radio Future</li></ul><p>It came bundled with the Xbox console and was never released for sale as a stand-alone title.</p>"},{"name":"Sega GT Online","year":2003,"developer":"Wow Entertainment, Inc.","url":"microsoft_xbox_s_part1/Sega%20GT%20Online%20%28Europe%29.zip","filesize":6710133711,"score":6.9,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>An online update of Sega GT 2002. Race 165 cars from the 50s to the concepts either in the classic GT 2002 mode or against human players on Xbox Live. </p><p>In GT 2002 mode, the player must work their way up the hill by first buying a cheaper car and winning cash or prize cars in order to acquire better vehicles. <em>SEGA GT Online</em> adds new parts and new cars to the shop, and allows the limited slip differential to be modified. Prize money and prices have been modified as well, and new tracks, including a facsimile of Laguna Seca, reverse tracks, and races set in the morning, evening, and night, have been added to the returning races.</p><p>The player can jump right in the action by selecting a car, from a Chevelle to a Fiat, then a track location, from an American desert to a European village. In addition to the returning Chronicles mode there is also now a Gathering mode with 30 check point, license test, and racing line challenges. As with Chronicles each completed challenge unlocks a car for purchase in GT 2002 mode.</p><p>Online, players could participate in races with other human players, or trade parts with them. As Xbox Live has been shut down this mode is no longer accessible.</p>"},{"name":"Sega Soccer Slam","year":2002,"developer":"Black Box Games","url":"microsoft_xbox_s_part1/Sega%20Soccer%20Slam%20%28Europe%29.zip","filesize":6577371183,"score":7.7,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer","desc":"<p>This is soccer, the Sega way. Instead of the usual technical football we are used to, Soccer Slam presents 3 on 3 soccer with a collection of crazy, over the top characters and special moves to create a non-stop action atmosphere.</p><p>Using elements similar to EA Sports' NBA Street, Soccer Slam also contains power ups to increase the zany gameplay even further. Game modes include Quick Start, the Continental Cup Quest plus a practice mode and a Tourney multiplayer mode.</p>"},{"name":"Sensible Soccer 2006","year":2006,"developer":"Kuju Sheffield","url":"microsoft_xbox_s_part1/Sensible%20Soccer%202006%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6601756498,"score":6.5,"genres":"Sports > Diagonal-down > 2D scrolling > Football (European) / Soccer","desc":"<p>After many years of silence, <em>Sensible Soccer</em> has returned. As with the original 1992 game, <em>Sensible Soccer 2006</em> is a fast-paced football game viewed from a bird's perspective (although the camera has been slightly tilted). The control has gone from one button to three buttons, as you use one for shooting, another for passing and the third for sprinting. In addition to that you use the stick on gamepads to aim and to apply the famous after-touch.</p><p>The game contains a total of around 350 different teams (international and club teams) and 50 preset competitions. If that is not enough, players can create their own custom teams. This is the career mode of the game. The objective is to create a squad of rookie players and take them to the top of the team rankings. As you succeed you will earn skill points that can be used to increase the quality of your team.</p><p><em>Sensible Soccer 2006</em> offers multiplayer matches (no online play though) for up to four players at once (in which two players share the control of a team). Another feature left from the original game is the possibility for players to create their own competitions - leagues, cups and tournaments.</p>"},{"name":"Serious Sam","year":2002,"developer":"Croteam","url":"microsoft_xbox_s_part1/Serious%20Sam%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6632699717,"score":7.3,"genres":"Action > 1st-person > Shooter > Direct control","desc":"<p>This version of <em>Serious Sam</em> is based on Serious Sam: Gold, with several notable differences. Like the Gold Edition, it features levels from both first and second chapters; the weapons from the second part can be used when playing the levels of the first one as well. The levels are generally somewhat smaller than in the PC release. </p><p>The most significant change comes in the form of a life system. Scoring 100,000 points grants the protagonist an additional life, allowing him to respawn at the same place after having been killed, rather than forcing the player to return to the last checkpoint. Combo points are awarded for executing specific attacks rapidly, contributing to the overall score. The save system has been somewhat modified, with telephone booths representing checkpoints.</p>"},{"name":"Serious Sam II","year":2005,"developer":"Croteam","url":"microsoft_xbox_s_part1/Serious%20Sam%20II%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6774760799,"score":7.1,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Sci-fi / futuristic > Comedy","desc":"<p><em>Serious Sam II</em> is the sequel to Serious Sam is an equally un-serious first-person shooter with everything blown out of proportion. It offers huge levels with hundreds of opponents, funny worlds with various themes, a vivid colour palette, lots of big guns and some of the largest bosses around (including a giant gorilla, bee, skeleton, dragon and robot). Sam \"Serious\" Stone must fight through the minions of evil mastermind Mental to collect the five pieces of a medallion which will allow him to harm Mental himself.</p><p>The game is based around DOOM's more simple approach to gameplay with a dose of old school game design featuring score, a life-count and extra lives. The outrageous enemies come in waves, dozens at a time, ammo for the basic weapons is plentiful and action almost never ceases. Sometimes a dinosaur, various vehicles (including a flying saucer) and static guns can be mounted to lay waste to Mentals hordes. Weapons include a revolver, shotgun, circular saw, plasma gun, sniper rifle, Uzi, rocket launcher grenade launcher, mini gun, canon and a serious bomb. The game's engine combines support for a high model count on screen at any given time with a long draw distance.</p>"},{"name":"Shadow of Destiny","year":2002,"developer":"Konami Computer Entertainment Tokyo, Inc."},{"name":"Shadow Ops: Red Mercury","year":2004,"developer":"Zombie Studios Inc.","url":"microsoft_xbox_s_part1/Shadow%20Ops%20-%20Red%20Mercury%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6212281580,"score":6.4,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Shadow Ops: Red Mercury</em> is an action-driven first person shooter set in the near future. The player controls a Delta Force operative who has to stop the creation of nuclear weapons by tracing a substance called Red Mercury. The gameplay has a large amount of actions sequences and scripted events. The Xbox version supports online multiplayer for up to sixteen players.</p>"},{"name":"Shadow the Hedgehog","year":2005,"developer":"SEGA Studios USA","url":"microsoft_xbox_s_part1/Shadow%20the%20Hedgehog%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6493690775,"score":5.5,"genres":"Action > 3rd-person (Other) > Free-roaming camera > Platform > Shooter > Direct control > War","desc":"<p><em>Shadow the Hedgehog</em> is a Sonic the Hedgehog series spin off title. Players take the role of Shadow the Hedgehog, Sonic's Nemesis from Sonic Adventure 2. Shadow must fight his way through many levels to unveil the secrets of his past. Will he choose to join Dr. Eggman or the Black Arms? Or will Shadow decide to fight only for himself and nobody else to discover the true meaning of Shadow's past? The choice is yours and only you can make it.</p><p>Playing as Shadow, you have many new abilities that Sonic does not have. For one, you can use a gun. You also have hover shoes instead of Sonic's plain old running shoes. You can follow whichever path you choose to follow to discover Shadow's true identity. You can collect the Chaos Emeralds or you can help Robotnik or the Black Arms. Depending on what path you choose, you will have a different ending.</p>"},{"name":"Shamu's Deep Sea Adventures","year":2005,"developer":"Sand Grain Studios","url":"microsoft_xbox_s_part1/SeaWorld%20Adventure%20Parks%20-%20Shamu%27s%20Deep%20Sea%20Adventures%20%28USA%2C%20Europe%29.zip","filesize":6829741868,"score":"","genres":"Action > Side view > Puzzle elements > Licensed","desc":"<p><em>Shamu's Deep Sea Adventures</em> is 3D action game derived from SeaWorld's Shamu orca shows. The game follows the adventures of the killer whale Shamu and the manatee Horatio as they try to stop Poseidon’s. Who has plans to raise Atlantis to the surface and replace it for SeaWorld.</p><p>The game can be played on three difficulty modes: easy, medium and hard. In the game the player will take control of Shamu and take instructions from Horatio. In addition to a health bar Shamu also has an oxygen bar that need to be replenished to keep going. There is also an agility percentage meter, a higher number will let you perform more Animal behavior. Gameplay includes swimming around and collecting items like krill balls and oxygen to replenish health, oxygen and agility. The game is played mostly from a side perspective. While traversing the levels the player has to evade sea mines, solve puzzles, battle the kraken and explore Atlantis.</p>"},{"name":"Shattered Union","year":2005,"developer":"PopTop Software Inc.","url":"microsoft_xbox_s_part1/Shattered%20Union%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6648046520,"score":6.9,"genres":"Strategy > Diagonal-down > Free-roaming camera > Turn-based > North America > Post-apocalyptic > Sci-fi / futuristic","desc":"<p><em>Shattered Union</em> is a turn-based strategy game, set in 2014 in the United States against a background story of a second American civil war. The player can control any of seven different factions, each of which has at least one unique unit and its own set of sidebar powers:</p><ul><li>California Commonwealth</li><li>Pacifica</li><li>The Republic of Texas</li><li>Great Plains Federation</li><li>The Confederacy</li><li>New England Alliance</li><li>The European Union Occupation</li><li>Russia</li></ul><p>These factions wage warfare in different territories; the more territories are controlled, the more income a faction receives. When attacking such a territory, the player selects which of his units should be deployed. The battlefield is represented as a hex grid, though the graphics are full 3D. The objective of the battle is either to destroy all the enemy's units or capture enough objective towns to control the battlefield.</p><p>Apart from the campaign, the game provides both a single- and a multiplayer skirmish mode, allowing one-on-one battles.</p>"},{"name":"Shellshock: Nam '67","year":2004,"developer":"Guerrilla B.V.","url":"microsoft_xbox_s_part1/ShellShock%20-%20Nam%20%2767%20%28USA%2C%20Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6346590305,"score":5.9,"genres":"Action > Behind view > Shooter > Direct control > Historical events > War","desc":"<p><em>Shellshock</em> takes you back to the years of the Vietnam war. You take on the role of a rookie soldier on his first tour of duty. Using a third-person perspective, you experience napalm bombardments of civilian villages, sneaky night missions along the river banks, claustrophobic tunnel systems and huge battles in temples and open fields. Most missions are played as a team, but your team members cannot die and do not influence the mission objectives. You will have to assassinate enemy generals, take out crucial boats and guide your team through unknown territory.</p><p>The game does not have drivable vehicles, multiplayer options or extensive environmental interaction, but it features a particular system of dismantling the many bombs and traps: in a race against time, you have to perform a long key sequence in the correct order to clear the path. The atrocities on both sides are clearly shown in the cutscenes, filmed as through a shaky hand-camera. Either side is not afraid to abuse civilians for their cause and this sense of realism gives the game a rather raw edge. You can even purchase the services of hookers in the base camp.</p>"},{"name":"Shenmue II","year":2002,"developer":"SEGA-AM2 Co., LTD.","url":"microsoft_xbox_s_part1/Shenmue%20II%20%28Europe%29.zip","filesize":5591116166,"score":8.4,"genres":"Simulation > Behind view > Fighting > Quick Time Events (QTEs) > Martial arts","desc":"<p>After his father was murdered by a mysterious Chinese man known as Lan Di, Ryo Hazuki swears to avenge his death. After a futile search for Lan Di in Yokosuka, Ryo is contacted by Chen Yao Wen, a Chinese master who advises him to travel to Hong-Kong and seek out Master Lishao Tao, who might be the only one who knows what had happened between Lan Di and Ryo's father in the past. Ryo arrives in Hong Kong and starts searching for a man who is his only link to the elusive murderer.</p><p><em>Shenmue II</em> is a direct sequel to Shenmue, continuing its story. The game's structure and basic gameplay elements are similar to those of the first game, incorporating elements of adventure, fighting, and light role-playing within a life simulation experience. Ryo explores vast 3D environments, talks to people to gather clues, and occasionally participates in fighting sequences. Like in the previous game, Ryo can train to become stronger in battles, and gradually learns new moves, which constitutes the role-playing element of the game.</p><p>The game's environments are based on real locations in Hong Kong. The game world is significantly larger than that of its predecessor. The game also has a somewhat more linear story progression with numerous precise objectives, though free-form exploration is available during most of the game. Earning money plays a more important role, and many objectives are built around Ryo having to take part-time jobs (most of which are shaped like action mini-games) or participate in fights to win money. Like in the first game, Ryo can visit the arcades and play exact replicas of older arcade games, e.g. OutRun.</p><p>The sequel features a larger amount of characters who take part in the story. Some of them also accompany Ryo on his journey, helping him in fights or other dangerous situations. The game also noticeably increases the amount of quick-time events (QTEs). Several key sequences are composed entirely out of cutscenes during which the player has to rapidly press combinations of buttons in order to execute the correct action. Many major fights in the game also include extensive QTE segments, often serving as a culmination of the fight.</p><p>The Xbox version of the game comes with an additional DVD called <em>Shenmue: The Movie</em>, which contains a summation of the first <em>Shenmue</em> made into a feature-length movie.</p>"},{"name":"Shin Megami Tensei Nine","year":2002,"developer":"NexTech Corporation","url":"microsoft_xbox_s_part1/Shin%20Megami%20Tensei%20-%20Nine%20%28Japan%29.zip","filesize":6500034903,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Turn-based > Cyberpunk / dark sci-fi","desc":"<p>This is not the ninth Shin Megami Tensei game; \"nine\" is the number of character attributes and alignments used in the game: Law, Chaos, Light, Dark, Neutral, and their variants. The game is set in the future. Tokyo, Japan's capital, was destroyed in a nuclear explosion early in the 21th century. But some years later the Tokyo of the nineties was digitally recreated. People live in a virtual world, and everything is ruled by computer programs. But some programs don't work correctly, and one day, a pop concert is disrupted by a terrible demonic vision. A special agency recruits the hero of the game, Kei (which can be either female or male, depending on your choice), to travel through the virtual world and to confront the hackers who might pull the strings behind the scene.</p><p>Like in all Megaten games, demon summoning plays an important part in \"Nine\". You can have several parties, up to eight characters each, and form them at your wish from the demons you manage to recruit. Talking to enemies is even more important now, as you get experience points from equipping items and not from battles. You can also fuse demons to get more powerful ones. The battles are now in real time, both parties attack simultaneously, and precise timing is required. In addition, some portions of the game are occupied by virtual battles between hackers, which resemble a strategy board game.</p>"},{"name":"Showdown: Legends of Wrestling","year":2004,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_s_part1/Showdown%20-%20Legends%20of%20Wrestling%20%28Europe%29.zip","filesize":6634646334,"score":6,"genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p>Do battle with over 70 of the all-time greatest legends of wrestling.  Match types include: 1-On-1, Tag Team, Hardcore, Battle Royal, Cage Match, Ladder Match, Table Match, and much more.  With Classic Matches you are placed in middle of a historic match and challenged to repeat its outcome.  In addition, Create-A-Player lets you make your own \"Legend\" from  scratch and see how he can hold up against the best there ever was.</p>"},{"name":"Shrek","year":2001,"developer":"Digital Illusions Canada, Inc.","url":"microsoft_xbox_s_part1/Shrek%20%28USA%29.zip","filesize":6884569066,"score":5.4,"genres":"Action > 3rd-person (Other) > Puzzle elements > Licensed","desc":"<p>Taking place after the 3D animated movie of the same name, the game allows the player to control Shrek, a huge green ogre, as he must rescue Princess Fiona from the evil wizard Merlin while finding his way through worlds full of crazy twists on familiar fairy tale characters. In this third-person action platformer, Shrek bashes and burps his way past various challenges, fighting creatures and collecting items to complete Good Deeds and unlock new levels. </p><p>Each world features six missions to complete save for Merlin's castle and two of the missions in every regular level involve either collecting hidden Easter Eggs or grabbing the evil fairies who run away as you approach. Other missions in a stage can involve tasks like defeating a boss or transporting characters to their destinations.</p>"},{"name":"Shrek 2","year":2004,"developer":"Luxoflux Corp.","url":"microsoft_xbox_s_part1/Shrek%202%20%28Europe%29.zip","filesize":6605215358,"score":7,"genres":"Action > 3rd-person (Other) > Music / rhythm > Puzzle elements","desc":"<p>Shrek and friends join in an adventure that follows the movie plot of Shrek 2. Play as a team of four throughout the fairytale lands inhabited by the ogre Shrek and his wife Fiona, with 1-4 players. Throughout the game you will play as 10 different characters, each with his or her own unique abilities to face the challenges of a Fairy Godmother, your parents-in-law and more.</p>"},{"name":"Shrek SuperSlam","year":2005,"developer":"Shaba Games LLC"},{"name":"Shrek: Super Party","year":2002,"developer":"Mass Media, Inc.","url":"microsoft_xbox_s_part1/Shrek%20Super%20Party%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6637649004,"score":5.8,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Board game > Puzzle elements > Licensed","desc":"<p>Join Shrek and the entire cast from the hit movie for the a party game that will determine the best player in the land.</p><p>The aim of the game is simple. Move along the game board and collect as much bug juice as you can. Each square holds either the chance to steal some from another player, or lose some yourself, while game squares have you playing off for juice in a range of mini-games.</p><p>30 mini games await either you or 4 people, both all-on-all or two-on-two style. Games include puzzle variants, racing and more.</p>"},{"name":"Sid Meier's Pirates!: Live the Life","year":2005,"developer":"Firaxis Games East, Inc.","url":"microsoft_xbox_s_part1/Sid%20Meier%27s%20Pirates%21%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6534135193,"score":8.1,"genres":"Action > Strategy > Diagonal-down > Free-roaming camera > Real-time > Fighting > Stealth > Naval / watercraft > Sea pirates / Caribbean","desc":"<p>Sid Meier returns to his roots with this remake of Sid Meier's Pirates!, his 1987 game about sailing the high seas in search of treasure. As in the original, you will plunder cities, sink enemy ships, and more. A plethora of different styles of gameplay will have you sneaking out of prison, dancing with the governor's daughter, engaging in real-time strategic combat, and a slew of others. </p><p><em>Sid Meier's Pirates!</em> features a new 3D engine, but its style of stringing several minigames together to make a congruent game remains true to the original.</p>"},{"name":"Silent Hill 2: Restless Dreams","year":2001,"developer":"Team Silent","url":"microsoft_xbox_s_part1/Silent%20Hill%202%20-%20Restless%20Dreams%20%28USA%29%20%28En%2CJa%29.zip","filesize":5918917398,"score":8.1,"genres":"Action > 3rd-person (Other) > Cinematic camera > Puzzle elements > Survival horror > Horror","desc":"<p><em>Restless Dreams</em> is an updated version of of  Silent Hill 2. It contains all of the content of the original version and adds several pieces of new content. The most significant is a new short scenario called <em>Born from a Wish</em>, where players take control of Maria from her first moments right up to where she first appears in the main game. Also included is a sixth ending to the main scenario and a minor feature that allows the player to turn off the graphical effect, which makes the game look like it was shot on cheap film stock.</p>"},{"name":"Silent Hill 4: The Room","year":2004,"developer":"Team Silent","url":"microsoft_xbox_s_part1/Silent%20Hill%204%20-%20The%20Room%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5900180512,"score":7.4,"genres":"Action > 1st-person > 3rd-person (Other) > Survival horror > Horror","desc":"<p>Henry Townshend is a man living in a small apartment in South Ashfield, a neighboring town of the infamous Silent Hill. On one strange night, Henry has a terrible nightmare, with recurring events: his phone is dead, his windows are sealed, and his neighbors can't hear him. He looks at his door, only to see it is blocked by several thick metal chains. A note is pinned to the door: \"Don't go out!\" It is signed only by a man named Walter. Henry explores his apartment, trying to figure out what is happening, when he spots a giant hole in the wall of his bathroom. Henry goes through the hole, only to find a portal which leads him to alternate dimensions. Hopefully, Henry will find out the truth about his apartment, Room 302, and live.</p><p><em>Silent Hill 4: The Room</em> is similar to past games in terms of atmosphere. The game is dark and foreboding, never letting the player know what's behind the next corner or down the street. This installment of the series includes multiple new features. Henry never actually leaves his apartment: he utilizes a strange portal to travel to alternate dimensions, including a hospital, a cult command center deep in the forest, and a prison. Aside from the traditional third-person-view, there is now a first-person mode, which is used to control Henry when he is in his apartment. Objects that can be interacted with are highlighted by eyeball icons.</p><p>The previous games in the series have mostly been about exploring the town and solving puzzles; this installment has much more combat involved. There are more enemies in a given area, and more narrow areas and cramped spaces. Henry mostly uses a standard <em>Silent Hill</em> arsenal of weapons, such as the steel pipe, pistol, and (new to this game) a golf club.</p>"},{"name":"Silent Scope Complete","year":2004,"developer":"Konami Corporation","url":"microsoft_xbox_s_part1/Silent%20Scope%20Complete%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6676286776,"score":7,"genres":"Action > 1st-person > Shooter","desc":"<p>This collection brings together every <em>Silent Scope</em> game created for both arcades and home consoles (previously released on the PS2/Dreamcast).</p><p>Each game allows you to pick up a sniper rifle and take out the enemies that surround the area in front of you. Time is critical, so you must be both fast and accurate in order to push on. Boss battles also appear, adding a level of difficulty.</p><p>Fully ported, and featuring light gun support, are Silent Scope, Silent Scope 2: Dark Silhouette and Silent Scope 3. Also included is <em>Silent Scope EX</em>, an exclusive to the package with all new levels.</p>"},{"name":"Simpsons, The: Hit & Run","year":2003,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_s_part1/Simpsons%2C%20The%20-%20Hit%20%26%20Run%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6550159150,"score":7.5,"genres":"Action > Racing / Driving > 1st-person > Behind view > Platform > Sandbox / open world > Direct control > Automobile > Street racing > North America > Comedy > Licensed","desc":"<p><em>The Simpsons: Hit &amp; Run</em> can be best described as Grand Theft Auto in Springfield.</p><p>The player takes on the role of Homer, Marge, Bart, Lisa or Apu and tries to uncover a mystery surrounding mechanical bees that are taking over Springfield, mysterious vans, and cola that can control the minds of those who drink it.</p><p>Like <em>GTA</em>, the game follows a linear-based path through fifty plus missions. The player will have to chase cars and find out where they're headed, grab all the spilling cola cans before people can drink them, and chase down villains before they get away.</p><p>Throughout the course of the game, the player can unlock tons of rewards by completing missions in a set amount of time or performing outstanding stunts.</p><p>All voiceovers are performed by those who act in the show, including Dan Castellaneta (Homer), Julie Kavner (Marge) and Yeardley Smith (Lisa).</p><p>The game supports multiplayer action for up to four players.</p>"},{"name":"Simpsons, The: Road Rage","year":2001,"developer":"Radical Entertainment Inc.","url":"microsoft_xbox_s_part1/Simpsons%2C%20The%20-%20Road%20Rage%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6819901310,"score":6.6,"genres":"Racing / Driving > Behind view > Arcade > Direct control > Automobile > North America > Comedy > Licensed","desc":"<p>Mr Burns has taken over Springfield's transit company and replaced the buses with nuclear powered buses; not only that but they also cost a lot to ride. But the people of Springfield won't accept this and decide to try to take back the transit company from the evil corporate hands of C. Montgomery Burns. </p><p>Play as your favorite characters from The Simpsons and race around Springfield picking up passengers and getting them to their destinations as fast as possible. Think Crazy Taxi meets The Simpsons.</p>"},{"name":"Sims 2, The","year":2005,"developer":"Maxis Software Inc.","url":"microsoft_xbox_s_part1/Sims%202%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6337304347,"score":7.2,"genres":"Simulation > 3rd-person (Other) > Life / social simulation > Direct control > Multiple units/characters control > Point and select","desc":"<p>This <em>The Sims 2</em> version is a life simulator for console platforms allowing players to create incredibly deep characters with unique looks, clothes, aspirations, and personalities before taking them through all the intricacies of life. From taking out the trash to building a romance, the <em>Sims 2</em> is the ideal alternate life.</p><p>At its core this version is a reinvention of the PC game of the same name that adds many new features including direct control of your character, a new food creation system, a custom story mode, a new social mode, and extensive character creation options while integrating a number of the new PC elements including wants and fears, more in depth autonomous character behaviors and more.</p>"},{"name":"Sims, The","year":2003,"developer":"Edge of Reality, Ltd.","url":"microsoft_xbox_s_part1/Sims%2C%20The%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6814649944,"score":7.8,"genres":"Simulation > Diagonal-down > Isometric > Real-time > Life / social simulation > Managerial / business simulation > Multiple units/characters control > Point and select > Contemporary","desc":"<p>GET A LIFE!</p><p>It's time you moved out of Mom's house and spread your wings as a Sim. You'll need to find a job, a roommate, and a new place to live. Meet life's challenges and you could meet your soul mate and retire to the ultimate party mansion.</p><p>Get a Life - Create a Sim and go from rags to riches in seven challenging levels.</p><p>Freestyle Sims - Chart the destiny of an entire Sim neighborhood in open-ended Sandbox mode.</p><p>Two Player - Challenge a friend for love and money or cooperate in an open-ended game.</p><p>Create Your Sims - Recreate yourself and your friends or create your own cast of characters.</p><p>Build Their World - Fill their homes with everything from giant screen TVs and stereos to wet bars and swimming pools.</p><p>Control Their Lives - Host parties, insult the neighbors, hire a maid, play in the hot tub, or even get married and have kids.</p>"},{"name":"Sims, The: Bustin' Out","year":2003,"developer":"Maxis Software Inc.","url":"microsoft_xbox_s_part1/Sims%2C%20The%20-%20Bustin%27%20Out%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6568890653,"score":7.5,"genres":"Simulation > Diagonal-down > Real-time > Life / social simulation > Direct control > Multiple units/characters control > Point and select","desc":"<p><em>The Sims: Bustin' Out</em> is the console sequel to The Sims and the second Sims game to appear on the major consoles. Sims can now leave their house and visit all different kinds of locations. </p><p>In the mission-based Bust Out mode, the player starts at Mom's house learning that evil Malcolm Langrabb is repossessing items from all the Sims homes. Your job is to make enough money to buy back all the goods and eventually evict him from his own mansion. The game also features an open-ended Freeplay mode.</p><p>Bustin' Out's big new features are the ability to visit and move between houses through the single player progression as well as an online multi-player mode for 2 people on the PS2. The servers for the online mode have since been shut down.</p>"},{"name":"Ski Racing 2005: Featuring Hermann Maier","year":2004,"developer":"Coldwood Interactive AB","url":"microsoft_xbox_s_part1/Ski%20Racing%202005%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6435040351,"score":6.7,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Snowboarding / skiing > Licensed","desc":"<p><em>Ski Racing 2005</em> is an officially licensed downhill racing game on skis. It includes ski pistes from various real locations such as Kitzbühl, Garmisch-Partenkirchen and Val d'Isère. The game comes with four game modes taken directly from the world championships. They are slalom, giant slalom, super-g and downhill. The game modes each focus on speed and manoeuvrability.</p>"},{"name":"Ski Racing 2006: Featuring Hermann Maier","year":2005,"developer":"Coldwood Interactive AB","url":"microsoft_xbox_s_part1/Ski%20Racing%202006%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%2CNo%29.zip","filesize":6482324533,"score":7,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Snowboarding / skiing > Licensed","desc":"<p><em>Ski Racing 2006</em> is an officially licensed downhill racing game on skis. It is the sequel to Ski Racing 2005 - featuring Hermann Maier. It includes ski pistes from various real locations such as Kitzbühl, Garmisch-Partenkirchen and Val d'Isère. It comes with all the locations from its predecessor. You can play the game in three different difficulties and it comes with the same game modes as the previous game taken directly from the world championships. They are slalom, giant slalom, super-g and downhill; new is the World Cup mode. The game modes each focus on speed and manoeuvrability. You can play against fifteen stars including Bode Miller, Daron Rahlves, Kalle Pallander, Didier Defago and Hermann Maier to battle for the Crystal Goblet.</p>"},{"name":"Slam Tennis","year":2002,"developer":"Infogrames Studios Limited","url":"microsoft_xbox_s_part1/Slam%20Tennis%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6730590293,"score":6.5,"genres":"Sports > 3rd-person (Other) > Tennis","desc":"<p>Two different extremes of tennis are combined here. The four Grand Slam venues are among the 11 featured, but so are a mansion and a dance hall. These surfaces all affect ball speed and bounce. A few real players such as Carlos Moya and Tim Henman are included, but most are created for the game - a lifeguard and a mayor are included, with abilities based on their real-life work. </p><p>As well as playing individual Exhibition matches, you can take on an Arcade challenge of defeating the 16 players or take on the full Slam Tennis Championship event. Forehand, backhand and lob shots are all available. There are also sub-games: Crazy Collapsing Columns, Bubble Bursting Bonanza, Rocking Ring Riot, and Sand, Sea and Serve,</p>"},{"name":"Smashing Drive","year":2002,"developer":"Gaelco, S.A.","url":"microsoft_xbox_s_part1/Smashing%20Drive%20%28USA%29.zip","filesize":6858261354,"score":5.2,"genres":"Racing / Driving > Behind view > Real-time > Arcade > Direct control > Automobile > Street racing > North America","desc":"<p>Smashing Drive puts you in the driver's seat of an insane, outrageous taxi on the busy streets of New York City.  Your job is to simply race from point to point in the fastest time possible.  </p><p>The key to success in Smashing Drive lies in two features:  crazy power-ups and hidden shortcuts.  Almost all of the power-ups transform your taxi in some way that allows you to smash your way through traffic with ease.  And the shortcuts usually involve crashing through the insides of buildings, like movie theaters and sports arenas.</p>"},{"name":"Sneak King","year":2006,"developer":"Blitz Arcade","url":"microsoft_xbox_s_part1/Sneak%20King%20%28USA%29.zip","filesize":6693209261,"score":5.9,"genres":"Action > 3rd-person (Other) > Stealth > Licensed","desc":"<p>One of three promotional titles from all participating Burger King restaurants with purchase of a value meal.</p><p>In one of the most unusual presentations ever, Sneak King is a stealth adventure game where players slip behind the mask of \"The King\", Burger King's mascot.  The objective is to sneak up on famished people and present them with tasty Burger King Hamburgers before they pass out from hunger.  </p><p>Throughout 20 missions and four different environments: saw mill, cul de sac, construction zone, and a downtown area, The King can use the environments to keep the element of surprise by hiding in garbage cans and other similar areas.  If the person sees you while you are trying to deliver food, they'll lose their appetite.</p><p>Each time you successfully deliver food, you're treated to a little dance from The King and a cheer of appreciation from the recipient.</p><p>How many points the player receives depends on how The King delivers the food: How close you get to the person before handing off the food, people who are closer to fainting, making consecutive deliveries without being seen will start a chain multiplier, and filling a bar for a flourish bonus. The fuller the bar is, the more of a reward you'll get. The higher the flourish, the more involved The King's dance is. The last factor in scoring is whether you sneak up behind the person, or surprise them from a stationary position.</p>"},{"name":"Sneakers","year":2002,"developer":"Media.Vision Entertainment Inc.","url":"microsoft_xbox_s_part1/Sneakers%20%28USA%29.zip","filesize":6661597038,"score":4.7,"genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p>A new gang of rats that has moved into the neighborhood has stolen food Apollo the mouse and his friends were going to take to a party. Now, Apollo and his friends must search for and fight the invading rats.</p><p>Each level is broken up into two sections. First, Apollo and the other mice will search for rat scouts, traveling from room to room along branching paths. Some rats will be in plain sight, but others will need you to move objects. After the rat scouts have been found, rat gangs will appear to fight you. Your companions will fight automatically, or you can order them to attack specific targets. In either case, combat is 3rd-person brawling.</p>"},{"name":"Sniper Elite","year":2005,"developer":"Rebellion Developments Ltd.","url":"microsoft_xbox_s_part1/Sniper%20Elite%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6258731441,"score":7.4,"genres":"Action > Simulation > 1st-person > Behind view > Shooter > Stealth > Historical events > World War II > Spy / espionage > Regional differences","desc":"<p>Sniper Elite is a third-person action strategy game with a focus on sniping. The player takes on the role of an American agent working for the OSS (the organization that later became the CIA) stationed in Berlin at the end of World War II, tasked with preventing the Russian troops from getting hold of the research Germany had been conducting into nuclear weaponry. As an elite sniper, the style of play is much less run-and-gun and much more about finding good positions, lining up shots and taking out the enemy before he even knows where you are.</p><p>The single-player campaign takes place over 28 missions set in and around Berlin. Players use stealth tactics, and things like wind and background noise can be a factor when lining up shots. When a shot is performed particularly well, players are rewarded with a 'bullet cam' which follows the bullet in slow-motion from gun barrel to target.</p><p>The game also includes a multi-player mode with a number of different game types.</p>"},{"name":"Soldier of Fortune II: Double Helix","year":2003,"developer":"Raven Software Corporation","url":"microsoft_xbox_s_part1/Soldier%20of%20Fortune%20II%20-%20Double%20Helix%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":6675210801,"score":7.7,"genres":"Action > 1st-person > Shooter > Direct control > Asia > Contemporary > Europe > North America > South America > Licensed > Regional differences","desc":"<p>The stakes are higher in this sequel to Soldier of Fortune. The player is John Mullins, a patriot, weapons specialist and anti-terrorist mercenary, who takes on a new threat bio-terrorist organization and their Gemini virus. His mission is to neutralize the terrorists before they unleash the virus.</p><p><em>Soldier of Fortune II: Double Helix</em> features over 55 levels and an all new Random Mission Generator mode. The game uses the Quake III: Team Arena engine with GHOUL II technology and its models are designed with 36 damage zones along with 16 dismemberment zones.</p>"},{"name":"Sonic Heroes","year":2003,"developer":"Sonic Team","url":"microsoft_xbox_s_part1/Sonic%20Heroes%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6407878151,"score":7,"genres":"Action > 3rd-person (Other) > Free-roaming camera > Anime / Manga > Platform > Direct control","desc":"<p><em>Sonic Heroes</em> is a 3D action-platformer in which the player takes control of a team of 3 characters, each with a special ability - speed, fly and power. The objective of the game is to race through levels as quickly as possible whilst defeating enemies and collecting rings. Your time, rings and enemies defeated make up a point system, and more points mean a higher rank on the level. There are 4 teams of characters each with their own changes to the gameplay:</p><ul><li>Team Sonic is the intermediate difficulty featuring Sonic (speed), Tails (fly) and Knuckles (power).</li><li>Team Shadow is the hard difficulty featuring Shadow (speed), Rogue (fly) and E-123 Omega (power).</li><li>Team Rose is the easy difficulty featuring Amy (speed), Cream (fly) and Big (power).</li><li>Team Chaotix features new mission-based objectives with Espio (speed), Charmy (fly) and Vector (power).</li></ul><p>The game features 4 modes:</p><ul><li>Story Mode, giving players the opportunity to play through levels as the story progresses.</li><li>Challenge Mode, giving players the opportunity to replay levels that they have previously cleared in Story Mode</li><li>Battle Mode, a multiplayer mode where players can race or battle each other</li><li>Tutorial Mode, teaching players the basics of playing the game.</li></ul>"},{"name":"Sonic Mega Collection Plus","year":2004,"developer":"Sonic Team","url":"microsoft_xbox_s_part1/Sonic%20Mega%20Collection%20Plus%20%28World%29%20%28En%2CJa%29.zip","filesize":6609806084,"score":7.4,"genres":"Action > Compilation > Side view > Top-down > Platform","desc":"<p>A special extended version of the popular GameCube compilation ported for the PS2 and Xbox, <em>Sonic Mega Collection Plus</em> contains 20 of the most popular Sonic the Hedgehog and SEGA Genesis titles in one convenient set. It carries over all the content of the previous version, including the following emulated Genesis games:</p><ul><li>Sonic the Hedgehog</li><li>Sonic the Hedgehog 2</li><li>Sonic the Hedgehog 3</li><li>Sonic &amp; Knuckles</li><li>Sonic 3D Blast </li><li>Sonic the Hedgehog: Spinball</li><li>Dr. Robotnik's Mean Bean Machine</li><li>Flicky</li><li>Ristar</li></ul><p>It also has the special games created by locking Sonic &amp; Knuckles onto the earlier Sonic games: <em>Blue Sphere</em>, <em>Knuckles the Echidna in Sonic the Hedgehog 2</em> and <em>Sonic 3 &amp; Knuckles</em>.</p><p>New to the Plus version is a save-state function, lots of new artwork, movies and comics in addition to what was on GameCube and several new games. The Genesis games The Ooze and Comix Zone were now available in all regions. The previous version had included them only in Japan. Additionally, a Game Gear emulator was added along with six Game Gear games:</p><ul><li>Sonic the Hedgehog</li><li>Sonic Chaos </li><li>Sonic Drift</li><li>Sonic Labyrinth</li><li>Dr. Robotnik's Mean Bean Machine</li><li>Sonic Blast</li></ul>"},{"name":"Sonic Riders","year":2006,"developer":"Now Production Co., Ltd.","url":"microsoft_xbox_s_part1/Sonic%20Riders%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6440505365,"score":6.2,"genres":"Racing / Driving > Behind view > Anime / Manga > Arcade > Automobile > Track racing > Vehicle simulator","desc":"<p>In Sonic Riders, Dr. Eggman challenges Sonic and his friends to a Worldwide Grand Prix, and the prize for coming out on top is an ultra-rare Chaos Emerald! Gliding on air boards – which are performance-oriented for each playable character – gamers will experience a heightened sense of sports-style racing tension as Sonic and his pals perform tricks and stunts over treacherous wide-open terrain.</p><p>Sonic and friends speed through tracks on air boards, using individual special moves to strike down opponents. Air is a big element of Sonic Riders. Your board's \"fuel\" source is air. You can fill up your air at various points on the course, but to race well you'll have to use another means of replenishment: performing tricks with your board. You'll also want to make use of turbulence from racers who are in front of you.</p>"},{"name":"SoulCalibur II","year":2003,"developer":"Project Soul","url":"microsoft_xbox_s_part1/Soulcalibur%20II%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6539349853,"score":8.5,"genres":"Action > 3rd-person (Other) > Cinematic camera > Arcade > Fighting > Martial arts","desc":"<p>Mortal Kombat-style one-on-one fighting is one thing, but fighting with weapons is completely different. <em>Soul Calibur II</em> continues the tradition set by Soul Blade and the Dreamcast Soul Calibur with intense action and plenty of weapons to deal the massive blows.</p><p>A majority of the action takes place in Weapon Master mode, as you choose a character and travel a set map to fight the many other warriors through a collection of different terrain styles and challenges. One minute you'll be fighting in quicksand; the next you'll have to defeat an opponent by only using throwing attacks.</p><p>Other modes include the usual arcade, survival, and practice modes, and multiplayer options for two people to battle it out.</p><p>Each version of Soul Calibur II also includes a unique character for the platform. Spawn appears on Xbox, Link from The Legend of Zelda series can be found on GameCube, and Tekken fighter Heihachi finds his way to PS2.</p>"},{"name":"Spartan: Total Warrior","year":2005,"developer":"The Creative Assembly Ltd.","url":"microsoft_xbox_s_part1/Spartan%20-%20Total%20Warrior%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6480636148,"score":7.1,"genres":"Action > Diagonal-down > Classical antiquity","desc":"<p>Set in the battle between Sparta and Rome, you take the role of a Spartan warrior to heed into the battle for your freedom.</p><p>The game has a fast-paced, arcade-like, mission-based gameplay. In each mission, you must succeed in minor goals like killing the generals of the opposition, escorting sappers to blow up enemy siege weaponry and preventing the enemy from making to behind your borders. The storyline progresses through cutscenes, shown in-between each mission.</p><p>Depending on how you succeed in your mission, you get \"tokens\", which you can use to upgrade the health, damage or power of your character. The player is capable of doing special moves, which can be learned throughout the game. Some of the special moves gain their powers through the spartan gods, that aid the player in his battle. During the game, you can find different weapons like swords, bows and spears, and of course, shields.</p>"},{"name":"Spawn: Armageddon","year":2003,"developer":"Point of View, Inc.","url":"microsoft_xbox_s_part1/Spawn%20-%20Armageddon%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6595200140,"score":6.5,"genres":"Action > Behind view > Direct control > Licensed","desc":"<p><em>Spawn: Armageddon</em> is a 3D action/adventure game based on the comic by Todd McFarlane, who also contributed the storyline for the game. Spawn struggles between the forces of Heaven and Hell in order to save the world, equipped with his Hell-sent living symbiotic suit and its chains. A multitude of weapons and Hell Powers are also available. Agony, the axe that Spawn uses in SoulCalibur II is also available as a melee attack weapon.</p>"},{"name":"Speed Kings","year":2003,"developer":"Climax London","url":"microsoft_xbox_s_part1/Speed%20Kings%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6857724339,"score":6.4,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Arcade","desc":"<p><em>Speed Kings</em> is an arcade-style motorbike racing game. The player has to race through 22 different levels, weave through civilian traffic and compete against 5 CPU opponents. There are 22 non-licensed motorcycles, modeled after their real world counterparts to use in the six game modes: single race, time attack, trick attack, head to head, grand prix, meets, and tag (multiplayer-only). As players progress in the game, they earn respect points, which unlock new bikes.</p><p>During the race, the player has to build up the powerband meter to perform nitro boosts by colliding into the sides of oncoming vehicles, or performing tricks such as wheelies, handstands, big jumps or sliding underneath 18-wheelers. It's also possible fight other riders Road Rash style.</p>"},{"name":"Sphinx and the Cursed Mummy","year":2003,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_s_part1/Sphinx%20and%20the%20Cursed%20Mummy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6621387487,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p>Sphinx is on a mission using his special powers &amp; his agilityto find the stolen mystical crowns of Egypt. With his sidekick, the Mummy you travel through 5 worlds, acquirespecial abilities along the way and uncover dark secrets. You also have the ancient Egyptian weapons as your arsenal.</p>"},{"name":"Spider-Man","year":2002,"developer":"Treyarch Corporation","url":"microsoft_xbox_s_part2/Spider-Man%20%28Europe%29%20%28Rev%201%29.zip","filesize":6801141465,"score":7.5,"genres":"Action > 3rd-person (Other) > Licensed","desc":"<p>Spider-Man, the classic comic book co-created by Stan Lee, is now a major motion picture. This conversion of the movie to the video game world takes the major storyline, characters and artwork of the Spider-Man movie and adds a lengthy backstory and new characters.</p><p>The Green Goblin is the main villain here, and as Peter Parker you must defy gravity using your spider crawl, web-slinging and spider-sense abilities to track down Spidey's nemesis through the skyscapers of New York City.</p><p>The major inclusion for this title over the previous Spider-Man series (on PlayStation, also by Activision) is aerial combat. Attack the enemy mid-air while web-slinging, rise and descend while swinging and banking around buildings create a greater emphasis on Spidey's greatest asset, the spider web.</p>"},{"name":"Spider-Man 2","year":2004,"developer":"Treyarch Corporation","url":"microsoft_xbox_s_part2/Spider-Man%202%20%28World%29.zip","filesize":6569631235,"score":7.7,"genres":"Action > 3rd-person (Other) > Fantasy > North America > Licensed","desc":"<p>Based on the sequel to the popular 2002 movie of the same name, Spider-Man 2 once again places the player in the web-slinger's tights as he goes up against Dr. Octopus in this 3D adventure game.  </p><p>Unlike the first game, however, the sequel is much more open-ended (à la Grand Theft Auto: Vice City), allowing Spider-Man free reign to explore New York City and performing everyday heroics; stopping muggers, bank robberies and car-jackers to more mundane pursuits such as delivering pizzas and snapping photos for the Daily Bugle.  </p><p>However, the action becomes even more intense as not only does Spidey have to keep the streets safe in general for the citizens of Manhattan, he also has to face up against such super villains as Rhino, Shocker, Mysterio and Calypso, as well as a few entanglements with the Black Cat along the way to square off against Dr. Octopus and save New York in the process!</p>"},{"name":"Spikeout: Battle Street","year":2005,"developer":"Amusement Vision, Ltd.","url":"microsoft_xbox_s_part2/Spikeout%20-%20Battle%20Street%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6629352628,"score":6,"genres":"Action > 3rd-person (Other) > Arcade > Beat 'em up / brawler > Fighting","desc":"<p>Take control of one of 16 characters in a 3D cityscape environment of Diesel Town to fight your way through as two gangs (Team Spike and Team Inferno) go head to head in this arcade style beat em up as Spike Jr (leader of Team Spike) heads out for to take on his fathers nemesis, Mike. Based on the original series which hit Japanese arcades back in the 90's, the game is as unforgiving as an arcade release with no continues during single player. However this being an arcade style game its focus is in the multiplayer with split screen, system link and Live functionality allowing 4 player co-op, even online.</p>"},{"name":"Splashdown","year":2002,"developer":"Rainbow Studios, Inc.","url":"microsoft_xbox_s_part2/Splashdown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6874520918,"score":7.9,"genres":"Racing / Driving > Sports > Behind view > Sailing / boating","desc":"<p><em>Splashdown</em> puts the player in the role of one of nine \"over the top\" jetskiiers, and challenges the player to race on a plethora of courses.</p><p>Most courses take place in lakes and rivers, all modified to include jumps. Certain courses are man-made and built in a stadium, where the player can race one-on-one around a square or oval-shaped track. Tracks take place in different areas of the world, from Florida to Italy.</p><p>Each character has a different seadoo, that has it's own unique characteristics, such as handling, speed and acceleration. Each seadoo has been licensed by the SEA-DOO company, so each machine is accurate in its looks and ability.</p><p>Each rider can perform a number of different stunts, such as the Superman, the Can-Can, and the Lazyboy. There is one special stunt that is different for each racer.</p><p>Multiplayer options include a \"trick attack\" and the standard race.</p>"},{"name":"SPLAT Magazine: Renegade Paintball","year":2006,"developer":"Cat Daddy Games, LLC","url":"microsoft_xbox_s_part2/Splat%20Magazine%20Renegade%20Paintball%20%28USA%2C%20Europe%29.zip","filesize":6784870707,"score":5.7,"genres":"Action > Sports > 1st-person > Shooter > Paintball > Licensed","desc":"<p><em>Renegade Pinball</em> is a tie-in game with the paintball magazine <em>SPLAT! Magazine</em>. This paintball shooter includes several modes: Arcade, Fieldball and Tournament. There are thirteen different environments to play in, as well as 28 single-player levels. There are several types of gameplay modes including Centre Flag, Elimination and King of the Hill. There is also a Field Editor to create a custom paintball arena. The game allows for two-player split-screen or seven-on-seven online multiplayer.</p>"},{"name":"SpongeBob SquarePants: Battle for Bikini Bottom","year":2003,"developer":"Heavy Iron Studios, Inc.","url":"x-rN22020/Nickelodeon%20SpongeBob%20SquarePants%20in%20-%20Battle%20for%20Bikini%20Bottom%20%28Europe%29.zip","filesize":6470636133,"score":7.2,"genres":"Action > Behind view > Platform > Licensed","desc":"<p>SpongeBob Squarepants: Battle for Bikini Bottom is based on the immensely popular Nickelodeon cartoon series.  In this game, players control SpongeBob, Patrick and Sandy through 30+ levels of zany and hilarious platform gameplay, doing such outrageous moves like tongue-boarding, underwear bungee jumping and lasso-coptering.</p><p>Plankton's latest diabolical scheme to steal the Krabby Patty formula hinges on the creation of an army of evil robots, who will do his bidding.  But because Plankton forgot to throw the \"Obey Plankton\" switch, the army of robots have run amuck and are terrorizing Bikini Bottom.  Help SpongeBob, Patrick and Sandy save Bikini Bottom!</p>"},{"name":"SpongeBob SquarePants: Lights, Camera, Pants!","year":2005,"developer":"THQ Australia Studios Pty Ltd.","url":"x-rN22020/Nickelodeon%20SpongeBob%20SquarePants%20-%20Lights%2C%20Camera%2C%20Pants%21%20%28Europe%29%20%28En%2CSv%29.zip","filesize":6245988163,"score":6.3,"genres":"Action > Side view > Board game > Game show / trivia / quiz > Music / rhythm > Paddle / Pong > Puzzle elements > Licensed","desc":"<p>Multiplayer party game based on the popular kids show SpongeBob Squarepants, where a TV show has pitted the characters of Bikini Bottom to outplay each other in a variety of fun games with the chance to be TV idols for the new \"Mermaid Man and Barnacle Boy\" TV special. </p><p>The game is a panoply of old and new styles of fast action party games, with popularity points determining the winners and losers of each game. The elements of the final TV show are built slowly and surely as each game progresses, with up to four players competing for the prizes.</p>"},{"name":"SpongeBob SquarePants: The Movie","year":2004,"developer":"Heavy Iron Studios, Inc.","url":"x-rN22020/Nickelodeon%20SpongeBob%20SquarePants%20-%20The%20Movie%20%28Europe%29.zip","filesize":6704757674,"score":6.9,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p>On a heroic, comedic quest through more than 20 levels of platform, driving and sliding action, SpongeBob and Patrick leave Bikini Bottom and journey to new and unexplored lands.  Players join their struggle to defeat Plankton's diabolic scheme to take over the world...Plan Z!  Plankton has stolen King Neptune's crown and assumed control of the town of Bikini Bottom, placing the blame squarely on Mr. Krabs.  Together, SpongeBob and Patrick must journey to far away Shell City to recover the crown, return to Bikini Bottom and save the town and Mr. Krabs.</p>"},{"name":"Spy Hunter","year":2002,"developer":"Point of View, Inc.","url":"microsoft_xbox_s_part2/SpyHunter%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6277935816,"score":7.1,"genres":"Racing / Driving > Behind view > Arcade > Shooter > Automobile > Flight / aviation > Motorcycle > Naval / watercraft > Spy / espionage > Licensed","desc":"<p>Evil multinational corporation, NOSTRA are ready to destroy the world and keep what's left, but as the Spy Hunter, it is the player's job to take them down, using all of the available weapons.</p><p>In this remake of the 1980's arcade game, the player must ride through seven real life locations in a G-6155 Interceptor, the most high tech car ever built. Weapons include built in machine guns, oil slicks, missiles and much more.</p><p>Two major things happen to the Interceptor: When it hits the water, it transforms into a speed boat. When shields dip lower then 50%, it transforms into a motorcycle or jet ski.</p>"},{"name":"Spy Hunter 2","year":2003,"developer":"Rockstar San Diego, Inc.","url":"microsoft_xbox_s_part2/SpyHunter%202%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6802448297,"score":6,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Shooter > Automobile > Spy / espionage","desc":"<p>Spy Hunter 2 is a fast paced action racing game that features the innovative ability to transform into 3 different vehicles which, allows you to navigate through 16 diverse environments such as ragged snow covered mountain ranges, tropical swamps, and rugged dirt and freeway roads. Armed with an upgradeable arsenal of futuristic weaponry you are on a quest to end the terrorist organization called “Nostra”. As you battle through various AI controlled enemy the Spy Hunter 2 story unfolds revealing more in-depth information about the new Spy Hunter 2 vehicle and Alec Sects connection with his mysterious female co-agent.</p>"},{"name":"Spy Hunter: Nowhere to Run","year":2006,"developer":"Terminal Reality, Inc.","url":"microsoft_xbox_s_part2/SpyHunter%20-%20Nowhere%20to%20Run%20%28USA%29.zip","filesize":5877894646,"score":5.4,"genres":"Racing / Driving > 1st-person > Behind view > Arcade > Shooter > Automobile","desc":"<p><em>SpyHunter: Nowhere to Run</em> is a combination of racing/3rd person shooter that stars professional wrestler-come-movie star Dwayne \"The Rock\" Johnson as spy Alex Decker as he battles the evil organization NOSTRA in its bid for world domination. </p><p>As in other games in the <em>Spy Hunter</em> series the player pilots the high tech Interceptor, a vehicle heavily equipped with lethal weapons that can also transform into a different vehicle type (i.e. from a car to a boat to a motorcycle) used to fight enemies of a evil nature with similarly equipped vehicles but with less armor than the Interceptor. New to the series is the 3rd person run and gun shooter game play featuring the likeness of said Johnson using firearms and WWE style wrestling moves.</p>"},{"name":"Spy vs Spy","year":2005,"developer":"Vicious Cycle Software, Inc.","url":"microsoft_xbox_s_part2/Spy%20vs.%20Spy%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6496948946,"score":5.2,"genres":"Action > Strategy > Behind view > Arcade > Puzzle elements > Stealth > Direct control > Spy / espionage > Licensed","desc":"<p>In this remake of the original Spy vs. Spy, you can play a \"storyline game\", \"modern game\", \"classic version\" (now in 3D) or one of five \"multiplayer modes\" including online with three other Spies.</p><p>\"Storyline game\" is for the single player only. Help one of the Spies sabotage the ultimate doomsday gadget. You are not alone as the other Spy and his evil minions are out to stop you!</p><p>\"Modern game\" is for single or multi-player. Set in a modern era. Beginning from your secret hideout, journey across to the arena, mindful of traps or set your own, as you challenge the other spies to gain the four secret items (needed to complete the stage) on eight different levels. The first level is in a Robot Factory loaded with machines to moving conveyor belts. A great selection of tools: weapons - bazooka, chainsaw, flame thrower to lightning gun; mines - bear trap, banana peel or lector mine; door traps; safe traps; counters - decoys and power ups. </p><p>\"Classic version” plays as one or with three others. Like the original, get the Secret Items hidden somewhere in the numerous safes, locate the exit and board the helicopter to safety. Favorite weapons are back - bucket, time bomb toEssential first aid kit.</p><p>\"Multi-player modes\" are for more than one player. These include 'Deathmatch' (up to 3 Spies) till death, to 'Armed and Loaded' (up to 4 Spies) the one who earns the most money by killing the others.</p>"},{"name":"Spyro: A Hero's Tail","year":2004,"developer":"Eurocom Developments Ltd","url":"microsoft_xbox_s_part2/Spyro%20-%20A%20Hero%27s%20Tail%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%29.zip","filesize":6536478727,"score":7.1,"genres":"Action > Behind view > Platform > Puzzle elements > Direct control > Fantasy","desc":"<p><em>Spyro: A Hero's Tail</em> is a 3D platformer in which the player controls a purple dragon named Spyro, as well as five other playable characters.</p><p>Spyro and his friends must eliminate the evil Red Dragon by defeating his henchmen and finding the dark gems that are draining the light from the land. Besides the action, the game also features puzzle-solving elements.</p>"},{"name":"SRS: Street Racing Syndicate","year":2004,"developer":"Eutechnyx Limited","url":"microsoft_xbox_s_part2/SRS%20-%20Street%20Racing%20Syndicate%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6057954499,"score":6.6,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Licensed","desc":"<p><em>SRS: Street Racing Syndicate</em> is an arcade racing game, offering more than 50 licensed cars, which are tunable with licensed tuning parts. The player races on tracks situated in Los Angeles, Miami and Philadelphia, both during daylight and at night. It's also possible to date 18 cute models, each with their own video clips. </p><p>The game features two modes:</p><p>In Street Mode, there are tree types of awards: money, respect and girls. Money is necessary to buy cars, tuning parts and place bets, and can be earned by winning races and collecting prizes and bets. The player receives respect points for doing tricks such as two-wheel driving or drifting. These points allow them to progress in the game (i.e. unlock races). The last type of award, girls, will date the player if they win a respect challenge. This can be a car chasing, a checkpoint run or a respect points race. There are 8 races with various crews and difficulty, each consisting of three tracks where the player will race against one or three opponents. It's also possible to drive Street Challenges (point-to-point races) against another car, where the winner takes the bet. Or the player can just cruise around the town in Cruise Zone.</p><p>Arcade mode offers four types of races: Quick Race, Checkpoint Run, Ironman (set of 3-12 races which have to be won), Speed Trial (a race against time).</p><p><em>SRS: Street Racing Syndicate</em> also features six multiplayer modes: Quick Race, Collection Race, Team Collection Race, Team Time Race, Team Position Race and Pink Slip Race. They can be played over LAN or on Internet using GameSpy Arcade.</p>"},{"name":"SSX 3","year":2003,"developer":"Electronic Arts Canada","url":"microsoft_xbox_s_part2/SSX%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6612093595,"score":8.5,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Snowboarding / skiing","desc":"<p>Shred the slopes of the world's biggest mountain - at least in the SSX world - as you attempt to become the greatest snowboarder of all time. Unlike the previous two entries in the series, you must venture around the mountain, completely free to do what you wish, in order to find challenges and races to compete in.</p><p>There are a variety of events to compete in, from your usual all-on-all race through courses, scattered with obstacles and huge jumps to perform wacky tricks, plus there's a half pipe to bust tricks, and there's plenty of challenging tricks to master, and items to grind to gain bonuses. Plus, you can ride the entire mountain whenever you like, either to practice moves or learn all the bumps and corners for the big races.</p><p>With challenges and races comes rewards, and along with trophies and medals to fill up your gallery you can also win cash prizes to purchase new items, improving your board or improving your image. The more you race the more experience your chosen character receives, leveling up your abilities and improving your technique, plus even more wild tricks to perform.</p>"},{"name":"SSX on Tour","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_s_part2/SSX%20On%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CNl%2CSv%2CNo%2CFi%29.zip","filesize":6664446106,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Snowboarding / skiing","desc":"<p>Create your skier or snowboarder and get on the slopes in this version of the SSX franchise. With a different front end interface to previous versions, which looks like a mix between MTV and a doodle book, you select the challenge you want to take part in rather than boarding your way to the event as previous versions.</p><p>With improved controls making \"Monster Jumps\" (Uber Tricks) easier to perform, everyone can look like a professional without learning button combos. As before, if you perform the same trick over and over, you won't get the points to take your skier/snowboarder from a novice to what they have a labeled \"black-diamond-dominating rockstar\".</p><p>The game promises big jumps, fast pace and lots of coloured, detailed slopes.</p><p>The GameCube version delivers Mario, Luigi and Peaches on the slopes as special characters. Each has their own moves and is accompanied by Mario-style music.</p>"},{"name":"SSX Tricky","year":2001,"developer":"Electronic Arts Canada","url":"microsoft_xbox_s_part2/SSX%20Tricky%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6433363885,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Snowboarding / skiing","desc":"<p><em>SSX Tricky</em> is EA's follow up to SSX. Tricky features far more storytelling than the original through the use of personality attributes. Rivalries develop between characters with opposing attributes, causing them to act more aggressively towards each other during races. The übertrick system adds a whole new layer to the game. These tricks are much tougher to pull off, but give you a nice boost. Performing six übertricks in a row results in a super übertrick, which rewards you with a bigger boost and causes Run DMC's \"It's Tricky\" to play. </p><p>Seven tracks return from the original accompanied by brand-new Garibaldi and Alaska tracks. The returning tracks contain up to four times as many shortcuts and hidden lines. Six of the eight riders from the original return (Jurgen and Hiro suffered off-season injuries) and are joined by six new ones. The soundtrack will feature mixes by Mix Master Mike, Aphrodite, and the Plump DJs. DVD-like bonuses include \"behind-the-scenes\" footage and a \"making of\" segment.</p>"},{"name":"Stacked with Daniel Negreanu","year":2006,"developer":"5000ft Inc.","url":"microsoft_xbox_s_part2/Stacked%20with%20Daniel%20Negreanu%20%28USA%29.zip","filesize":6775947720,"score":6.7,"genres":"Gambling > Strategy > 3rd-person (Other) > Top-down > Turn-based > Cards / tiles","desc":"<p><em>Stacked with Daniel Negreanu</em> is a poker game featuring professional poker player Daniel Negreanu. In the game players can play a game of Texas Hold 'em. </p><p>Included are some full motion videos in which Daniel Negreanu explains the basics of the game. When the player understands the rules he or she can play a single or multi table tournament. The player can play against AI opponents or with friends through a LAN or over the Internet. When playing against the AI \"speed play\" can be activated which makes the game go faster once the player folds and is temporarily out of the game.</p>"},{"name":"Stake: Fortune Fighters","year":2003,"developer":"Gameness Art Software Inc.","url":"microsoft_xbox_s_part2/Stake%20-%20Fortune%20Fighters%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6734013787,"score":4.4,"genres":"Action > 3rd-person (Other) > Isometric > Fighting > Martial arts","desc":"<p>Compete in the Stake tournament for the ultimate fame. Each battle takes place in various conditions, with one of eight characters to choose from that bring with them special abilities and moves.</p><p>Each battle has you fighting either with your basic or magic attacks and items to be used, including bombs, rocks, ice and many others.</p><p>4 player split screen options include death match, team death match and castle mode, where you must race through each level to light the sacred flames on each opponents castle.</p>"},{"name":"Star Trek: Shattered Universe","year":2004,"developer":"Starsphere Interactive, Inc.","url":"microsoft_xbox_s_part2/Star%20Trek%20-%20Shattered%20Universe%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6774854427,"score":5.3,"genres":"Simulation > Behind view > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Star Trek fans will remember the 'Mirror, Mirror' episode, and its parallel universe whereby common facts of the Star Trek universe are reversed. The Federation is now evil, the Enterprise is out for war, and most of its enemies and friends have changed sides. After hitting a wormhole, it is into this universe that your ISS Excelsior ship finds itself. </p><p>To get out of there, he must blast through 19 missions of space combat, armed with phasers and torpedoes. You will have to take on scouting missions as well as heavy attacks, passing asteroid belts and space stations. You are not limited to flying familiar ships - 6 new ones have been created for the game, and Romulan and Klingon fighters are available to switch to.</p>"},{"name":"Star Wars: Battlefront","year":2004,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Battlefront%20%28USA%2C%20Europe%29.zip","filesize":6562947282,"score":7.6,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Mecha / giant robot > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>For the first time in gaming history, after countless games depicting various aspects of the rich Star Wars universe (including some we never wanted to see), players have the chance to step into the boots of the average soldier in the wars that raged across the galaxy. Gameplay is based on the successful standards set by Battlefield 1942, but combat in Battlefront is even more massive and heated, vehicles are more predominant and the familiar starships are also included.</p><p>There are three different game modes to play: Historical Campaign (featuring a series of \"historical\" battles from the Star Wars mythos), Conquest (in which players vie for dominance of individual planets) and, of course, Instant Action. The game puts two pairs of factions at war: Republic vs Separatists and Rebel Alliance vs Galactic Empire. Each faction has four standard unit types (soldier, heavy weapons trooper, scout and pilot) plus a fifth, special unit which differs radically for each side. Famous Jedi and Sith are included as NPCs only in selected battles. Finally, the game offers almost all of the vehicles seen in the movies for players to fly, drive or hover and prevail.</p>"},{"name":"Star Wars: Battlefront II","year":2005,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Battlefront%20II%20%28USA%2C%20Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":6037856179,"score":7.4,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Mecha / giant robot > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>A second helping of Battlefront provides all the same multiplayer action with an added level of spice, and plenty of new content.</p><p>Along with an updated assortment of multiplayer maps based upon the Star Wars Saga, including Episode III: Revenge of the Sith, you now have the opportunity to fight as some of the greatest heroes, including the Skywalker family, Darth Vader, Yoda, The Emperor himself and Princess Leia, among others. An expanded single player campaign has you fighting as Vader's 501st Legion of troops, fighting in the Clone Wars as the undercurrent of evil, soon to be known as the Empire, takes its place in the Galaxy.</p><p>Now you can also take to the stars in specially developed multiplayer levels where your skill in an X-Wing or TIE-Fighter come to the fore. Defeat enemy ships and destroy the heavy cruisers and capital ships to achieve victory, or land within enemy territory and blow up a Star Destroyer from the inside.</p>"},{"name":"Star Wars: Episode III - Revenge of the Sith","year":2005,"developer":"The Collective, Inc.","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Episode%20III%20-%20Revenge%20of%20the%20Sith%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":6245091883,"score":6.3,"genres":"Action > 3rd-person (Other) > 2D scrolling > Beat 'em up / brawler > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Star Wars: Episode III - Revenge of the Sith</em> is an action game that follows the story of the <em>Star Wars</em> movie with the same name. The game basically lets the player play through the action sequences of the movie (such as the battles against the droid army), leaving many other events out. It features two controllable characters, the Jedi knight Obi-Wan Kenobi and his young apprentice Anakin Skywalker. Both mainly fight using their lightsabers, the unique weapon of the Jedi, but they can also use blasters and other weapons. There are several kinds of physical moves that the player can execute with the lightsaber. Gradually they will also learn to use various Force techniques, which work like magical spells in the game.</p>"},{"name":"Star Wars: Jedi Knight - Jedi Academy","year":2003,"developer":"Raven Software Corporation","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Jedi%20Knight%20-%20Jedi%20Academy%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6784692297,"score":7.6,"genres":"Action > 1st-person > Behind view > RPG elements > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p><em>Star Wars: Jedi Knight - Jedi Academy</em> is the sequel to Star Wars: Jedi Knight II - Jedi Outcast. The player is cast as Jaden Korr, a padawan at the Jedi Academy taught by Luke Skywalker and Kyle Katarn. Both the character and his lightsaber are to be created at the beginning of the game. Throughout the game, the player will acquire several force powers and weapons, such as lightning and the Tenlos Disruptor Rifle. As he progresses through the different missions, he may be seduced by the dark side of the Force...</p>"},{"name":"Star Wars: Jedi Knight II - Jedi Outcast","year":2002,"developer":"Raven Software Corporation","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Jedi%20Knight%20II%20-%20Jedi%20Outcast%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6783778051,"score":8,"genres":"Action > 1st-person > Behind view > RPG elements > Shooter > Direct control > Sci-fi / futuristic > Licensed","desc":"<p>In <em>Jedi Outcast</em>, you once again play Kyle Katarn, star of LucasArts' Star Wars-inspired 1st-person shooters Star Wars: Dark Forces and Star Wars: Jedi Knight - Dark Forces II.</p><p>Kyle has retired from being a Jedi fearing consequences from the Dark Side of the Power found within himself during his chase of the foul Sith-Lord Jerec into the lost vale of the Jedi at the end of Dark Forces 2. Chronologically taking place after the second Star Wars Trilogy, you'll meet various well known people from the original Star Wars movies like Luke Skywalker himself and Lando Calrissian.</p><p>Also following the tradition of its predecessors, you explore the surroundings in the typical 3D environment and can use a lot of different weapons and gear from the Star Wars Universe, including the famous Jedi Weapon, the light saber.</p>"},{"name":"Star Wars: Jedi Starfighter","year":2002,"developer":"LucasArts Entertainment Company LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Jedi%20Starfighter%20%28Europe%29.zip","filesize":6626852964,"score":7.4,"genres":"Action > Behind view > Shooter > Flight / aviation > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Based loosely on the vehicles, events and characters of Star Wars Episode II: Attack of the Clones, you must pilot the new Jedi Starfighter, a sleek force powered vehicle, to defend a planet from total destruction. </p><p>Jedi Adi Gallia  is trusted by her former master Mace Windu to stop an incoming invasion on the Karthak system planned by Cavic Toth. With the aid of Nym and his ship Havoc, you must control both the Jedi Starfighter and the Havoc to stop the incoming invasion.</p><p>The Jedi Starfighter, much like a Jedi, uses force powers as its main weapons and defense systems. You can use the likes of Force Lightning and Force Shockwave to knock down enemies, and defend yourself with Force Shield and Force Reflex.</p><p>Also included on disk is a two player co-operative mode and deatmatch/capture the flag options.</p>"},{"name":"Star Wars: Knights of the Old Republic","year":2003,"developer":"BioWare Corporation","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Knights%20of%20the%20Old%20Republic%20%28Europe%29.zip","filesize":5571039529,"score":8.5,"genres":"Role-playing (RPG) > 3rd-person (Other) > Real-time > Puzzle elements > Sci-fi / futuristic > Licensed","desc":"<p>Four thousand years before the events depicted in the Star Wars movies, the political and ideological situation is not much different from what we have seen in the prequel trilogy: the Republic and the Jedi Order are fighting against two powerful Sith lords, Darth Revan and his apprentice, Darth Malak. It is said that the former was successfully defeated by the Jedi, and that Darth Malak betrayed his mentor and is planning to take on the Republic by himself. His aggression is so successful that some Jedi have decided to join his ranks. A seemingly ordinary soldier of the Republic is traveling aboard a space ship that is attacked by Darth Malak's minions. Narrowly escaping, the soldier meets a female Jedi named Bastila, one of those who have fought Darth Revan in the decisive battle. With her help, the soldier must learn to become a Jedi, stop Darth Malak, and discover the truth about his or her own past.</p><p><em>Knights of the Old Republic</em> is a role-playing game that uses the <em>Star Wars D20</em> rule system, which is similar to the 3rd Edition of Dungeons &amp; Dragons. Character development and combat are handled similarly to BioWare's previous RPGs such as Baldur's Gate series. Combat engine follows similar \"real-time with pause\" rules. There are only three active combatants on the player's side (as opposed to six in <em>Baldur's Gate</em>). Several characters join the party and can be switched at the player's will.</p><p>Eventually, the protagonist will have to train at the Jedi academy to earn a lightsaber and force moves. Force powers include stun, force pull (which pulls opponents or objects toward the player-controlled character), the Jedi Mind Trick, which persuades people to see things the player's way, and many others. The player has various weapons at his or her disposal, from the lightsaber to blasters, grenades, ion rifles, etc. </p><p>Throughout the game, the player will visit many Star Wars locations that appeared in the movies, such as Kashyyyk, the homeworld of the Wookiees, the desert planet of Tatooine, and others. Interacting with characters in various ways and performing side quests influences the protagonist's stand with the forces of Light and Darkness. The player can turn the main character into a flawless Jedi, a ruthless Sith, or anything in between. Some of the player's choices influence major events that occur within the storyline.</p>"},{"name":"Star Wars: Knights of the Old Republic II - The Sith Lords","year":2004,"developer":"BioWare Corporation","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Knights%20of%20the%20Old%20Republic%20II%20-%20The%20Sith%20Lords%20%28Europe%29.zip","filesize":5669278602,"score":8.1,"genres":"Role-playing (RPG) > 1st-person > Behind view > Real-time > Sci-fi / futuristic > Licensed","desc":"<p>Five years after the events depicted in Knights of the Old Republic, the Sith have become stronger and more determined to rule the Galaxy. The Jedi Order is nearly exterminated. A mysterious ex-Jedi has been exiled from the Order and is traveling alone. This Jedi had served under Darth Revan (when the latter was still on the Light side of the Force) during the Mandalorian Wars, but due to enigmatic circumstances was forced to retire. Now the past is catching up with the Jedi, and soon he or she will have to choose the side to fight on.</p><p><em>The Sith Lords</em> looks and plays very similarly to its predecessor, also being based on the <em>Star Wars d20</em> role-playing rule set (which, in its turn, is similar to the 3rd Edition of Dungeons &amp; Dragons) and having the same combat engine, character development, and a Light and Dark ethical system, which judges the player's decisions and actions and influences story events and characters' responses. Additions to the gameplay include a lightsaber-crafting system, which allows augmenting lightsabers with various items, new Force powers, and the possibility to influence the alignments of the characters in the player-controlled party through conversation choices and other decisions. Most of the exploration and the combat sequences is done using a party of three, including the protagonist and two companions. However, certain parts of the game will force the player to travel alone, or to control a party made exclusively out of companions.</p><p>A large part of the military equipment can be upgraded using any workbench that can be found throughout the game world, including one available at all times on the ship that the player uses to travel between planetary systems. Different types of items have more than one piece that can be augmented. For example, the armor has two slots for upgrades (overlay and underlay), while ranged weapons have three (targeting, firing chamber, and power pack), and lightsabers have six. The easiest way to get additional upgrades is to either buy them or loot them, however they can be created as well at a workbench with the right components and enough repair skill. Medical items are a different sort and they can be crafted using lab stations.</p><p>At various moments during the game, the player has the opportunity to play some mini games: a card game called Pazaak, shooting targets using a turret from a first-person view, and swoop racing.</p>"},{"name":"Star Wars: Obi-Wan","year":2001,"developer":"LucasArts Entertainment Company LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Obi-Wan%20%28Europe%29.zip","filesize":6158806706,"score":6.2,"genres":"Action > Behind view > Sci-fi / futuristic > Licensed","desc":"<p><em>Star Wars: Obi-Wan</em> is a third person action game in which players take the role of Obi-Wan, a Jedi apprentice.</p><p>As Obi-Wan, players investigate an underworld crime ring weeks prior to the Trade Federation invasion of Naboo. The player will travel through a number of areas, such as Coruscant, Naboo and Tatooine, many of which are familiar from the movie series, while fighting Battle Droids, Tusken raiders, thugs, and many other enemies.</p><p>Obi-Wan's lightsaber is the player's primary weapon, which has multiple methods of attack depending on how it's used. Players also have access to Force Powers, which provide an advantage over their less talented foes. The player can force push an enemy, force grab their weapon, pick up an object and throw it at them, or force jump to high places.</p><p>The game has both a single player mode and a multiplayer mode called Jedi Arena, where players can battle with Jedi masters such as Mace Windu.</p>"},{"name":"Star Wars: Republic Commando","year":2005,"developer":"LucasArts","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Republic%20Commando%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":5422469615,"score":7.7,"genres":"Action > 1st-person > Tactical shooter > Sci-fi / futuristic > Licensed","desc":"<p>Set during the events of the movie, <em>Star Wars: Episode II: Attack of the Clones</em>, a secret army of clones has been grown on planet Kamino, designed from the DNA of Jango Fett. These clones are trained for battle and to fight for the Galactic Republic, trained in specific talents and abilities. One such specialization is Delta Squad, a group of four commandos trained for ground combat, recon work and outfitted with bacta healing implants. Delta squad is composed of four members: RC-1138 (\"Boss\"): the squadron leader bred for tactics, RC-1140 (\"Fixer\"): a computer cracker, RC-1207 (\"Sev\"): a hunter and marksman, and RC-1262 (\"Scorch\"): a demolitions specialist. Delta Squad and the rest of the clone army are deployed to their first battle, on the planet Geonosis.</p><p><em>Star Wars: Republic Commando</em> is a first-person squad-based shooter set in the Star Wars universe with tactical squad gameplay. Players take the roll of Boss, the leader of Delta Squad. Like most first-person shooters, the emphasis in gameplay is on action. Republic soldiers use a standard gun weapon, the \"Blaster\", in order to shoot opponents in front of them. Blasters can be attached to perform three different functions, with individual ammunition: a standard fiting mode, a sniper mode and an anti-armor mode. Players also carry a smaller energy pistol that automatically charges itself. New weapons can be found from a defeated enemy or found lying around on some levels, however only one may be carried at any given time. Some player weapons allow zooming functions for more accurate firing. The player also carries 4 different types of grenades, which are: thermal detonators (basic blast), sonar detectors (limited proximity detection), electrostatic charges (disables electronics and droids) and flash detonators (blinds foes). All of which can be thrown directly in front of the player. </p><p>Each member of Delta Squad has a personal shield that automatically recharges after a short time and a health bar which can only be replenished by healing bacta. Bacta is found at appropriate dispensers throughout the levels, and additionally each member of the squad carries an emergency bacta device to \"revive\" any member of the squad who falls in battle. Should the player be the one to lose all health, they watch the level from a hazed view and can issue a last order for other squadmates to try and revive them. Should all 4 members of Delta Squad fall in battle, the game is over.</p><p>The main feature of Republic Commando is the 4-man squad. Using a \"one-touch\" control system, the player gives orders to members of the squad. The first type of command is for setting the squad's attitude: Search and Destroy (move forward), Form Up (stay close), Hold Position, and Recall from any assigned positions. The other type of orders are done by highlighting different positions displayed on the player's HUD and assigning a Delta member to perform the appropriate action. All of these positions are pre-defined in the level, with only a single action being possible. Examples of positions include: Cover for a sniper, barriers which need to be destroyed, turrets that can be mounted and used to attack the enemy, mines which can be disarmed, control panels which can be hacked, etc. Despite the hint of specialization designations and character personalities, any squad member, including the player, can be used to perform any action.</p><p>Multiplayer functionality includes regular deathmatches and capture the flag. There are no squad-based commands in multiplayer, though players may be placed on individual \"teams\" to work towards their goal.</p>"},{"name":"Star Wars: Starfighter","year":2001,"developer":"LucasArts Entertainment Company LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20Starfighter%20Special%20Edition%20%28USA%29.zip","filesize":6336459602,"score":7.2,"genres":"Action > Simulation > Behind view > Space flight > Sci-fi / futuristic > Licensed","desc":"<p>Based on the events of Star Wars Episode 1: The Phantom Menace, there are three main characters: Rhys Dallows, Vana Sage, and Nym, each with their own perspectives on the events surrounding the battle for Naboo. Each character has their own ships for you to fly, with both positives and negatives attached, but either way you must stop the Trade Federation and their plans to destroy the peaceful planet.</p>"},{"name":"Star Wars: The Clone Wars","year":2003,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20The%20Clone%20Wars%20%28Europe%29.zip","filesize":6779069482,"score":7.1,"genres":"Action > 1st-person > Behind view > Shooter > Sci-fi / futuristic > Licensed","desc":"<p>Beginning where Star Wars Episode II: Attack of the Clones left off, you must take control of either Anakin Skywalker, Mace Windu or Obi-Wan Kenobi and lead the Republic Army against the Confederacy of Independent Systems.</p><p>The Clone Wars picks up with Mace Windu escorting the Jedi ambush to the Geonosis arena, which leads to the Battle of Geonosis and the start of the Clone Wars. After the Battle of Geonosis, Anakin and Obi Wan are sent to patrol a dead part of Republic sector, until a massive Confederate fleet ambushes the strategically useless planet of Rhen Var. After this, Anakin, Obi Wan soon discover that there may be something darker behind the invasion of Rhen Var. They find out about the Dark Reaper, an evil and powerful Sith device that could harvest the power of the living and use it as a concentrated weapon. Now it is up to the Republic to prevent this weapon from ever activating and destroying the galaxy!</p><p>The Clone Wars has you deep inside the battles of the Old Republic through 16 missions, piloting a range of vehicles including speeder bikes, Republic Gunships and fighter tanks as well as the weapon of the Jedi, your lightsabre, for close combat. Whereas the Rogue Squadron series concentrated on aerial battles, The Clone Wars contains almost all ground battles. You must fight as Anakin Skywalker, Obi Wan Kenobi, Mace Windu, and others throughout the game to prevent the Confederacy from gaining a deadly weapon. Multiplayer options are also included for up to four players with game types including deathmatch, conquest, and a co-op ground and vehicle survival mode.</p>"},{"name":"Star Wars: The Clone Wars / Tetris Worlds","year":2003,"developer":"","url":"microsoft_xbox_s_part2/Star%20Wars%20-%20The%20Clone%20Wars%20%2B%20Tetris%20Worlds%20%28USA%29.zip","filesize":6623209270,"score":"","genres":"Compilation","desc":"<p>This compilation includes:</p><ul><li>Star Wars: The Clone Wars</li><li>Tetris Worlds</li></ul>"},{"name":"Starsky & Hutch","year":2003,"developer":"Minds Eye Productions","url":"microsoft_xbox_s_part2/Starsky%20%26%20Hutch%20%28USA%29.zip","filesize":6677806942,"score":6.8,"genres":"Racing / Driving > Behind view > Shooter > Direct control > Automobile > Contemporary > Crime > Licensed","desc":"<p><em>Starsky &amp; Hutch</em> is an arcade racing game based on the popular TV series from the 70s, released to tie in with the film. The game includes 18 missions, each based on an episode of the TV show and introduced by Antonio 'Huggy Bear' Fargas. There is also a free roaming mode, in which the player explores the GTA-esque environment looking for action and trouble.</p><p>Like the film, the game does not entirely play it straight. Starsky &amp; Hutch are actually shooting a TV show, and the scoring for each mission reflects how ratings-friendly your driving is. You are awarded gold, silver or bronze medals for each mission depending on performance, and must get at least 1 gold and 2 silvers on season 1 for a second season to be commissioned, and 3 golds and 2 silvers in season 2 for there to be a third for you to play through.</p><p>The overall goal in each mission is usually to chase and destroy a criminal's car. There is always a secondary target as well. In addition, the player will gain viewers by hitting the bad guy, pulling off elaborate jumps and skids, nearly hitting civilians, and hitting the bonus targets such as canisters which are strewn through the levels. Hitting civilians will lose viewers.</p><p>Dave Starsky is the guy behind the steering wheel and Ken 'Hutch' Hutchinson shoots out of the windows of the car. On PS2 and XBox a second player can take care of the shooting, using either a light gun or a standard controller. During single player, the aiming is automatic for shooting.</p>"},{"name":"State of Emergency","year":2003,"developer":"VIS Entertainment Limited","url":"microsoft_xbox_s_part2/State%20of%20Emergency%20%28Europe%29%20%28En%2CFr%2CIt%29.zip","filesize":6821261135,"score":6.1,"genres":"Action > 3rd-person (Other) > Fighting","desc":"<p>It's some time in the far future, where The Corporation controls everything. People are generally happy, except for a resistance group called Freedom, who do not like The Corporation's dictatorial rule.</p><p><em>In State of Emergency</em>, the player can choose from one of five different characters: Spanky, an ex-gang member; McNeil, a disgruntled ex-cop; Bull, a criminal in prison; Libra, a lawyer; and Phreak, an orphan. The player must complete a variety of missions, ranging from Rescue missions to \"Kill This Person\" missions to \"Blow Up This ...\" missions. </p><p>The player has many different weapons at his or her disposal, including shotguns, machine guns, pistols, knives, rocket launchers, tear gas launchers, flame-throwers, gatling guns, pepper spray, molotov cocktails and more. It is even possible to use street props, such as boxes, construction cones, benches, signposts, trashcans, and more. Breaking and entering stores allows the player to use the items there as a weapon, such as a DVD player or a television. There are many different enemies such as gang members, skinheads, and The Corporation forces.</p>"},{"name":"Steel Battalion","year":2002,"developer":"Nude Maker Co., Ltd.","url":"microsoft_xbox_s_part2/Steel%20Battalion%20%28Europe%29.zip","filesize":6611235834,"score":7.9,"genres":"Action > Simulation > Strategy > 1st-person > Mecha / giant robot > Sci-fi / futuristic","desc":"<p><em>Steel Battalion</em> is a 'mech game in which the player takes control of mechanized tanks, known as \"VT\"s (or Vertical Tanks), using a forty button controller with footpedals.</p><p>Not too far in the future, military unrest is rampant throughout the world, and the player has just recently been promoted. As the pilot of a state-of-the-art mech known as a Vertical Tank, the player must take charge of keeping the peace. Players must master the integrated controller to clear their way to victory.</p><p><em>SB</em> comes packaged with a forty button controller, consisting of three separate boards, and a footpedal. On the controller there are buttons that activate commands such as switching radio frequencies, activating the windshield wipers, changing radar scanners, switching weapons, firing weapons, locking abilities, defense mechanisms, and more. The controller has two joysticks, one which moves the 'mech forward and backward, and one that allows the player to move and aim. The footpedal controls speed and braking, independent of the stick, and a third pedal controls slide-strafe.</p><p>An interesting feature is that of the eject button. Encased in clear plastic, similar to an \"abort\" button at a military installation, this command can save the player's life. As the player nears death they must quickly flip the lid and push the button, otherwise they die, and death in the game is forever, as the pilot data is erased from the hard drive/memory unit, forcing players to start over.</p><p>To defeat enemy mechs the player is equipped with a variety of high-tech weapons, such as Plasma Torches, Twin Pod Rocket Launchers, and a 270mm Rifle Cannon.</p><p>There are a total of fifteen 'mechs to pilot, and ten missions to accomplish.</p>"},{"name":"Steel Battalion: Line of Contact","year":2004,"developer":"Nude Maker Co., Ltd."},{"name":"Still Life","year":2005,"developer":"Microïds Canada Inc.","url":"microsoft_xbox_s_part2/Still%20Life%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6549858516,"score":7.6,"genres":"Adventure > 1st-person > 3rd-person (Other) > Graphic adventure > Puzzle elements > Point and select > Detective / mystery","desc":"<p>Two separate murder cases, in two separate lifetimes -- so alike .. so similar in the smallest of details that one could believe they were performed by the same person. Impossible! One of the crimes took place 75 years ago, while the other just happened! Is someone copying an old serial killer .. or is it remotely possible that the same murderer is still alive and committing more crimes?</p><p>Victoria McPherson is an FBI agent investigator based in Chicago. While visiting her father and talking about their family, they discuss her grandfather, former P.I. Gustav McPherson (from Post Mortem). Finding Gus' diary in an old attic trunk, she picks it up and begins to read ...</p><p>In this point and click mystery adventure, you'll play both Victoria in modern Chicago as well as her grandfather, Gus, in Prague in the 1920s. Meet and talk with over 20 characters, explore Chicago and Prague and solve puzzles while investigating in two time periods.</p>"},{"name":"Stolen","year":2005,"developer":"Blue52 Games Limited","url":"microsoft_xbox_s_part2/Stolen%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6284572594,"score":5.5,"genres":"Action > Behind view > Stealth > Direct control > Cyberpunk / dark sci-fi > Spy / espionage","desc":"<p>You play as Anya Romanov, a thief living in a not too distant future. You and your partner in crime, Louie Palmer, have recently landed a job to steal a statue that's been placed in a museum for an exhibition. Once you're in the museum things turn out not to be quite so easy and not quite the way the should be.</p><p>The gameplay resembles Thief: The Dark Project but also feels a lot like Splinter Cell and Metal Gear Solid to an extent. Several elements can be recognized from those games, but many of these have been changed slightly or just implemented in an original way. The core of the game is about stealing, without killing.</p>"},{"name":"Street Fighter: Anniversary Collection","year":2004,"developer":"Capcom Production Studio 2","url":"microsoft_xbox_s_part2/Street%20Fighter%20Anniversary%20Collection%20%28USA%29%20%28En%2CJa%29.zip","filesize":6673975406,"score":7.6,"genres":"Action > Compilation > Fighting","desc":"<p>The <strong>Street Fighter Anniversary Collection</strong> celebrates 15 years of Street Fighter supremacy. This compilation brings you the best of the best, featuring Hyper Street Fighter II – a blend of five Street Fighter II games in one – plus the arcade gem Street Fighter III: Third Strike. </p><p>Hyper Street Fighter II combines Street Fighter II, Street Fighter II Champion Edition, Street Fighter II Hyper Fighting, Super Street Fighter II: The New Challengers, and Street fighter II Turbo! The vast selection of characters allows for your most extreme Street Fighter dream matches in this mix and match free for all. Included in Gallery Mode is a library of all the various introductions, soundtracks, images, and character background from all of the Street Fighter II series!</p><p>Street Fighter III: Third Strike was up until now a rare arcade gem that not too many people got to play. It’s unique features include (a) the Grade Judge System, where each player’s performance is evaluated at the end of each match, (b) the Progressive Hit Frame System, programming that makes for a much more realistic “hit frame” or “collision box” detection, (c) the Super Arts Move, three special Super Arts available to each character, (d) Parrying, where players can parry opponents’ attacks by mastering the direction buttons, and (e) the Leap Attack, where players can attack an opponent in crouching block.</p>"},{"name":"Street Hoops","year":2002,"developer":"Black Ops Entertainment, LLC","url":"microsoft_xbox_s_part2/Street%20Hoops%20%28Europe%29.zip","filesize":6420952725,"score":6.4,"genres":"Sports > 3rd-person (Other) > Basketball","desc":"<p>Take on some of the hottest street ballers from AND1 or create your own custom baller. Fully equipped character generator all the way up to the bling bling. Choose from any of the renowned street ball courts from Rucker Park to the Venice Courts or go at it with the half-court game.</p>"},{"name":"Strike Force Bowling","year":2004,"developer":"Lab Rats Games, Inc.","url":"microsoft_xbox_s_part2/Strike%20Force%20Bowling%20%28USA%29.zip","filesize":6887172439,"score":6.3,"genres":"Sports > 1st-person > 3rd-person (Other) > Bowling","desc":"<p>The game of ten-pin bowling sees players attempt to knock down an arrangement of 10 pins in a triangular shape, by bowling a ball down a gutter-lined path. You have two shots, and score for how many you knock down on each bowl. As a reward for knocking down all ten pins, you will also get the score from your next bowl doubled if this took 2 shots (known as a 'spare'), or your next two bowls if it took 2 shots (known as a 'Strike').</p><p>In this implementation, you can play in one of 8 different settings, including a tropical island, ancient Egypt or on a pirate ship. There are 8 different AI players, each with varied appearance and reaction, and variable bowling ability. A range of playing modes including Tournament Play, Skins and practice are featured. Controls are designed to be easy to use, and ball reactions incorporate physics, ball friction and delivery style.</p>"},{"name":"Stubbs the Zombie in Rebel Without a Pulse","year":2005,"developer":"Wideload Games, Inc.","url":"microsoft_xbox_s_part2/Stubbs%20the%20Zombie%20in%20Rebel%20Without%20a%20Pulse%20%28Europe%29.zip","filesize":6899101185,"score":7.3,"genres":"Action > Behind view > Direct control > Fantasy > Sci-fi / futuristic","desc":"<p><em>Stubbs the Zombie in Rebel Without a Pulse</em> is a 3D action game that turns the tables on the age old tradition of zombie games. In this game, you play as the zombie, fight off the humans, and eat their brains. Stubbs the Zombie is set in a retro-futuristic city of the future and follows Stubbs over the course of one day as he zombifies the entire city.</p><p>Before becoming a zombie Edward 'Stubbs' Stubblefield was a traveling salesman in the 1930s who got himself killed. Flash forward to 1959 where the world's richest man, Andrew Monday, has built his dream city, Punchbowl Pennsylvania, on top of poor Stubbs' grave. Stubbs will have to claw through all of Punchbowl's citizens, including the local police department, crazy militiamen, nerdy scientists, and a deadly barbershop quartet.</p><p>Luckily Stubbs has some help. Every human that he kills comes back as a zombie and joins Stubbs in his quest for brains. Stubbs also learns a series of special body powers. He can use his unholy flatulence to stun enemies, he can throw his pancreas as an exploding zombie grenade, and he can detach his own head and bowl it into enemies. Stubbs' most powerful ability is that he can detach his hand and use it as a scout, climbing up walls and the ceiling, and then use it to take control of enemy humans and their weapons.</p>"},{"name":"Sudeki","year":2004,"developer":"Climax Solent","url":"microsoft_xbox_s_part2/Sudeki%20%28World%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6256722335,"score":7,"genres":"Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Action RPG > Fantasy","desc":"<p>Set in a world where realms of dark and light co-exist on top of each other, Queen Luscia of Haskillia is troubled by invasions of the Aklorians. Four heroes with unique abilities: the swordsman Tal, sorceress Ailish, the shape-shifting huntress Buki and the powerful Elco, combine their forces to aid the queen while they make their way through the struggle between dark and light.</p><p>You control the four characters as a team in a full 3D world with a third person view. Sudeki innovates through the use of realtime fighting scenes with combos, ranged attacks, evasion, the use of shields and Matrix-style effects including bullet-time. The characters are able to combine their forces to produce super-strike attacks. As usual, you can gain skills, spells and weapons to upgrade and add to as you go along and the plot is full of surprising interventions, betrayal and dangerous foes.</p>"},{"name":"Suffering, The","year":2004,"developer":"Surreal Software, Inc.","url":"microsoft_xbox_s_part2/Suffering%2C%20The%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":5700309889,"score":7.8,"genres":"Action > Behind view > Shooter > Survival horror > Direct control > Horror > Regional differences","desc":"<p>You play the role of Torque, a death row inmate with an ambiguous past who has been imprisoned for slaying his ex-wife and children.  Shortly after being interred in a new prison on Carnate Island, an earthquake appears to release demonic creatures based on the many modes of execution used in the sordid history of the island.  These creatures proceed to eliminate much of the prison population, leaving only you and a scant few other inmates and guards to eliminate the horde and find out what has happened.</p>"},{"name":"Suffering, The: Ties That Bind","year":2005,"developer":"Surreal Software, Inc.","url":"microsoft_xbox_s_part2/Suffering%2C%20The%20-%20Ties%20That%20Bind%20%28Europe%29%20%28En%2CEs%2CIt%29.zip","filesize":5415780849,"score":7.6,"genres":"Action > 1st-person > Behind view > Survival horror > Horror > Regional differences","desc":"<p><em>The Suffering: Ties That Bind</em> follows in the footsteps of its predecessor by combining a disturbing horror atmosphere with action/shooter gameplay. Players can switch between third person and first person depending on their preference, and will shoot a lot of hideous demonic manifestations of evil before the game is done. The player is also able to transform into a hideous creature at key times in the game, which allows him to engage in intense melee combat. The game includes a morality system which records the player's actions during gameplay and changes the story accordingly, and also alters the player's creature form. Everything from the first The Suffering has been refined and turned up a notch for the sequel. </p><p>The story picks up right where the first game left off. The player once again takes on the role of Torque, former death row inmate with a mysterious past. Now returning to his home town of Baltimore, Torque must confront the mysterious Blackmore, the man who may or may not have killed Torque's family. But it won't be easy, as the hideous creatures from the first game have now overrun the streets of Baltimore. Will Torque finally be able to come to grips with his past?</p>"},{"name":"Super Bubble Pop","year":2002,"developer":"Runecraft Ltd.","url":"microsoft_xbox_s_part2/Super%20Bubble%20Pop%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6871686351,"score":6.1,"genres":"Puzzle > Diagonal-down > Real-time > Tile matching puzzle","desc":"<p>A combination of Tetris and Bust-A-Move, Super Bubble Pop has you controlling a character along the bottom of the playfield, who you use to throw bubbles of different colours towards the other side of the playfield. As you throw them down the line, they will stack up in piles of six. Linking three bubbles together will pop them (remove them from the field), and if there is a stack of six, the bubbles on the way will form a new stack in front of it.</p><p>The aim of the game is to remove all bubbles from the field, but there is another way of completing a game. Tokens will appear during play, and by collecting enough, you can move on to the next round regardless of what you have on the playfield.</p>"},{"name":"Super Collapse! II","year":2004,"developer":"GameHouse, Inc."},{"name":"Super Monkey Ball Deluxe","year":2005,"developer":"Amusement Vision, Ltd.","url":"microsoft_xbox_s_part2/Super%20Monkey%20Ball%20Deluxe%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6287582600,"score":7.7,"genres":"Action > Compilation > Puzzle > Behind view > Arcade > Mini-games > Party game > Direct control","desc":"<p>This game is basically a fusion of Super Monkey Ball 1 and 2 for the PS2 and XBox. All of the levels from those two games are available in this collection, and all of the minigames are already unlocked and included. Formerly only available to GameCube players, the Super Monkey Ball series has made it to the PS2 and Xbox after a wait of almost 3 and a half years.</p><p>The game itself plays very much like the old arcade game Marble Madness. You control a monkey in a ball, and you have to navigate it through many perilous labyrinths to the finish. In the previous two games you had limited lives/tries, but here you have infinite lives, which makes it all the easier.</p>"},{"name":"Superman Returns","year":2006,"developer":"EA Tiburon","url":"microsoft_xbox_s_part2/Superman%20Returns%20%28Europe%29.zip","filesize":6705055353,"score":5.7,"genres":"Action > 3rd-person (Other) > Sci-fi / futuristic > Licensed","desc":"<p><em>Superman Returns</em> is based on the movie of the same name. You control the man himself as he flies around Metropolis, saves citizens and fights natural disasters, fires and supervillains alike.</p><p>You have constant access to Superman's powers including heat vision, freeze breath, invulnerability and flight at supersonic speeds, though the former two are limited by a stamina bar. Unusually for this genre, Superman himself does not take damage and the challenges are all built around saving others from harm.</p><p>Combat is accomplished through melee (you learn new combos as you progress in the game) as well as direct application of Superman's heat vision and freeze breath. Additionally, you may pick up objects, from the Daily Planet globe to tanker trucks, to throw at villains. You can also rip down a lamppost and use it as a club.</p><p>Metropolis is presented as a wide open world where you can fly anywhere and perform any of the side missions at any given time. Besides the main story missions, there are 200 kittens to rescue and many fires to put out.</p><p>The basic game is broken up a bit with two rather different sequences. There is a race around the city against Myxyzptlk and a Bizarro mode, in which you must destroy the city.</p>"},{"name":"Superman: The Man of Steel","year":2002,"developer":"Circus Freak Studios","url":"microsoft_xbox_s_part2/Superman%20-%20The%20Man%20of%20Steel%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6566421651,"score":5.7,"genres":"Action > Behind view > Licensed","desc":"<p>Two of Superman's biggest rivals, Brainiac 13 and Lex Luthor, have plans for world domination. It's nothing new for the caped hero, but he must use all of his strength to stop both villains from taking over the world.</p><p>Based on the comic books stories (and not the movies and animated cartoon series of recent years), you take control of Superman from a 3rd person perspective. You have full control of his many powers, from flying around at the speed of light to using freeze breath, x-ray and heat vision. Time is a factor, so you must complete each task quickly, whether it be fighting off goons to chasing down a crim.</p>"},{"name":"SVC Chaos: SNK vs. Capcom","year":2004,"developer":"SNK Playmore Corporation","url":"microsoft_xbox_s_part1/SNK%20vs.%20Capcom%20-%20SVC%20Chaos%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6756832758,"score":6.2,"genres":"Action > Side view > 2D scrolling > Arcade > Fighting > Direct control > Martial arts","desc":"<p>This is the latest installment of the Capcom/SNK crossover series; this time around not developed by Capcom, but by SNK - hence the change in title from \"Capcom vs SNK\" to \"SNK vs Capcom\". It's again an oldschool-style 2D beat'em'up with a wide selection of characters from SNK's and Capcom's classic Beat'em'Up series.</p>"},{"name":"SWAT: Global Strike Team","year":2003,"developer":"Argonaut Games PLC","url":"microsoft_xbox_s_part2/SWAT%20-%20Global%20Strike%20Team%20%28Europe%29%20%28En%2CFr%2CEs%29.zip","filesize":6353335395,"score":7.2,"genres":"Action > Simulation > Strategy > 1st-person > 3rd-person (Other) > Shooter > Tactical shooter > Contemporary > Crime > Regional differences","desc":"<p><em>SWAT: Global Strike Team</em> is both a first person shooter and a strategy game since it combines the tactical strategic elements of SWAT 3 and the arcade action of Virtua Cop.</p><p>The SWAT: GST is an international, specialized squad whose main objective is to protect, defend and save the lives of the innocent. The storyline takes place five years in the future - in 2008, the year the GST was formed. As team leader Mathias Kincaid, formerly with US Army Delta Force, players will lead his squad all the way from basic training to full blown secret ops. </p><p>There are 21 single-player and 10 multiplayer-only co-op missions involving search and rescue operations against terrorist factions. Modes of play include: Campaign, Co-op, Free-for-all, Team Deathmatch, and Time Attack. Orders are issued to the team members by way of the controller interface or an optional voice recognition system with a communication headset. The game offers a variety of assault weapons plus tools, like night vision goggles.</p><p>A new engine was designed specifically for this game to provide realistic shadows and a film-like appearance through the use of special filters.</p>"},{"name":"SX Superstar","year":2003,"developer":"Climax Solent","url":"microsoft_xbox_s_part2/SX%20Superstar%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6793959436,"score":5.6,"genres":"Racing / Driving > Sports > 1st-person > Behind view > Direct control > Motorcycle > Off-roading > Track racing","desc":"<p>SX superstar is a motocross racing game. In arcade mode, you can pick a rider, bike, and track, and have a quick race against the AI riders.  In championship mode you start as a poor, amateur rider, and you try to work your way up to motocross stardom.  You have to manage your finances, get sponsorships, and buy better bikes in order to beat your opponents.  You have to do well in a variety of races including arenas, bajas, and A2Bs, in order to get promoted to higher leagues.</p>"},{"name":"Syberia","year":2003,"developer":"Microïds Canada Inc.","url":"microsoft_xbox_s_part2/Syberia%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6485307659,"score":7.7,"genres":"Adventure > 3rd-person (Other) > Graphic adventure > Puzzle elements > Steampunk","desc":"<p>Kate Walker is a lawyer who has been entrusted by the Universal Toy Company to negotiate the takeover of an old luxury toy and automaton factory. Over the centuries, the factory has been developing clockwork devices, specializing in perpetual mechanical movement. The factory's ambitions, however, are ill-suited to the contemporary economic climate, and the elderly Anna Voralberg, at the helm of the Valadilene factory for more than half a century, has decided to sell up. </p><p>It turns out that the takeover might not be as straightforward as expected. The day that Kate Walker arrives, Anna Voralberg is being buried. What is more is that she has left an heir – her brother Hans. But Hans had left the valley at the end of the thirties and never returned, and was actually believed to be dead. However, a letter written by Anna in the days leading up to her death reveals that Hans is well and truly alive and living somewhere in Siberia. Valadilene's elderly notary entrusted to take care of Anna's affairs suggests that Kate find Hans Voralberg as he is now the only person in a position to ratify the sale of the family business. </p><p><em>Syberia</em> is a traditional puzzle-solving adventure. The player navigates a 3D model of the protagonist over pre-rendered backgrounds with fixed camera angles. Puzzles are mostly inventory-based, though some involve manipulating the environment (such as mechanical devices). The interface features a single cursor; only highlighted objects can be interacted with, and there are no verb choice commands.</p>"},{"name":"Syberia II","year":2004,"developer":"Microïds Canada Inc.","url":"microsoft_xbox_s_part2/Syberia%20II%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6528568444,"score":7.8,"genres":"Adventure > 3rd-person (Other) > Cinematic camera > Graphic adventure > Puzzle elements > Point and select > Steampunk","desc":"<p>You find Kate Walker continuing her journey exactly where the first game, Syberia, ended. Rather than return to her life as a New York attorney, Kate chooses to journey with Hans Voralberg to the frozen northlands of Syberia aboard his futuristic train.</p><p>Kate, Hans and Oscar, the humorous automaton, will travel through four locations on their way to the mythical Syberia, where Hans believes the ancient mammoth race still exists. As the three make their way through the harsh, but beautiful, wintery landscapes, many obstacles will get in their way. The player has to talk to people Kate meets and solve situation-, inventory-based and mechanical puzzles. The single-cursor interface and the visual style (3D character models and pre-rendered backgrounds) are very similar to the original game.</p>"}]