[{"name":"Taito Legends","year":2005,"developer":"Taito Corporation","url":"microsoft_xbox_t_part1/Taito%20Legends%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6806472917,"score":7.5,"genres":"Compilation","desc":"<p><em>Taito Legends</em> consists of 29 of Taito's arcade games from the 80s and early 90s, including:</p><ul><li>Battle Shark</li><li>Bubble Bobble</li><li>Colony 7</li><li>Continental Circus</li><li>Electric Yo-Yo, The</li><li>Elevator Action</li><li>Exzisus</li><li>Gladiator</li><li>Great Swordsman</li><li>Jungle Hunt</li><li>New Zealand Story, The</li><li>Ninja Kids, The</li><li>Operation Wolf</li><li>Operation Thunderbolt</li><li>Phoenix</li><li>Plotting</li><li>Plump Pop</li><li>Rainbow Islands: The Story of Bubble Bobble 2</li><li>Rastan</li><li>Return of the Invaders</li><li>Space Gun</li><li>Space Invaders</li><li>Space Invaders Part II</li><li>Super Qix</li><li>Thunder Fox</li><li>Tokio</li><li>Tube-It</li><li>Volfied</li><li>Zoo Keeper</li></ul><p><em>Operation Wolf</em>, <em>Operation Thunderbolt</em> and <em>Space Gun</em> all lack light gun support, but a gun cursor is placed on screen, in which the user can move around and manipulate.</p><p>Extras include video interviews with <em>Space Invaders</em> creator, Tomohiro Nishikado and <em>Bubble Bobble</em> creator, Fukio Mitsuji. 3D Models of Arcade Cabinets and Original Arcade Flyer Artwork is also included.</p>"},{"name":"Taito Legends 2","year":2006,"developer":"Taito Corporation","url":"microsoft_xbox_t_part1/Taito%20Legends%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6720755117,"score":7.4,"genres":"Compilation","desc":"<p>Another serving of Taito's arcade games squeezed onto a single disc. It features 39 games including:</p><ul><li>Alpine Ski</li><li>Arabian Magic</li><li>Balloon Bomber (PS2 exclusive)</li><li>Bonze Adventure</li><li>Bubble Symphony (Xbox and PC exclusive)</li><li>Cadash (Xbox and PC exclusive)</li><li>Cameltry</li><li>Chack 'n Pop</li><li>Cleopatra Fortune</li><li>Crazy Balloon</li><li>Darius Gaiden</li><li>Don Doko Don</li><li>Dungeon Magic (or Light Bringer)</li><li>Elevator Action Returns</li><li>Football Champ</li><li>Front Line</li><li>G Darius (PS2 exclusive)</li><li>Gekirindan</li><li>Grid Seeker</li><li>Growl</li><li>Gun Frontier</li><li>Insector X</li><li>Kiki Kaikai</li><li>Kuri Kinton</li><li>Liquid Kids</li><li>Lunar Rescue</li><li>Metal Black</li><li>Nastar</li><li>Pop 'n Pop (Xbox and PC exclusive)</li><li>Puchi Carat</li><li>Puzzle Bobble 2</li><li>Qix</li><li>Ramais</li><li>RayForce (Xbox and PC exclusive - also known as Galactic Attack)</li><li>Ray Storm (PS2 exclusive)</li><li>Space Invaders '95</li><li>Space Invaders DX</li><li>Super Space Invaders '91</li><li>Syvalion (PS2 exclusive)</li><li>The Fairyland Story</li><li>The Legend of Kage</li><li>Violence Fight</li><li>Wild Western</li></ul>"},{"name":"Tak 2: The Staff of Dreams","year":2004,"developer":"Avalanche Software LLC","url":"x-rN22020/Nickelodeon%20Tak%202%20-%20The%20Staff%20of%20Dreams%20%28Europe%29%20%28En%2CDe%29.zip","filesize":6577065852,"score":7.3,"genres":"Action > 3rd-person (Other) > Puzzle elements","desc":"<p>Tak, hero from the previous game has been randomly falling into deep sleeps. During this time, he travels to a \"Dream World\", where he is told that he must rescue a princess, or else he will fall into a sleep from which he will never awaken from. Tak and Jibolba, Tak's mentor, travel to visit Jibolba's brother, JB, who is an expert in dreams.</p><p>Tak 2 is fairly different from Tak and the Power of Juju. While it is still a 3D platform game, it is more focused on puzzles and combat as opposed to collecting items. In earlier stages, Tak must use animals to his advantage as he makes his way through levels - for example, a bear can be used as a trampoline, Tak can ride warthogs after being sprayed by skunks to mask his scent, and more. Jibolba is along for the ride, but has transformed into a flea for easy transport. As a result, you can throw him at enemies to bite them and make them sleepy.</p><p>Later on, Tak gains the power to transform into various animals himself. As a frog he can swim without being eaten by crocodiles, he can soar on air currents as a flying squirrel, and can break through barriers by charging through as a warthog. When Tak gains the titular Staff of Dreams as he progresses through the game, he can also create more powerful attacks using his magic, or \"juju\".</p>"},{"name":"Tak: The Great Juju Challenge","year":2005,"developer":"Avalanche Software LLC","url":"x-rN22020/Nickelodeon%20Tak%20-%20The%20Great%20Juju%20Challenge%20%28Europe%29.zip","filesize":6781724609,"score":7.2,"genres":"Action > 3rd-person (Other) > Fantasy","desc":"<p><em>The Great Juju Challenge</em> is the third game in the platforming series. It stars Tak (the hero from the first two games) and his brother Lok. The story is about how the people in Tak's village have set up a course of events for people to compete in. The game is a mixture of platforming and adventure. Tak and Lok have entered the event in hopes of winning. Introduced to this game is the ability to swap between characters with the touch of a butto or in 2 player mode you can play together in split screen. The characters have to reach various checkpoints to extend the level. All the levels take place in the various jungle settings of Tak's Village. The events consist of swimming, racing, climbing ropes, and other endurance challenges.</p><p>Tak is the magic user while Lok is the brawn. During the game, the two characters provide comical banter with each other. Tak can use a chicken suit to fly and a lobster suit to swim underwater. The cutscenes are in real time. Taloc, the bad guy from the previous games, is nowhere to be found as the game now focuses on the Juju challenge and not on trying to defeat the bad guy. Patrick Warburton voices Lok.</p>"},{"name":"Tao Feng: Fist of the Lotus","year":2003,"developer":"Studio Gigante","url":"microsoft_xbox_t_part1/Tao%20Feng%20-%20Fist%20of%20the%20Lotus%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6685996787,"score":6.2,"genres":"Action > Side view > 2D scrolling > Fighting > Martial arts","desc":"<p>From the co-creator of Mortal Kombat, Tao Feng is a fighting game with a few twists. The storyline is made out of the normal forces of good vs. evil which takes place in China. Unlike other fighting games, Tao Feng features torn clothes, bruises and the most original feature which is limb damage.Limb damage happens when you block too much, or when you collide with one of the hazards in the environment. Those with limb damage will have their attacks decreased by 50%. The same thing goes for the legs except they can't run. </p><p>Fighters can also use the enviroment to their advantages, example fighters can flip off the walls, swing on poles or throw opponents through glass. Each fighter also has powerful CHI attacks which can be devastating on enemies and the surroundings.</p>"},{"name":"Taz: Wanted","year":2002,"developer":"Blitz Games Ltd","url":"microsoft_xbox_t_part1/Taz%20-%20Wanted%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6581391911,"score":6.6,"genres":"Action > Behind view > Licensed","desc":"<p>The devious Yosemite Sam has captured Taz and locked him up as a circus animal and is planning to turn Taz's beloved homeland into a amusement park.</p><p>But then Taz successfully escapes from the clutches of Sam and once again is going on the rampage to stop Sam's plans for his homeland.</p><p>Blast your way through 15 different levels, each of which can be destroyed using spin, bounce and burp attacks.You can get foods such as mage hot chili and soda to aid your mission of vengeance against Sam.</p>"},{"name":"Tecmo Classic Arcade","year":2005,"developer":"Tecmo, Ltd.","url":"microsoft_xbox_t_part1/Tecmo%20Classic%20Arcade%20%28Europe%29%20%28En%2CJa%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6727630589,"score":5.5,"genres":"Compilation","desc":"<p>A compilation of Tecmo's Arcade games brought home. The games included are:</p><ul><li>Tecmo Bowl</li><li>Rygar</li><li>Star Force</li><li>Solomon's Key</li><li>Bomb Jack</li><li>Tecmo Cup</li><li>Pinball Action</li><li>Pleiads</li><li>Senjyo</li><li>Swimmer</li><li>Strato Fighter</li></ul>"},{"name":"Teen Titans","year":2006,"developer":"Artificial Mind & Movement","url":"microsoft_xbox_t_part1/Teen%20Titans%20%28USA%29.zip","filesize":6501042052,"score":6.5,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Sci-fi / futuristic > Licensed","desc":"<p><em>Teen Titans</em> is based on the cartoon of the same name. Players control the five team members: Robin, Cyborg, Raven, Starfire and Beast Boy and can switch between them at any time. Each character has a unique set of powers and moves. In addition to the standard combos, in co-op modem characters can perform team moves together for added damage. There are power-ups to be found through the game which speed the world slow it down, increase your attack, etc. The game is set up as a series of levels and after completing a level, each heroes' abilities are upgraded.</p><p>The Titans receive a video game in the mail, but find themselves trapped inside when they try to play it. They must battle their way through many enemies, including bosses drawn from the show, to escape.</p><p>There is also a multiplayer mode which works something like a four-player fighting game. This can be played against bots or with other humans. In addition to the Titans themselves, you can play as the bosses from single-player or more than a dozen other characters from the show that are unlocked by finding hidden items in story mode.</p>"},{"name":"Teenage Mutant Ninja Turtles","year":2003,"developer":"Konami Computer Entertainment Studios, Inc.","url":"microsoft_xbox_t_part1/Teenage%20Mutant%20Ninja%20Turtles%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6399180799,"score":6.2,"genres":"Action > Diagonal-down > Beat 'em up / brawler > Licensed","desc":"<p>Based on the newer anime styled FOX cartoon of the same name, Teenage Mutant Ninja Turtles features Leonardo, Raphael, Michelangelo and Donatello as green ninjas. Living in the sewers, they creep out when nobody is looking to fight for truth, justice and another slice of pizza. Fighting against the public face of inventor Baxter Stockman and the more shadowy figure of Shredder and his Foot Clan, these Ninja Turtles will get the chance to make their opponents eat shell!</p><p>The game is a 3D beat-em-up with multiple players. The game sprites all resemble the cartoony look of the TV show and each turtle features unique moves, sound bytes and fighting style all his own. Ninja Turtle moves include a weaker/quicker attack, a stronger/slower attack, Ninja Shuriken and a Jump-Kick.</p>"},{"name":"Teenage Mutant Ninja Turtles 2: Battle Nexus","year":2004,"developer":"Konami Computer Entertainment Studios, Inc.","url":"microsoft_xbox_t_part1/Teenage%20Mutant%20Ninja%20Turtles%202%20-%20Battle%20Nexus%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6402839776,"score":5.8,"genres":"Action > Diagonal-down > Beat 'em up / brawler > Licensed","desc":"<p>The sequel to 2003's updated beat 'em up, Teenage Mutant Ninja Turtles 2: Battle Nexus sets the turtle quartet on another adventure from the series' second season, this time allowing the entire team to work together via a 4-player multiplayer mode.</p><p>Each turtle now has their own unique ability and special fighting moves that fit in with their personality: such as operating switches and computers, or moving or destroying stationary objects.  In single-player mode, players can switch turtles on the fly in order to accomplish the various tasks.  Throughout some levels, the turtles also have racing sections over various terrains.</p><p>As players progress through the game, they can find secret items, abilities, and power-ups, including the original late 1980's Teenage Mutant Ninja Turtles arcade game.</p>"},{"name":"Teenage Mutant Ninja Turtles 3: Mutant Nightmare","year":2005,"developer":"Konami Computer Entertainment Studios, Inc.","url":"microsoft_xbox_t_part1/Teenage%20Mutant%20Ninja%20Turtles%203%20-%20Mutant%20Nightmare%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6575831920,"score":6.4,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Licensed","desc":"<p>The TMNT are back once again to fight shredder. It has the same look and control scheme as the previous 2 games. Also, like the previous game it is a beat-em up action game. You can play the game with up to 3 friends. The game has a few different missions as turtles fight Triceratons in order to find the missing Fugitoid and prevent their siege on Earth. All 4 turtles can be on screen at the same time. With the other turtles you can make teamed up group attacks to attack a target and perform special moves. In addition there is an ultimate turtle mode, where your turtle will become temporarily invincible and be able to blow through lots of enemies easily. By gathering special items like crystals, you can upgrade your turtles, giving them new techniques and special moves.</p>"},{"name":"Tenchu: Return from Darkness","year":2004,"developer":"K2 LLC","url":"microsoft_xbox_t_part1/Tenchu%20-%20Return%20from%20Darkness%20%28Europe%2C%20Australia%29%20%28En%2CFr%29.zip","filesize":5903976099,"score":6.9,"genres":"Action > 3rd-person (Other) > Stealth > Fantasy > Japan (Ancient/Classical/Medieval) > Detective / mystery","desc":"<p>In a 16th century Japan suffering from rebellions and civil disorder, a powerful sorcerer seeks to gain ultimate power from an evil god and become unquestioned ruler.</p><p>Player characters Ayame and Rikimaru complete several missions for their master Lord Gohda in an attempt to bring peace to Japan, and eventually defeat the evil Lord Tenrai. A third player character, Tesshu, is a doctor by day and freelance assassin for justice by night. After completing Ayame and Rikimaru's quest, the player can guide Tesshu through a handful of missions and see Japan from his perspective.</p><p>The name of the game is stealth and the player is rewarded for playing the game without being seen and executing \"stealth kills\" by being given access to bonus weapons and items. Conversely, to attack head-on is cumbersome and unrewarding.</p><p>Tenchu: Return From Darkness also features 6 2-player co-op missions (where players can select from the three main player characters) and a versus mode that includes 20 characters, including enemies and bosses. The 2 player mode is available as split-screen or via network play.</p><p>The game is an enhanced port of Tenchu: Wrath of Heaven which adds a number of new features:</p><ul><li>Two new single player missions for each character</li><li>Online play</li><li>Body dragging</li><li>Continue function (in easy mode)</li><li>Pause Menu</li><li>16:9 widescreen display (in PSP version)</li></ul>"},{"name":"Tenerezza","year":2003,"developer":"Aquaplus","url":"microsoft_xbox_t_part1/Tenerezza%20%28Japan%29.zip","filesize":6748972325,"score":"","genres":"Action > Role-playing (RPG) > 3rd-person (Other) > Anime / Manga > Fantasy","desc":"<p>Tenerezza is a young cute girl who lives in the town Esperanza. She is an expert cook and a highly skilled magician. Cooking various kinds of food, she produces healing items, and she is proficient in using magic of the four elements. One day the town's mayor asks her to go to the nearby Magic Forest and investigate the recent appearance of monsters in the area. On her way Tenerezza meets the fairy Lolo, and together they oppose a dark force that threatens to conquer the world.</p><p><em>Tenerezza</em> is an action role-playing game. The player can charge up magic spells by pressing down a key or a controller button, and then unleash them on the enemies. It is also possible to attack physically and equip a variety of weapons and armor. When a sufficient amount of experience points is gathered and Tenerezza levels up, the player can manually raise her attack or defense power, or her proficiency in one of the elemental magic kinds.</p>"},{"name":"Tennis Masters Series 2003","year":2002,"developer":"Microïds Canada Inc.","url":"microsoft_xbox_t_part1/Tennis%20Masters%20Series%202003%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":6785296651,"score":7.4,"genres":"Simulation > Sports > Tennis","desc":"<p><em>Tennis Masters Series 2003</em> is a fully licensed tennis game which expands upon previous releases in the series and adds some improvements.</p><p>The game features 9 official stadiums of the Tennis Masters Series tournaments, 4 different shots to choose from (i.e. the slice and the lob), 67 different players with detailed skills and 3 difficulty levels (Amateur, Pro and Master).</p><p>The graphics have been updated with better face expressions and players moves. This game also adds a player editor allowing the user to customize his character.</p>"},{"name":"Terminator 3: Rise of the Machines","year":2003,"developer":"Black Ops Entertainment, LLC","url":"microsoft_xbox_t_part1/Terminator%203%20-%20Rise%20of%20the%20Machines%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6427985452,"score":4.1,"genres":"Action > 1st-person > Shooter > Post-apocalyptic > Licensed","desc":"<p><em>Terminator 3: Rise of the Machines</em> is based on the movie of the same name, but with an extended story line. In 2032, the player is the T-850 model 101 Terminator, operating under Skynet control. He is captured and reprogrammed by Kate Brewster to help the human resistance, in addition to being ordered to cross the destroyed battlefields of Los Angeles and Hollywood and take over the Skynet base. Once the base is under their control, Brewster sends the Terminator back in time to protect her younger self and John Connor from the T-X, the technologically advanced female Terminator and Skynet's most lethal killing machine. The Terminator teams up with John and Kate in the present day on their mission to stop Skynet from starting World War III.</p><p>The game is a first-person shooter combined with hand to hand combat. The first-person mode features the Terminator Point of View (POV), showing the infrared heads-up information display seen in the movies.</p>"},{"name":"Terminator 3: The Redemption","year":2004,"developer":"Paradigm Entertainment Inc.","url":"microsoft_xbox_t_part1/Terminator%203%20-%20The%20Redemption%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6443530893,"score":7,"genres":"Action > Racing / Driving > Behind view > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p><em>Terminator 3: The Redemption</em> is a combination of 3rd person shooter, rail, and driving game featuring Arnold Schwarzenegger as the infamous T-850 Infiltrator. The game features 20+ alternate vehicles with never before seen SkyNet units and a Tech-Com Force Co-op mode. Your goal is to ensure the survival of both John Connor and Kate Brewster in present and future universes.</p>"},{"name":"Terminator, The: Dawn of Fate","year":2002,"developer":"Paradigm Entertainment Inc.","url":"microsoft_xbox_t_part1/Terminator%2C%20The%20-%20Dawn%20of%20Fate%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6493494445,"score":6,"genres":"Action > 1st-person > 3rd-person (Other) > Cinematic camera > Shooter > Post-apocalyptic > Sci-fi / futuristic > Licensed","desc":"<p>The Tech Com forces trying to defend earth from the destructive Skynet machines for many years. Terminator T-800 has a new deadly plan - travel back to 1984 to kill Sarah Connor, and thus prevent her son, the resistance leader John Connor, being born. If you can get to a time travel device, you can stop this. The stakes could not be higher - without John, your force would be nothing.</p><p>The game is a third-person action game, with 11 levels across a range of terrains. You can play as Kyle Reese, Catherine Luna and another secret character - each of whom has their own moves, and can use 20 different weapons ranging from rocket launchers to explosives. The camera view can be used to target an enemy.</p>"},{"name":"Test Drive","year":2002,"developer":"The Pitbull Syndicate Limited","url":"microsoft_xbox_t_part1/Test%20Drive%20%28USA%29.zip","filesize":6584186147,"score":6.8,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator","desc":"<p>This is the 2002 update to the long-running Test Drive series. The Test Drive games put you in the driver's seat of a fast real-life sports car, and let you drive around at reckless speeds through busy city streets and scenic mountainside highways.</p><p>This edition of Test Drive has some improvements over it's predecessor, Test Drive 6. This time around there is a story driven mode, called \"The Underground.\" You take the role of Dennis Black, an independent street racer who improves his standing in the underground street racing world with the help of a mysterious benefactor.</p><p>There are 4 tracks: San Francisco, Tokyo, London, and Monaco. These tracks are considerably larger and more open than the previous games.  There are now multiple races and routes through each track.</p>"},{"name":"Test Drive: Eve of Destruction","year":2004,"developer":"Monster Games, Inc.","url":"microsoft_xbox_t_part1/Test%20Drive%20-%20Eve%20of%20Destruction%20%28USA%29.zip","filesize":6719088335,"score":7,"genres":"Racing / Driving > 1st-person > Behind view > Fighting > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>Modeled on real thrill-show events across America, TD:EOD is a wild racing game with an authentic grassroots flavor.  From destruction derbies to suicide races, you can race authentic rust-buckets in a variety of rural tracks.  Smashing other racers is rewarded, and the computer opponents will try to smash you as well!  Try to complete a full career, starting out with your mom's junk car, racing local goof-balls in crazy races.  A wiseacre announcer provides local flavor, as you and your pals take a school bus over a tremendous jump, and the crowd goes wild!</p>"},{"name":"Test Drive: Off-Road - Wide Open","year":2001,"developer":"Angel Studios, Inc.","url":"microsoft_xbox_t_part1/Test%20Drive%20Off-Road%20-%20Wide%20Open%20%28USA%29.zip","filesize":6855539565,"score":6.7,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>This is the successor to Test Drive: Off-Road 3. In this game, the player controls one of 13 American Four By Fours through Hawaii, Moab, or Yosemite to be crowned King of The Off-Road. The player can race in a single, arcade race, take a complete free ride, or race in career mode. There are three kinds of racing to master: Circuit, Blitz, and Scramble.</p><p>Circuit Races are exactly as they sound. The player howls around a course through checkpoints before time runs out at least twice.</p><p>Blitz Races are considerably shorter than Circuit Races. The strategy for racing itself is not much different, except the race is in a linear fashion of point A-to-B.</p><p>In Scramble Races the player roars around an area \"collecting\" checkpoints in a random location as fast as possible. These are the shortest races in the game.</p><p>This game can be played by two players.</p>"},{"name":"Tetris Worlds","year":2002,"developer":"Blue Planet Software, Inc.","url":"microsoft_xbox_t_part1/Tetris%20Worlds%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6790407025,"score":6.2,"genres":"Action > Puzzle > Side view > Fixed / flip-screen > Falling block puzzle > Direct control","desc":"<p>It's Tetris as we all remember it. Drop different shaped blocks into the container, and fit them together to form a horizontal line, and the line disappears. Your job is to keep going as long as possible by clearing the container of blocks.</p><p>This will be the first time on a Game Boy System that 4 players can play multiplayer <em>Tetris</em>, which is much the same as the original <em>Tetris</em>, only that when you clear a line of blocks, the line(s) appear in another players screen.</p>"},{"name":"Thief: Deadly Shadows","year":2004,"developer":"Ion Storm Austin","url":"microsoft_xbox_t_part1/Thief%20-%20Deadly%20Shadows%20%28Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6429560953,"score":8,"genres":"Action > 1st-person > Behind view > Stealth > Direct control > Fantasy > Steampunk","desc":"<p>Master Thief Garrett is contacted by the Keeper Artemus, who wants him to steal two valuable artifacts. Meanwhile, Garrett learns that the coming of a Dark Age had been prophesied long ago. Gaining access to the Keeper Prophecies, Garrett learns that an ancient book known as the Compendium of Reproach contains more information about the prophecy. As Garrett is trying to solve the mystery, it becomes more and more clear to him that there is a traitor in the order of the Keepers.</p><p><em>Thief: Deadly Shadows</em> is the third installment in the <em>Thief</em> series. The game follows the same design philosophy and gameplay structure that distinguished its predecessors. As before, stealth is the key to successful completion of missions. Avoiding confrontation with the guards, Garrett has to make his way through the levels towards the objective. Shadows and sounds play a large role, as guards will react to suspicious noises, and studying their patrolling routines is essential.</p><p>A few gameplay elements have been slightly altered. Garrett can no longer swim, but is able to use climbing gloves that attach him to the walls. He can also flatten himself against walls while standing; if in shadow, he remains completely unnoticeable that way. The player can see Garrett's limbs even if he is viewed from first-person perspective, allowing more precise movements. Switching to third-person view is also possible.</p><p>The most significant gameplay change is the non-linear exploration of the City, which has been added to the largely linear missions. In order to access the next mission, Garrett has to explore the City. On his way, he can overhear conversations, steal valuables, avoid or knock out the guards, and even accept secondary missions, which will influence his reputation with some of its factions.</p>"},{"name":"Thing, The","year":2002,"developer":"Computer Artworks Ltd.","url":"microsoft_xbox_t_part1/Thing%2C%20The%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6645430874,"score":7.5,"genres":"Action > Behind view > Shooter > Horror > Licensed > Regional differences","desc":"<p>Set after the events of the 1982 John Carpenter movie, <em>The Thing</em> is a squad based 3rd person shooter, where each member of your team is equipped with a range of weapons and items to help you in your quest to destroy The Thing. </p><p>You must use every player in the squad if you wish to proceed through each level, and once you find one of the thousands of alien creatures through-out the complex, weapons such as flame throwers, pistols and more come into play.</p><p>20 levels are on offer, with humans scattered around the area. But are they friend or an infected foe? Trust is the key to success.</p>"},{"name":"ThinkTanks","year":2005,"developer":"Bravetree Productions"},{"name":"Thousand Land","year":2003,"developer":"FromSoftware, Inc.","url":"microsoft_xbox_t_part1/Thousand%20Land%20%28Japan%29.zip","filesize":6721231316,"score":"","genres":"Strategy > Diagonal-down > Free-roaming camera > Real-time > Point and select","desc":"<p><em>Thousand Land</em> is a real-time strategy game. Taking place on abstract worlds called \"geo-slates\", two opponents face off using small acorn-shaped units called APOs that spawn from a tree-like object called core. The units are controlled indirectly, and the goal in each battle is to destroy the enemy's core.</p><p>Each match consists of two phases, a building phase and a battle phase. In the building phase, the player can remodel their geo-slate by raising and lowering the land (similar to Populous) as well as task the APOs with building objects like barriers, defensive weapons, traps and more. Construction energy and time are limited.</p><p>In the battle phase, the APOs can be set to act either offensively or defensively, be picked up and dropped somewhere else or be lured to a certain point with a light, but otherwise act entirely on their own. Besides the APOs, there are also giant creatures called TELAs which can be summoned and act as powerful offensive units.</p><p>The player's geo-slate is carried over from battle to battle. Winning gives the player currency which can be used to purchase new parts to place on the geo-slate in the building phase as well as new and more powerful TELAs to summon in battle. It is also possible to bet on the outcome of a match for additional money. The game includes one thousand opponents to battle against, organized in tiers named after chess pieces (from pawn to king) with the ultimate goal of reaching the king tier and defeating the highest-ranked opponent. The game also allowed online battles via Xbox Live.</p>"},{"name":"Thrillville","year":2006,"developer":"Frontier Developments Ltd.","url":"microsoft_xbox_t_part1/Thrillville%20%28USA%29.zip","filesize":6413238912,"score":6.4,"genres":"Simulation > Strategy > 1st-person > 3rd-person (Other) > Real-time > Board game > Managerial / business simulation","desc":"<p><em>Thrillville</em> is an amusement park simulator where you take on the role of the favoured nephew or niece of the eccentric uncle Mortimer, the world-renowned owner of the Thrillville theme park franchise. When uncle Mortimer is indisposed, he lets you take over running of five fabulous parks. The only problem is that Uncle Mortimer's arch nemesis Vernon Garrison is trying to knock Thrillville off the map with his Globo-Joy chain of multi-conglomerate parks and will stop at nothing to crush Thrillville like a bug and become number one. The only way to stop him is to keep the parks running smoothly, this involves keeping the guests happy and finding out their needs and wants.</p><p>Created by the team behind RollerCoaster Tycoon 3, the game moves away from pure management for the console systems. You can construct your own rides and test them yourself. Daily chores require you to construct new attractions and stalls, and customers need to be kept happy with reasonable prices.</p><p>Instead of crunching numbers, some daily chores have been turned into mini-games based on classic games. Using shoot-em-ups, racing games and rhythm games, mundane tasks become exciting events. You can even participate in the games available for your visitors. Instead of being a god, acting with an invisible hand from the sky, you control a park manager to distribute the work and interact with customers. You can even try to befriend customers through conversations to keep them happy.</p>"},{"name":"Tiger Woods PGA Tour 06","year":2005,"developer":"Headgate Studios Inc.","url":"microsoft_xbox_t_part1/Tiger%20Woods%20PGA%20Tour%2006%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6596023915,"score":8,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p>The latest entry in the highly successful Tiger Woods golf franchise from Electronic Arts, <em>Tiger Woods PGA Tour 06</em> features 15 golf courses (11 real courses, 3 fantasy courses), 15 real golfers (including Tiger Woods and Vijay Singh), and 12 fantasy golfers. Courses can be \"Tiger-proofed\" to make them more challenging.</p><p>Players can work their way through a PGA career, they can chase Tiger Woods through all the major historical eras of golf, or they can engage in the usual array of game modes seen in previous entries in this series.</p>"},{"name":"Tiger Woods PGA Tour 07","year":2006,"developer":"Headgate Studios Inc.","url":"microsoft_xbox_t_part1/Tiger%20Woods%20PGA%20Tour%2007%20%28Europe%29.zip","filesize":6533274966,"score":7.6,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p>In contrast to the PS3/Xbox 360 versions, these versions are a direct continuation with the framework of Tiger Woods PGA Tour 06. The biggest addition is the Team Tour game mode which the player's four created golfers travel through the world, conquer different challenges in order to compete against Team Tiger in the end.</p><p>The Wii version is mostly identical, but uses motion controls for input and adds six arcade modes. As tradeoff, there are a few less traditional game modes (6 instead of 10) and less courses (18 instead of 21) available. The Windows version features only 12 courses.</p>"},{"name":"Tiger Woods PGA Tour 2003","year":2002,"developer":"Headgate Studios Inc.","url":"microsoft_xbox_t_part1/Tiger%20Woods%20PGA%20Tour%202003%20%28Europe%29.zip","filesize":6384131098,"score":7.7,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p><strong>Tiger Woods PGA Tour 2003</strong> is the fourth edition in the best-selling golf series.</p><p>TG contains over ten PGA tour pros, twelve original golfers, nine PGA Tour golf courses and three fantasy courses, which are completely original.</p><p>There are ten different game modes to play, from a stroke game to the actual PGA Tour. You can also go against three other friends in multiplayer.</p><p>In the SkillZone area, there are six different mini-games you can attempt, which is purely for fun. Do them yourself or go up against a friend.</p><p>The game features a worldwide leaderboard, which tracks stats from you and everybody else who plays the game. Using XBox Live, you can upload your stats and compare them with other players. This feature will last until January 1, 2004.</p>"},{"name":"Tiger Woods PGA Tour 2004","year":2003,"developer":"Headgate Studios Inc.","url":"microsoft_xbox_t_part1/Tiger%20Woods%20PGA%20Tour%202004%20%28Europe%29.zip","filesize":6129328184,"score":8,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p>Tiger Woods is back for another round of golf in this edition of the series. The biggest addition to this version is EA's Game Face, which lets you customize the players' physical appearance. You have the basics, such as hair, skin, facial hair and other general appearances, but Game Face allows you to customize every other aspect, from teeth shape, logos, tattoos, headbands, hats, and more. You may also change individual body mass, muscle tone, mid-section, arms and legs. You also have the option of choosing specific swing style animations, post-putt and celebration animations, and \"pissed off\" animations for when you score a triple bogey.</p><p>One of the new modes is World Tour, which puts you through a standard 52-week PGA tour to earn money, sponorships, and better gear. You can play for up to twenty seasons. The other new game mode is Battle Golf, where you can win an opponent's clubs if you beat them. All the other standard game modes are here, from Skill Challenge and Speed Golf to a Skins Match or Practice.</p><p>A new feature is the game's ability to read your console's internal clock, and provide you with game modes. If it's near the end of October and your clock is properly set, you may be invited to a Halloween event where you can win items specific to that event.</p><p>All top PGA players are included for you to play as (or against), including Vijay Singh and Justin Leonard. Newcomers to the sport have also been added, such as John Daly.</p><p>Most of the courses from 2003 have made it, with seven new courses, both real and fantasy. One of the new courses is Bethpage Black, an extremely difficult course located in Washington.</p><p>Like all other 2004 EA Sports console games, <em>Tiger Woods PGA Tour 2004</em> has the EA Sports Bio, which tracks your accomplishments and games over all EA Sports titles. The more EA Sports games you play, and the longer you play them, will increase your EA Gamer Level and unlock additional rewards, such as a new driver in Tiger Woods or historic teams in NHL 2004. This feature isn't on the PC version.</p><p>Gamers who buy the PlayStation 2 version will be able to play online through EA's matchmaking service. You cannot play online with the Xbox or GameCube versions.</p><p>If you buy the GameCube version, you can use the GameBoy Advance to hook up to the GameCube to unlock special rewards not available through normal play.</p>"},{"name":"Tiger Woods PGA Tour 2005","year":2004,"developer":"Headgate Studios Inc.","url":"microsoft_xbox_t_part1/Tiger%20Woods%20PGA%20Tour%202005%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6268326320,"score":8.3,"genres":"Sports > Behind view > Golf > Licensed","desc":"<p>In this iteration of the Tiger Woods lineage, you can customize your golfer down to the kind of swing to use, strength, putting skill, luck etc, as well as buying accessories and equipment which all affects your game. Create your own courses by spending \"Legend Coins\" and gain standing amongst the golfing community and impress even Tiger himself.</p><p>Putting using the new \"Tiger Vision\" lets you see how Tiger Woods would play the shot but don't rely on it as even Tiger gets it wrong sometimes. Play against the Hustler, a golfer created by and motion captured by Justin Timberlake.</p>"},{"name":"Tim Burton's The Nightmare Before Christmas: Oogie's Revenge","year":2005,"developer":"Tose Co., Ltd.","url":"microsoft_xbox_t_part1/Tim%20Burton%27s%20The%20Nightmare%20Before%20Christmas%20-%20Oogie%27s%20Revenge%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6311169889,"score":6.5,"genres":"Action > 3rd-person (Other) > Hack and slash > Music / rhythm > Licensed","desc":"<p>Based on Tim Burton and Deane Taylor's film <em>The Nightmare Before Christmas</em>, you control Jack Skellington the Pumpkin King in this sequel to the original film. As Jack you must fight to claim back Halloweentown after the towns folk put back together Oogie Boogie while Jack was away. Now Oogie is controlling the town and it's up to Jack to claim back his crown and save the town.</p><p>Using different costumes grants Jack different abilities and attacks including fighting as Jack Skellington, breathing fire as the Pumpkin King or throwing explosive presents as Santa Jack.Using the power of dancing gives Jack the upper hand when fighting Oogie and his henchmen in a timed button pressing sequence, which lets Jack strut his stuff or get beaten badly with poorly timed button presses.</p>"},{"name":"TimeSplitters 2","year":2002,"developer":"Free Radical Design Ltd.","url":"microsoft_xbox_t_part1/TimeSplitters%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Rev%201%29.zip","filesize":6369532527,"score":8.2,"genres":"Action > 1st-person > Arcade > Shooter > Direct control > Cyberpunk / dark sci-fi > Sci-fi / futuristic","desc":"<p>TimeSplitters 2, the sequel to Free Radical Design's PlayStation 2 launch title, once again sends players hurtling through time, as they battle the malevolent TimeSplitters in ten unique time periods, from the Wild West to a futuristic space station, and everything in between.</p><p>The game's story finds Cortez, the series' hero, on a quest to discover the origins of the TimeSplitters, an enigmatic group that travels through time causing trouble for the good people of Earth. Using the paradoxes of time travel to his advantage, the hero can regularly join up with past and future versions of himself, to fight the enemy as a team. A wide selection of historical, modern, and futuristic weapons is available, and environments feature destructible elements.</p><p>Depending on the difficulty level chosen, players will find themselves with rudimentary objectives to complete or, on the harder settings, new areas and substantially more involved objectives to fulfill. Two players can also play the Story mode cooperatively and simultaneously.</p><p>Like its predecessor, TimeSplitters 2 features a Challenge mode, which presents the player with a selection of time- and skill-based events. Completing these within the predetermined constraints awards the player with bronze, silver, or gold medals, which in turn aid in unlocking additional game options, levels, and playable characters (of which there are more than 120).</p><p>The Arcade mode offers League, Custom, and Network sub-modes. League events feature pre-configured maps, game types, and objectives for the player to compete in, while the other Arcade modes make up the bulk of the multiplayer portion of the title. In the Custom mode, up to four players and numerous AI \"bots\" can compete in 16 different customizable disciplines including Deathmatch, Regeneration, Virus, Thief, Shrink, Monkey Assistant, and Flame Tag -- each offering an altered form of gameplay. Thief, for example, tasks players with collecting tokens left behind by fallen combatants. Here, the tokens determine the winner, not the number of kills.</p>"},{"name":"TimeSplitters: Future Perfect","year":2005,"developer":"Free Radical Design Ltd.","url":"microsoft_xbox_t_part1/TimeSplitters%20-%20Future%20Perfect%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5707186439,"score":8.1,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic","desc":"<p>In the year 2401 the space marine Sergeant Cortez is leaving the space station that he visited in the end of his previous journey. He soon discovers that the crystals he has found can power up a time machine. After having located traces of TimeSplitter activities in various time periods on the Earth, Cortez boards the time machine and travels to these periods, hoping to aid various characters in their battles against evil.</p><p><em>TimeSplitters: Future Perfect</em> is a first-person shooter in which players battle their way through thirteen story missions spread across six time periods, either alone or cooperatively. The protagonist's arsenal varies depending on the time period he travels to: for example, traveling to 1924 will allow Cortez to wield World War I weapons; a Soviet setting in the 1960's contains various local firearms of that time period; stages that take place in the future feature corresponding futuristic weaponry, etc. In addition to fast-paced shooting gameplay there are also some stealth and vehicle-driving segments.</p><p>Like in the previous installments of the series, various multiplayer modes are included. Players can take on computer-controlled opponents on any of the fifteen arcade maps, or make their own ones. Players can also compete for awards in dozens of arcade league matches and challenges. It is possible to choose from between 150 characters and challenge other players to a head-to-head battle, either with up to four-player split screen or online and LAN play.</p>"},{"name":"TMNT: Mutant Melee","year":2005,"developer":"Konami Computer Entertainment Hawaii, Inc.","url":"microsoft_xbox_t_part1/TMNT%20-%20Mutant%20Melee%20%28USA%29.zip","filesize":6695524642,"score":5.9,"genres":"Action > 3rd-person (Other) > Fighting > Licensed","desc":"<p><em>Teenage Mutant Ninja Turtles: Mutant Melee</em> is a 3D fighting game based on the 2003 animated series. The combat system is similar to the earlier games based on that series, but unlike them, it is a competitive vs. fighting game. It is not a traditional one-on-one fighter, but an arena-based, four-player game - somewhat along the lines of Power Stone.</p><p>There are two game modes. There is a single-player adventure mode in which you must guide one of ten characters (including six unlockables) through a series of 100 bouts that have you either beating up enemies, or, in a few cases, dodging bombs for a set amount of time. Completion of these portions unlocks the additional characters, bonus characters and stages for melee mode.</p><p>Melee mode is the multiplayer portion. It has ten basic and twelve unlockable characters, and nine basic and fifteen unlockable stages. There are four game types which mirror popular types from first-person shooters. There is a deathmatchesque knock-out mode, where the goal is to score the most KOs. (Players respawn after being KOed.) There is also a Last Man Standing mode, where the goal is to be the only player left when the others are KOed, a King of the Hill, where you must stand on a glowing patch of ground and defend it from other players, and a Keep away mode, where you must hold a treasure chest and avoid other players who are trying to beat you up and take it.</p>"},{"name":"TOCA Race Driver 2","year":2004,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_t_part1/TOCA%20Race%20Driver%202%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6385844602,"score":8.2,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>Codemasters returns to the racing fold once more with Race Driver 2. On this occasion, you can race your way through 15 different types of motorsport including the usual supercars and stock car types to the more unique rally, formula ford and supertruck types, plus much more.</p><p>The single player career mode has you racing for pride through various championships from around the world, including the European ToCA and Australian V8 Supercars series, racing on tracks that will take you from Laguna Seca to Bathurst with another 20 cars maximum racing against you at any one time. You can then take to the online modes, racing with up to 12 other people through either your PC internet connection or Xbox Live.</p>"},{"name":"TOCA Race Driver 3","year":2006,"developer":"The Codemasters Software Company Limited","url":"microsoft_xbox_t_part1/TOCA%20Race%20Driver%203%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6208881352,"score":8.2,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p>TOCA Race Driver 3 follows on from the ideas started in Race Driver 2. The game attempts to include as many different forms of four-wheeled racing in one game, as well as injecting each with a high degree of realism.</p><p>The game has over 70 licensed cars and 80 real tracks, as well as 35 different disciplines of racing.</p><p>There are two main gameplay modes. The World Tour mode has the player starting a racing career and, with the help of a Scottish manager, attempting to gain renown and acceptance into more famous racing events. There are 3D rendered cutscenes shown from the player's point-of-view, which move the story along and, while not as detailed as its predecessor, gives a good idea of the back scenes of a professional racer's life aside from just the racing. This mode includes mixtures from all the racing disciplines.</p><p>The second mode allows the player to choose one discipline and play a career focused on that choice. This mode has no back-story and longer, more realistic races.</p><p>TOCA Race Driver 3 provides two different driving models, Simulation and Pro-Simulation. The latter is recommended for gamers with analog steering wheels only. Simulation is intended for gamers without wheels, or who want an easier experience. This mode is also noticeably easier than the Simulation mode from TOCA Race Driver 2.</p>"},{"name":"ToeJam & Earl III: Mission to Earth","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_t_part1/ToeJam%20%26%20Earl%20III%20-%20Mission%20to%20Earth%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6584668410,"score":6.8,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p>12 sacred Albums of Funk are missing from the planet Funkotron and it's believed that they are on Earth. The funky duo, ToeJam &amp; Earl; along with their new friend, Latisha; take it on themselves to recover them. Later they discover a disturbance in the funk balance and have to deal with the evil side of the funk - the 'Anti-Funk'.</p><p>The gameplay involves running around randomly generated 3D areas, and neutralizing earthlings with \"funk fu\"; all the while searching for and picking up items and powerups.</p><p>The 2-player mode plays as 2-player cooperative, where the screen splits when the players move apart and joins back when they're together.</p>"},{"name":"Tom and Jerry in War of the Whiskers","year":2003,"developer":"VIS Entertainment Limited","url":"microsoft_xbox_t_part1/Tom%20and%20Jerry%20in%20War%20of%20the%20Whiskers%20%28USA%29.zip","filesize":6827989767,"score":6.5,"genres":"Action > Isometric > Fighting > Licensed","desc":"<p>A Power Stone-like fighting game featuring characters from the classic Tom and Jerry series of cartoons.</p><p>Fight in a variety of arenas based upon classic Tom and Jerry cartoons, to unlock further levels and other T&amp;J characters that you can play as. Each level features breakable terrain and various implements that you can use to beat your adversary. Each level also features a unique surprise for unwary players.</p>"},{"name":"Tom Clancy's Classic Trilogy","year":2004,"developer":""},{"name":"Tom Clancy's Ghost Recon","year":2002,"developer":"Red Storm Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Ghost%20Recon%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":6688099266,"score":7.8,"genres":"Action > Simulation > Strategy > 1st-person > Shooter > Licensed > Regional differences","desc":"<p>The year is 2008, and Russian rebels have taken over Moscow in an attempt to restore the old communist regime. You are in command of The Ghosts, an elite military team and the United States' first line of defense.</p><p>Both single-player and multiplayer modes are available. In the single-player missions, you have an entire platoon of men at your disposal. In multiplayer, you command just one man, with the rest of your platoon controlled by humans instead of the computer.</p><p><em>Ghost Recon</em> is a first-person tactical shooter. You can choose one of four characters: sniper, rifleman, demolitions expert, and support expert, with specialists being unlocked as you complete the single-player missions.</p>"},{"name":"Tom Clancy's Ghost Recon 2: 2011 - Final Assault","year":2004,"developer":"Red Storm Entertainment, Inc."},{"name":"Tom Clancy's Ghost Recon 2: Summit Strike","year":2005,"developer":"Red Storm Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Ghost%20Recon%202%20-%20Summit%20Strike%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6421066625,"score":8.1,"genres":"Action > Strategy > 1st-person > Behind view > Shooter > Stealth > Spy / espionage > Licensed","desc":"<p>We're in 2012. A Pakistani warlord has assassinated the Kazakh President and that's not his only action. The country is chaotic... until the Ghosts arrive and work in concert with the U.N. attempting to put an end to the war.</p><p><em>Tom Clancy's Ghost Recon 2: Summit Strike</em> is a standalone expansion pack for Tom Clancy's Ghost Recon 2, featuring a new campaign taking place in Kazakhstan that is composed of 11 missions. There are also six new multiplayer maps and 15 new weapons.</p><p>You control yourself and command a team of ghosts with simple orders (available through vocal system). You can tell them to stay put, attack, and flank left or right. You can also ask them to provide first aid (bringing squad members to half health), to mimic your stance or use weapons to level enemy tanks and jeeps.</p>"},{"name":"Tom Clancy's Ghost Recon: Advanced Warfighter","year":2006,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Ghost%20Recon%20-%20Advanced%20Warfighter%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6193285063,"score":5.9,"genres":"Action > 1st-person > Shooter","desc":"<p>The version of <em>Ghost Recon: Advanced Warfighter</em> released for the PlayStation 2 and Xbox differs from both the Xbox 360 and the Windows versions.</p><p>The player takes the role of Captain Scott Mitchell, who is a squad leader of the Ghosts. The game takes place in Mexico City, where separatists have attacked a North American summit, leading to the Canadian Prime Minister being killed and the Mexican and US presidents gone missing. Throughout the campaign, the player will need to rescue the presidents, recover a nuclear football and defeat the leader of the separatists. </p><p>This version of the game has a more streamlined level design, is less tactical than the other versions of the game, and is entirely played from a first-person perspective. Although the story, mission objectives, weapons and characters are the same as the Xbox 360 version, it has different level design and uses the UnrealEngine2 rather than the Yeti Engine. The player here only has one AI-controlled teammate with them and not a full squad. In this version, the player isn't able to go prone and can't jump over fences or climb obstacles, but they can instead sprint.</p><p>The multiplayer components differ between the versions. Both the PlayStation 2 and Xbox versions feature online multiplayer, while local multiplayer is only available in the Xbox version. The Xbox version supports up to four players in split-screen and up to twelve players on Xbox Live or System Link. The campaign can also be played in co-op by two players. The PlayStation 2 version supports up to eight players online, but doesn't have a co-op mode available.</p>"},{"name":"Tom Clancy's Ghost Recon: Island Thunder","year":2003,"developer":"Red Storm Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Ghost%20Recon%20-%20Island%20Thunder%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6706583249,"score":7.9,"genres":"Action > Simulation > Strategy > 1st-person > Real-time > Shooter > Spy / espionage","desc":"<p>The Ghosts are an elite team of U.S. Army Green Berets, sent to Cuba as part of a UN peacekeeping force to destroy the rebel forces and their mercenary leaders and secure the elections for a free Cuba.</p><p><em>Ghost Recon: Island Thunder</em> includes a complete single and multiplayer challenge, featuring Xbox Live multiplayer support and future downloadable content.</p>"},{"name":"Tom Clancy's Rainbow Six 3","year":2003,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Rainbow%20Six%203%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6343505304,"score":7.5,"genres":"Action > 1st-person > Shooter > Tactical shooter > Voice control > Licensed > Regional differences","desc":"<p>In 2007, an unidentified group of terrorists attack a number of high-profile targets, beginning with the G8 summit in Switzerland and continuing with a Venezuelan oil refinery in the Caribbean. Their demands are obviously targeted at disrupting the oil trade between the United States and Venezuela. Enter veteran international anti-terrorism unit Team Rainbow, who must stop the terrorists and discover who is behind the attacks.</p><p><em>Rainbow Six 3</em> is an entry in the long-running series designed especially for consoles. It does away with the heavy strategy and planning elements the series was known for on the PC and offers an experience more focused on the first-person action. The game features 14 single-player levels (15 in the PS2 and GameCube versions). In each, the player controls Domingo 'Ding' Chavez, who leads a team of three other Rainbow operatives. Goals in each mission include taking out terrorists, defusing bombs and protecting hostages. Ding's squad mates will act on their own in supporting the mission, but they can also be given specific orders through a context-sensitive menu: holding position, advancing, clearing a room or defusing a bomb. It's also possible to give delayed orders which are only carried out once a special signal is given. The Xbox version features voice recognition: team orders can be given through a headset.</p><p>Before each mission, each squad member must be equipped with a primary and secondary weapon plus further equipment. More than two dozen realistic firearms are available, and there are also different types of grenades (hand-thrown or fired through a launcher), charges and mines, as well as a gas mask. Thermal and night vision are always available and don't require special equipment.</p><p>Despite the action focus, the game still opts for a certain amount of realism: there is no running or jumping, more than a few hits are fatal and there is no way to regain lost health.</p><p>Besides the single player campaign, there is also the custom mission mode, which allows the player to hunt terrorists on unlocked maps from the campaign.</p><p>The multiplayer modes include:</p><ul><li>Cooperative campaign mode</li><li>Cooperative custom mission mode</li><li>Sharpshooter mode: a timed deathmatch with respawning, the player with the most kills wins.</li><li>Survival mode: no respawns, the last player standing wins.</li><li>Team Survival mode: no respawns, the last team standing wins.</li></ul><p>Multiplayer features vary between platforms: The GameCube doesn't have the competitive modes, PS2 only supports six players online instead of the Xbox' sixteen, and both coop modes are only available via split screen on PS2 and GameCube.</p>"},{"name":"Tom Clancy's Rainbow Six 3: Black Arrow","year":2004,"developer":"Ubisoft Studios SRL","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Rainbow%20Six%203%20-%20Black%20Arrow%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6399185423,"score":8.3,"genres":"Action > Simulation > 1st-person > 3rd-person (Other) > Shooter > Licensed > Regional differences","desc":"<p><em>Black Arrow</em> is the Xbox sequel to the acclaimed Rainbow Six 3. Based on an improved version of the same engine, the game features a new single player campaign, new multiplayer maps and game modes, and new Xbox Live! clan support features. Follow team Rainbow through missions set in the Europe and the Mediterranean: the UK, France, Italy, Tunisia, Croatia, Greece and more.Like other Rainbow Six games, Black Arrow also supports cooperative campaign and game modes, and introduces two-player split screen.</p>"},{"name":"Tom Clancy's Rainbow Six: Critical Hour","year":2006,"developer":"Ubisoft Quebec City Studio","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Rainbow%20Six%20-%20Critical%20Hour%20%28USA%29%20%28En%2CFr%29.zip","filesize":6575924463,"score":6.7,"genres":"Action > 1st-person > Shooter > Tactical shooter > Licensed","desc":"<p>Critical Hour is the fourth Rainbow Six game to appear on the consoles. You play as Ding Chavez, leading a small commando team on black-ops missions. The main single player revisits seven of the most popular missions from the original Rainbow Six and Rogue Spear game, recreated with modern technology. The game returns to the roots of the franchise with tactical gameplay and \"one-shot kills\".</p><p>There is a split-screen mode available and full online multiplayer featuring modes like Practice Mission, Terrorist Hunt, Team Survival, Total Conquest, Retrieval, Team Sharpshooter, Free-for-All Survival (new), Free-for-All Sharpshooter (New) and Assassin (new). Up to 16 players can compete over Xbox Live.</p><p>The persistent elite creation mode from Rainbow Six: Lockdown is also available.</p>"},{"name":"Tom Clancy's Rainbow Six: Lockdown","year":2005,"developer":"Red Storm Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Rainbow%20Six%20-%20Lockdown%20%28Japan%29%20%28En%2CJa%29.zip","filesize":6645568001,"score":7,"genres":"Action > 1st-person > Shooter > Tactical shooter","desc":"<p><em>Lockdown</em> is the third Rainbow Six game to appear on the consoles, this time with Red Storm Entertainment fully behind the wheel. Once again, you play as Domingo 'Ding' Chavez, leading a small commando team on black-ops missions. This time, however, the developer strays from the realistic squad-based action in favor of more arcadish gameplay. The main single player campaign is based around a dangerous virus and hostages. In certain missions, you play as sniper Dieter Weber, picking off terrorists from higher ground and providing cover while the team infiltrates the building.</p><p>The differences between the console versions are the number of missions and the availability of certain gadgets. There is an offline two-player, split-screen cooperative mode available (up to 4 over Xbox live) and full online multiplayer up to 16 players featuring traditional deathmatch, objective-based games and CTF modes, on Xbox and PS2. While the PS2 version includes a Rivalry mode, Xbox online multiplayer has an RPG element: the P.E.C. mode (Persistent Elite Creation). Before playing, you choose an avatar and a class with specific abilities (commando, engineer, spec op and medic). While playing, you earn credits and experience, which can be traded in for new weapons, items or armour. Gear regularly needs to be repaired, shown by the durability level, and experience can be used to assign skills points to abilities, individualizing your character.</p>"},{"name":"Tom Clancy's Splinter Cell (Disc 1)","year":2002,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Splinter%20Cell%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6645241199,"score":8.2,"genres":"Action > 1st-person > Behind view > Stealth > Direct control > Asia > North America > Spy / espionage","desc":"<p><em>Splinter Cell</em> is a third-person action game with a focus on stealth, similar to the Metal Gear Solid series. The player takes on the role of Sam Fisher, an operative for the secret organization NSA Black Operation, part of the U.S. government. The organization deals with very sensitive missions, often taken on by a Third Echelon splinter cell division Fisher is part of. His missions are so discreet, that if he is captured the government will deny any such existence of that organization.</p><p>To get around and reach his objectives, Fisher has a variety of moves at his disposal. He can walk, run, crouch, jump, rappel, shimmy, cross horizontal wires, zip using a zip cord, and do a split jump. There are different approaches to taking out enemies. He can use weapons, but the noise might alert guards and that generally makes it more difficult to complete missions. Opponents can be stunned, killed, or subdued. Fisher can for instance jump down from the ceiling and knock an opponent unconscious. Some enemies are needed to activate a door or passcode. Therefore enemies can be taken hostage by holding a gun to their head. They can also be interrogated or be used as human shields.</p><p>Other features include the ability to peak through a door before going through or use an optic cable camera (a \"snake\" camera) to peer through the underside, to check what is ahead. As the focus is on stealth, the amount of weapons is rather small. There is an FN F2000 assault rifle that can be fitted with a silencer and other modifications, and there is a suppressed FN Five-Seven pistol. Ammo is limited and additional bullets are scarce. Players are encouraged to avoid danger by sneaking through shadows and hiding behind objects. Fisher has access to a light meter to check how visible he is, and night vision as well as thermal goggles to see in the dark and view warmer temperatures in colour. Other weapons are ring airfoil projectiles, gas grenades and sticky shockers.</p><p>The Xbox version is the original one, with a closely adapted version for the PC, and separate ports for PS2 and GameCube. The latter have slight changes in levels generally to make it a little easier. Each version also contains some exclusive features. The Xbox and PC versions include three additional downloadable missions (Tom Clancy's Splinter Cell: Mission-Pack). The PS2 version has an exclusive level, and the GameCube version can be connected with a Game Boy Advance through a link cable to view an overhead map. The PS2 and GameCube versions include additional binocular items, and the latter also has an extra sticky bomb weapon. The PS2 release also has an exclusive 5min pre-rendered intro cinematic with full orchestrated score, showing how the two agents you are sent to look for at the beginning of the game were captured.</p>"},{"name":"Tom Clancy's Splinter Cell (Disc 2)","year":2002,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Splinter%20Cell%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29%20%28Bonus%20Disc%29.zip","filesize":6873672970,"score":8.2,"genres":"Action > 1st-person > Behind view > Stealth > Direct control > Asia > North America > Spy / espionage","desc":"<p><em>Splinter Cell</em> is a third-person action game with a focus on stealth, similar to the Metal Gear Solid series. The player takes on the role of Sam Fisher, an operative for the secret organization NSA Black Operation, part of the U.S. government. The organization deals with very sensitive missions, often taken on by a Third Echelon splinter cell division Fisher is part of. His missions are so discreet, that if he is captured the government will deny any such existence of that organization.</p><p>To get around and reach his objectives, Fisher has a variety of moves at his disposal. He can walk, run, crouch, jump, rappel, shimmy, cross horizontal wires, zip using a zip cord, and do a split jump. There are different approaches to taking out enemies. He can use weapons, but the noise might alert guards and that generally makes it more difficult to complete missions. Opponents can be stunned, killed, or subdued. Fisher can for instance jump down from the ceiling and knock an opponent unconscious. Some enemies are needed to activate a door or passcode. Therefore enemies can be taken hostage by holding a gun to their head. They can also be interrogated or be used as human shields.</p><p>Other features include the ability to peak through a door before going through or use an optic cable camera (a \"snake\" camera) to peer through the underside, to check what is ahead. As the focus is on stealth, the amount of weapons is rather small. There is an FN F2000 assault rifle that can be fitted with a silencer and other modifications, and there is a suppressed FN Five-Seven pistol. Ammo is limited and additional bullets are scarce. Players are encouraged to avoid danger by sneaking through shadows and hiding behind objects. Fisher has access to a light meter to check how visible he is, and night vision as well as thermal goggles to see in the dark and view warmer temperatures in colour. Other weapons are ring airfoil projectiles, gas grenades and sticky shockers.</p><p>The Xbox version is the original one, with a closely adapted version for the PC, and separate ports for PS2 and GameCube. The latter have slight changes in levels generally to make it a little easier. Each version also contains some exclusive features. The Xbox and PC versions include three additional downloadable missions (Tom Clancy's Splinter Cell: Mission-Pack). The PS2 version has an exclusive level, and the GameCube version can be connected with a Game Boy Advance through a link cable to view an overhead map. The PS2 and GameCube versions include additional binocular items, and the latter also has an extra sticky bomb weapon. The PS2 release also has an exclusive 5min pre-rendered intro cinematic with full orchestrated score, showing how the two agents you are sent to look for at the beginning of the game were captured.</p>"},{"name":"Tom Clancy's Splinter Cell: Chaos Theory","year":2005,"developer":"Ubisoft Entertainment Inc.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Splinter%20Cell%20-%20Chaos%20Theory%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6055119541,"score":8.2,"genres":"Action > Behind view > Stealth > Direct control > Asia > North America > Spy / espionage > Licensed","desc":"<p>Set in the not too distant future, Japan creates the Information Self-Defense Force (I-SDF). The creation of this force is seen as a violation of international law and Japan's constitution, and it causes tensions to rise between Japan, China, and North Korea. In time, North Korea and China set up shipping blockades around Japan, and Japan calls on the United States for help, citing article nine of the Postwar Constitution. Throughout this time, Japan uncovers more and more information that the infamous Black Gold Day was caused by intentional information warfare attacks. As the U.S. prepares to launch the USS Clarence E. Walsh, Third Echelon sends the famous Sam Fisher on a mission that appears to be unrelated to the incident, but which may end up being the most important element of it all.</p><p>In <em>Splinter Cell: Chaos Theory</em>, players take on the role of field operative Sam Fisher for a third outing. Fisher has some new moves this time around, and he also has a new weapon always at his disposal; a combat knife. Utilizing the knife, Sam can either kill his enemies, or simply knock them out. At the end of each mission, the player is given an overview of how they did. The more people that the player spares, the better the success score.</p><p>The single-player game is more open-ended than the past two Splinter Cell games. While players are still forced through some areas in a \"tunnel\" like fashion, with no choice of where to go, there are many instances where they can decide how they'd like to get there. For example, in the caverns, one can either kill two enemies and cross the bridge, or leave them alone, sneak along the side path, and climb a ladder at the end, bypassing the fight entirely, but still winding up in the same location.</p><p>Throughout the game many different locations are visited, such as a lighthouse, a Japanese tea house, Seoul, New York City during an East Coast blackout, and other such exotic locales.</p><p>The Spies-vs-Mercs multiplayer mode that appeared in the previous game has returned, with some new features. There are several new, large maps to play on, as well as updated versions from the past game. The PC, PlayStation 2, and Xbox versions feature this mode.</p>"},{"name":"Tom Clancy's Splinter Cell: Double Agent","year":2006,"developer":"Shanghai UBIsoft Computer Software Co., Ltd.","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Splinter%20Cell%20-%20Double%20Agent%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6340473635,"score":7.6,"genres":"Action > 1st-person > 3rd-person (Other) > Shooter > Stealth > Africa > North America > Spy / espionage > Licensed","desc":"<p>Once, Sam Fisher was an agent of Third Echelon, assigned to infiltrate strongholds belonging to enemies of National Security, gather information and neutralize enemies if needed.</p><p>Times are changing, America's enemies are looking at new options, finding ways to make themselves more deadly. In order to star one step ahead of its target, Third Echelon is also changing and while Sam Fisher's foes are evolving and his allies are in flux, Fisher's own life will undergo some dramatic and permanent changes. And once that happens nothing will ever be the same.</p><p>With his life turned upside down, Fisher is on a new mission unlike any he has ever been sent on before. Where he used to penetrate defenses and gather information from the outside, now he is on the inside, working with those he has sworn to destroy and finding enemies among his allies. He is risking everything for the sake of the greater good, even if it costs him his identity or his life.</p><p>Play the game in a stealth manner or in a gun blazing way and your experience will be different every time you play. Try to sneak around the enemies and kill, interrogate or neutralize them without anyone else notice. There are 3 different endings depending on your choices in the game. Different settings will be visited during the game such as a prison, a boat in Cozumel, visit Africa, and many more.</p><p>You will get many different weapons and gadgets to help you through your journey. Use gadgets to close the lights, use gadget to electrify enemies in water pond, and scan the surroundings using your many visions (electric, night vision, heat vision) to identify potential gameplay objects around the worlds.</p><p>This version is quite different from the Xbox 360/Windows release. They share the same engine (although it is not multi-threaded), but this release adds an additional single-player mission with alternate ending, a new Spies vs. Spies online mode, 14 co-op missions playable offline (also online for the Xbox version), LAN, and 8 minutes of additional cinematics. There are also some changes in the storyline. The Wii/GameCube versions only have co-op multiplayer.</p><p>The Spies vs. Spies multiplayer offers different game modes:<em> </em>Team Hack*: similar to capture the flag, but you need to hack the opponent's computer and secure your own.</p><ul><li><p><em>Deathmatch</em>: regular matches.</p></li><li><p><em>Team Deathmatch</em>: regular team matches.</p></li><li><p><em>Key Run</em>: similar to Team Hack, but with the addition of a key that needs to be obtained first to hack into the opponent's computer</p></li><li><p><em>Sam Vs. All</em>: a single player, Sam Fisher, has to sneakily hack into computers defended by an entire team.</p></li><li><p><em>Countdown</em>: similar to Deathmatch, with the addition of gameplay time provided by killing other players.</p></li></ul>"},{"name":"Tom Clancy's Splinter Cell: Pandora Tomorrow","year":2004,"developer":"Ubisoft Annecy SAS","url":"microsoft_xbox_t_part2/Tom%20Clancy%27s%20Splinter%20Cell%20-%20Pandora%20Tomorrow%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6530425892,"score":8.4,"genres":"Action > Behind view > Stealth > Direct control > Europe > Middle East > North America > Spy / espionage","desc":"<p>In <em>Pandora Tomorrow</em>, you reprise your role as Sam Fisher, along with old friends Irving Lambert and Anna Grimsdottir.</p><p>A terrorist has a disease which he plans to spread through the United States. He makes daily phone calls to an undisclosed location every day, delaying the release of the disease by one more day. As Fisher, you must find out who the terrorist is, where he is, who he is working for, and above all, stop him.</p><p>In order to do this, you are taken all around the world, from Paris to Indonesia to the holy land Jerusalem. Sam comes equipped with his standard pistol and SC-20K. The SC has been improved, with an added scope with two levels of zoom. You have access to all the equipment from the first game, including Sticky Shockers, Diversion Cameras, Frag and Smoke Grenades.</p><p>Sam has also learned some new moves. He has the ability to perform a SWAT turn, which allows him to pass from one side of an open door to the other without being spotted. He may perform a half-split jump, enabling him to lean against one side of a wall to give him boost to jump higher. He can also whistle, to attract the attention of any nearby enemies.</p><p><em>Pandora Tomorrow</em> also has a full fledged multiplayer game, playable on Xbox Live. The multiplayer ties in to the single player campaign, and it pits the Shadownet team (spies) against the Argus team (mercs). The game supports four players.</p><p>Members of Shadownet must infiltrate various complexes to retrieve canisters of a deadly liquid, but they must watch out for cameras, motion sensors and trip lasers, all of which alert the mercs to their position. The spy cannot kill with weapons, but he can stun the mercs for several seconds in order to sneak up and kill from behind.</p><p>On the other side, the mercs must make their way to each canister, guarding it from the Shadownet team. Whenever an alarm is tripped, the merc is instantly alerted to where the spy is. To help fight the Shadownets, the mercs have a built-in motion sensor view, which picks up any moving objects, as well as an electromagnetic view, which picks up on spy gadgets. The mercs come equipped with a rifle, and must defend the viral canisters at all costs.</p><p>Multiplayer comes with a good variety of maps, ranging from a warehouse and a factory to a cinema and three towering skyscrapers. More maps will be available in the future via Xbox Live.</p>"},{"name":"Tony Hawk's American Wasteland","year":2005,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20American%20Wasteland%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6277256965,"score":7.5,"genres":"Sports > Behind view > Skateboarding > Licensed","desc":"<p>You are a new skater in the city of L.A..  The main drive of the game is that your hanging around with a skating group and its leader, who also happens to be a skating legend, at their skate park in Beverly Hills called Skate Ranch.  Throughout the game you must help your friends by getting skate pieces for Skate Ranch.</p><p>The game marks the third reinvention of the series, with Pro Skater being the first, and Underground being the second.  It comes with brand new features like the ability to change your personal appearance in game, as well as the ability to get off of the skateboard and use a BMX.  For the first time all of levels are strung together into one big environment, which gets rid of loading times and menu selection.</p><p>Old features were also kept like Create-a-park, which dates back to the Pro Skater series.  Missions are still acquired by going up to random people or friends and accepting the mission they want you to run.</p><p>The game also includes a multiplayer mode and co-op for up to 2 players for added replay value.</p>"},{"name":"Tony Hawk's Pro Skater 2x","year":2001,"developer":"Treyarch Corporation","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Pro%20Skater%202x%20%28USA%29.zip","filesize":6659799107,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>2x includes both Tony Hawk 1 and 2, together with improvements to backgrounds and player models, new Treyarch levels exclusive to the Xbox, and the ability to use all your favorite Tony Hawk 2 tricks in the original Tony Hawk. Plus between 4 and 8 players can play simultaneously in the many multiplayer options including Trick Attack, Graffiti, Tag, HORSE and Free Skate.</p>"},{"name":"Tony Hawk's Pro Skater 3","year":2002,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Pro%20Skater%203%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6755098012,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>Tony Hawk returns with an all new line-up of skaters, an all new line-up of parks to crash through, and a whole new level of graphics.</p><p>The line-up of street and vert riders include Elissa Steamer, Jamie Thomas, Steve Caballero, Rune Glifberg, Geoff Rowley, Andrew Reynolds, Rodney Mullen, Eric Koston, Chad Muska, Bucky Lasek and Bam Margera from MTV's Jackass (and Tony Hawk, of course).</p><p>The create a skater mode returns, allowing for even further levels of options for your character, like adding glasses and tatoos to changing the colour of the knee and elbow pads or even the hair.</p><p>And the levels themselves that you must skate through are now more interactive, with cars and humans blocking paths and making noise as you race around to make as many points as possible. Use items around the streets or the park to jump from or over to increase your score, and pull of as many wild and wacky tricks as you can.</p>"},{"name":"Tony Hawk's Pro Skater 4","year":2002,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Pro%20Skater%204%20%28Europe%29.zip","filesize":6816488462,"score":8,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Skateboarding > Licensed","desc":"<p><em>Tony Hawk's Pro Skater 4</em> is the fourth game in Activision's skateboarding franchise.</p><p>The main feature of this game is it's redesigned career mode. When beginning a level, you have all the time in the world to skate around, perform tricks, get a feel for the level, without the hassel of any goals or time limits. When you're ready to attempt a goal, simply find a pro skater, talk to him, then receive the goal, similar to Dave Mirra Freestyle BMX. Goals are similar to the previous games, such as collect SKATE, get a certain amount of points, transfer over this and grind that. There are new goals, however, such as collecting the word COMBO while doing one big combo. Miss a trick, and goal fails. Once all regular goals are accomplished, you can attempt the Pro Goal, which is specific to each skater, and is extremely hard.</p><p>All the major skaters are here, including Tony Hawk, Bob Burnquist, Steve Caballero, Kareem Campbell, Rune Gilfberg, Eric Koston, Bucky Lasek, Bam Margera, Rodney Mullen, Chad Muska, Andrew Reynolds, Geoff Rowley, Elissa Steamer and Jamie Thomas.</p><p>The levels are been expanded and are huge. Some of the levels include a college campus, a shipyard, and the infamous prison complex Alcatraz.</p><p>For multiplayer, all the favorite modes are back, from Graffiti and Trick Attack to Horse and King Of The Hill. New modes include Capture The Flag and Combo Mambo. THPS4 also supports System Link play, but not XBox Live.</p><p>The PlayStation 2 version offers everything from the XBox version, but also has online play, utilizing either your own network adaptor or the official one. The PS2 version also features a one level demo of Shaun Murray's Pro Wakeboarder, which is not featured on any other version of the game.</p>"},{"name":"Tony Hawk's Project 8","year":2006,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Project%208%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6406811377,"score":7.9,"genres":"Sports > Behind view > Direct control > Skateboarding > Licensed > Regional differences","desc":"<p>In <em>Tony Hawk's Project 8</em>, The Birdman is out looking for the top 8 skaters for his new Project and it happens that he has stopped in your city to search for the best top skaters. It is up to you to prove that you can make the cut among the 200 other people varying for the coveted 8 spots. You are start out ranked 200th with various goals set for you throughout the city including the return of classic mode from the early Tony Hawk games. </p><p>Chances to rank up come in various different ways now. There are spray painted lines located throughout the city to mark a type of goal. Weather it is grinding a certain distance, completing Natas spins, keeping your balance while doing a manual for a certain time and distance, point combos, and trick combos. Also players can obtain missions via random strangers located throughout the city.</p><p>Players can also earn Stokens by performing tricks to impress the locals that can be found wandering around the city. Players can use these Stokens to buy additional clothing, haircut styles, shoes, tricks, and boards from the store.</p><p>New to this game is the slow motion \"Nail the Trick\" mode where the focus is placed on the skater's feet and the movement of the board can be controlled with both of the analog sticks to build up a huge combo score!</p><p>The PSP version includes 14 multiplayer modes and 8 classic levels including Hawaii, Alcatraz and The Mall. The PS2, PS3 and Xbox version do not support online multiplayer.</p>"},{"name":"Tony Hawk's Underground","year":2003,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Underground%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6496220090,"score":7.7,"genres":"Sports > Behind view > Tricks / stunts > Skateboarding > Licensed","desc":"<p>The fifth game in the series, <strong>Tony Hawk's Underground</strong> is the first game to have a true career mode.</p><p>You begin the game as a local skater whom nobody knows. Your board is wearing thin, and your tired of being a nobody. As your out skating, you see a flyer for a pro who's coming to your city to demo. You go to the skate demo and watch. Afterwards, you try to impress the pro, and he gives you advice on how to go about becoming a star. With your friend, Eric, you're now on your way to becoming a legend.</p><p>THUG takes you to various cities to perform different goals. You begin in New Jersey, which acts as a sort of training stage, where goals are simple. Eventually, you'll visit Manhattan, Vancouver, Moscow, Tampa, San Diego and Hawaii. Most cities are split into different chapters, with each chapter opening new goals.</p><p>THUG introduces a new system; walking. You can get off your skateboard to run or walk around the level. If there's a high tower you want to jump off of, get off your board, climb to the tower (by climbing a ladder or shuffling across a wire), get back on your board, and jump down. One of the new tricks associated with this is the Acid Drop, which can launch you off an opposing pipe, allowing you to pull off 1080's and up.</p><p>Also new to THUG is the ability to drive certain vehicles, like a gardener's truck, a sports car, or a leaf blower. These are used for goals, but can be unlocked to drive whenever and wherever.</p><p>Next to the standard Create-a-Park and Create-a-Skater, you can now create your own decks and your own tricks. The biggest feature is Create-a-Goal. You can create custom goals for one of the levels (or your own), and choose what pedestrian will give it to you, his/her dialogue, and what they'll say when you win.</p><p>The PlayStation 2 version supports online play.</p>"},{"name":"Tony Hawk's Underground 2","year":2004,"developer":"Neversoft Entertainment, Inc.","url":"microsoft_xbox_t_part2/Tony%20Hawk%27s%20Underground%202%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6394753420,"score":7.6,"genres":"Sports > Behind view > Skateboarding > Licensed","desc":"<p><strong>Tony Hawk's Underground 2</strong> is the sixth game in the Tony Hawk series.</p><p>As an aspiring pro skater, you're invited to join Tony Hawk in an around-the-world underground skating competition known as the \"World Destruction Tour.\" It's Team Hawk against Team Bam in a no-holds-barred contest to gain the most points by performing insane stunts and raising havoc in cities all over the world.</p><p>THUG 2's story mode basically follows the same formula as THUG, in which you have to complete a number of goals before you can move on to the next city.</p><p>Re-introduced into the series is the \"Classic Mode\" wherein you have 2 minutes to complete as many goals as possible on any of THUG 2's levels and 6 remade classic levels.</p><p>THUG 2 has all-new unlockable characters, vehicles, levels.</p><p>All the Create-A-Modes from THUG are present, with the addition of the new Create-A-Graphic mode where you can make your own graffiti design with layers of text and predefined graphics, then use it to \"tag up\" during gameplay.</p><p>THUG 2 supports online play (Playstation 2 only) and 2-player split-screen modes in a variety of new and classic multiplayer games.</p>"},{"name":"Top Gear: RPM Tuning","year":2005,"developer":"Babylon Software","url":"microsoft_xbox_t_part2/Top%20Gear%20-%20RPM%20Tuning%20%28USA%29.zip","filesize":6225549390,"score":6,"genres":"Racing / Driving > Behind view > Automobile > Street racing","desc":"<p>In RPM Tuning you can get behind the wheel and live out numerous driving experiences in the city of Los Angeles while fully customizing your car and adding new elements to it body and mechanics. Drive freely through the streets wherever you want and sail through more than 50 miles of meticulously modeled real-life streets. Test your racing skills in seven different types of driving experiences and participate in five different game modes including two-person multiplayer. Customize trucks, muscle cars, imports, and others while learning the truth about what happened to the love of your life, your car. So get ready to gear up as you tear through the streets, proving you are the best in a race where there is no room for second.</p>"},{"name":"Top Spin","year":2003,"developer":"Power and Magic Development","url":"microsoft_xbox_t_part2/Top%20Spin%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6642792145,"score":7.9,"genres":"Sports > Behind view > Diagonal-down > Tennis","desc":"<p><em>Top Spin</em> is the Xbox's first tennis game, and it's playable over Xbox Live, allowing the player to compete in the XSN Sports Network. Over Xbox Live, two players can face each other in a one-on-one match, while in a doubles game up to four players can join. Stats are recorded and rankings are updated hourly at XSNsports.com.</p><p>The game has a career mode that takes the player all over the world. The first step is to create a player and give him a technical mastery. Once in the game, the player may compete in various tournaments. There are games, minor pro games, and professional tournaments. Winning games earns money and a higher ranking. The goal is to go from rank one hundred to number one.</p><p>Four different statistics can be gradually improved: serve, backhand, forehand, and volley. A higher skill will make for better and harder serves, more accurate and powerful back- and forehands, and the ability to keep the ball in play longer with volleys. There are also skills to obtain, such as risk and ace, which improves chances of hitting a successful risk shot or acing the opponent on a serve.</p><p>In Exhibition mode, the player may choose a created character or one of several real life pros, such as Pete Sampras or Anna Kournikova.</p>"},{"name":"Torino 2006","year":2006,"developer":"49Games GmbH","url":"microsoft_xbox_t_part2/Torino%202006%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6893566420,"score":5.1,"genres":"Sports > 1st-person > Behind view > Olympiad / mixed sports > Snowboarding / skiing > Licensed","desc":"<p><em>Torino 2006</em> is the official game of the XX Winter Olympic Games held in Turin, Italy, and the eight in the line of multi-event IOC licensed titles. The game includes 15 events scattered on 8 disciplines: Alpine Skiing (Downhill, Super G, Giant Slalom and Slalom), Ski Jump (Normal and Large hill), Speed Skating (500m, 1000m and 1500m), Women's Biathlon, Nordic Combined, Bobsled (Womens' 2 and Mens' 4), Luge and Cross Country. All venues were modelled after their real counterparts.</p><p>Gameplay, as expected, requires more reflexes than the button-bashing of their Summer counterparts. Alpine Skiing is a matter of skill and quick reflexes, as the player, other than set the direction, only has to choose when to crouch to gain speed (mostly in Downhill and Giant Slalom) and when to carve the snow for sharper turns (either to correct a bad trajectory or approach a tighter gate). These events are based on a simplified version of the engine that power <em>Ski Alpin 2006</em>, also by 49Games. Unlike most other games that feature alpine skiing, the penalty for missing gate depends on the difficulty level chosen: on easy, six misses are allowed, three in medium and none on hard, each carrying a time penalty that depending on how well the player did can just affect the total score or mean losing a medal.</p><p>Ski Jump (also a simplified version of another game, RTL Skispringen 2006) requires the player to keep the balance while descending the hill, jumping at the correct time, counter the effect of the wind in the athletes' balance for maximum distance and then land in perfect telemark fashion.</p><p>Cross Country and Biathlon are relaxed disciplines where all that counts is keeping the best trajectory possible while looking out for straight paths that can be used for short sprints and downhill slopes that can be done while crouching, which allows greater speeds and lower fatigue accumulated from sprints and more hasty climbs. Biathlon is pretty much the same as Cross Country, except it also includes two shooting sessions, with the steadiness of the aim affected by the fatigue levels.</p><p>Skating disciplines require a strong, well timed start, and then accurate button pressing as the skater makes each step. Bobsled and Luge are similar with only two differences: The startup in Bobsled is done by following the on-screen cues and press up on the right time and other than setting the direction, it's also possible to make minimal path changes. The winner is the fastest competitor after two heats (instead of the official four).</p><p>Nordic Combined is a Large hill ski jump which sets the start time for each competitor in the Cross country section.</p><p>It's possible to compete in all 15 or just 9 events, or even create your own competition, with up to four competitors. At each competition the players aim for both medals and the score table, based on the results on each individual event. However, the challenge does not stop with winning medals. The player can unlock additional strips by completing challenges, such as hitting all 10 targets in Biathlon, having a perfect Bobsled start, winning a gold medal and beat each top record on every event or not missing a single step on Speed Skating. The difficulty level affects events differently: in Alpine skiing, it means CPU-controlled players are faster and fewer gate misses are allowed, in Ski jump wind can appear from any direction and in Speed skating, in addition to set the pace, the player also has to steer the athlete to keep her in the best path.</p>"},{"name":"Tork: Prehistoric Punk","year":2005,"developer":"Tiwak SAS","url":"microsoft_xbox_t_part2/Tork%20-%20Prehistoric%20Punk%20%28USA%29.zip","filesize":6437719432,"score":6.3,"genres":"Action > Behind view > Platform > Puzzle elements","desc":"<p>When Tork's father is abducted while defending his village, Tork embarks on a journey through time to find his father and restore balance in the universe. You are Tork, a prehistoric caveboy. Throughout your adventures you must travel though 13 levels in 3 different time periods, including prehistoric times, the Middle Ages and modern era, each with new powers to attain. Your weapons and the enemies vary accordingly.</p><p>Beat up enough enemies to fill your rage bar and transform into one of three special animal forms, which will help you out of tough situations and even get you into special areas. Standard moves include a melee attack, a range attack and a double jump to reach difficult areas. The action is shown from the third-person perspective with a fixed camera angle.</p>"},{"name":"Total Club Manager 2004","year":2003,"developer":"Electronic Arts Deutschland GmbH","url":"microsoft_xbox_t_part2/Total%20Club%20Manager%202004%20%28Europe%29%20%28En%2CDe%29.zip","filesize":6511100256,"score":7.6,"genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p>2004 edition for this soccer managerial game that so far has been released only for the European market.</p><p>The game offers to the player the opportunity to become a every-aspect manager of a soccer team. At a first point you pick a team, hire your staff, build your tactics, develop your techniques and so on.</p><p>Therefore you are ready for the matches where you have the option of fast simulation, text simulation (like CM 01/02) or a complete 3D simulation...</p><p>Career Mode offers you to take a low-reputation club and turn it to a big success.</p><p>New features are:* \"Football Fusion(tm)\" allows players owning this title and \"Fifa 2004\" to play a manager on TCM 2004 while actually playing their team games on FIFA 2004 instead of just simulating.</p><ul><li><p>More leagues and teams from every place around the world.</p></li><li><p>Manage National Teams at the same time that you manage your team club. Play continental cups and the World Cup.</p></li><li><p>More than 10 additional stats to keep of your players best characteristics</p></li><li><p>Half-time interviews allows the coach to improve the team moral.</p></li><li><p>Trophies room and Hall of Fame offers you to track your achievements.</p></li><li><p>Player of the month and Manager of the month awards.</p></li><li><p>Improved Skill System.</p></li><li><p>3D graphics improved.</p></li></ul>"},{"name":"Total Club Manager 2005","year":2004,"developer":"Budcat Creations, LLC","url":"microsoft_xbox_t_part2/Total%20Club%20Manager%202005%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6182587962,"score":7.8,"genres":"Simulation > Sports > Strategy > Diagonal-down > Text-based / Spreadsheet > Managerial / business simulation > Menu structures > Football (European) / Soccer","desc":"<p><em>Total Club Manager 2005</em> is EA's third game in the Total Club Manager series. If the usual presentation of EA Sports games was left untouched, other features were changed from the TCM 2004: The 16 player attributes ranging from -1 to 2 become 30 in a 0-99 scale, the 3D engine was retouched with new AI and presentation, and finally, if the player is tired of world class footballing, now there's the opportunity to create a new club, and bring it up from the bottom leagues.</p>"},{"name":"Total Immersion Racing","year":2002,"developer":"Razorworks","url":"microsoft_xbox_t_part2/Total%20Immersion%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6772496490,"score":7.3,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Direct control > Automobile > Track racing","desc":"<p>Total Immersion Racing is a simulation concentrating on the GT / GTS and PRO (prototypes) classes racing series. Since these are official racing classes the game simulates circuit racing only.</p><p>A whole racing breed is presented to the player consisting of 14 racing cars ranging between the GT / GTS and Prototypes (PRO) classes, modeled and detailed according to the real models.</p><p>12 circuits are available in total, like Silverstone, Monza, Hockenheim and Talheimring among others.</p><p>Only a few of the circuits and the cars are available on initiation and the rest get unlocked upon the completion of several races and challenges later in the game.</p><p>The player can play the game in four different modes: via the career mode, the quick race mode, the time trial mode and the challenge mode.</p><p>During the career mode one has to compete a full season starting in a low spec GT car. The objective in the career mode is to win the seasons in order to gain contracts with better car teams and get promoted through the three classes.</p><p>The challenges are unified type of races which means that they are either same model cup races, same manufacturing country, same class etc. Winning one challenge unlocks the next till all 30 available get won.</p>"},{"name":"Total Overdose: A Gunslinger's Tale in Mexico","year":2005,"developer":"Deadline Games A/S","url":"microsoft_xbox_t_part2/Total%20Overdose%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6466010317,"score":7.1,"genres":"Action > Behind view > Shooter > Direct control > Contemporary > North America > Crime","desc":"<p>This Grand Theft Auto-inspired game of violence and vengeance begins deep in Maya jungle, where a man named Ernesto Cruz was lost in 1989. The official explanation for his disappearance was fatal overdose, but this is not enough for Ernesto's twin sons, Ram and Tommy. They embark on a quest for truth, though the Mexican wilderness and underworld urban environments inhabited by gangs, drug lords, and dangerous women.</p><p>Players can explore the large areas on foot, or commandeer any vehicle they choose. Total Overdose features a fighting game-styled combo system, and smart, skilled shooting unlocks new equipment and abilities. A \"Rewind\" system allows players to repeat a sequence to nail a perfect combo, or even to turn back the clock and avoid a fatal mistake.</p>"},{"name":"Totaled!","year":2002,"developer":"Rage Games Ltd.","url":"microsoft_xbox_t_part2/Totaled%21%20%28USA%29.zip","filesize":5195137357,"score":6.2,"genres":"Racing / Driving > 3rd-person (Other) > Arcade > Tricks / stunts","desc":"<p><em>Totaled!</em> is an action racing game, similar to the Destruction Derby games. Dispensing with any pretence of simulation, the game aims for arcade gameplay. The bright colours in the art style and easy way the cars can be turned with just a press of the handbrake all signal that this is not a game to be taken seriously.</p><p>Although cosmetically the damage is locational, the cars do not suffer unduly if the damage is taken all in one area. Unlike the Destruction Derby games, you can continue to use your front to ram opponents throughout a match. Rather than have the cars race laps, matches more often take place in open arenas of sand, ice, grass, mud and tarmac.</p><p>Multiplayer comes with different game modes. Traditional Last Man Standing is supplemented with multiple variations. A Hunter game-type, where one car is designated a target and points can only be scored by hitting it. There is also a score target which encourages going for the big points hits and stunts, rather than destroying competitors. Others are defensive and offensive driving challenges and a game type where only points scored by performing jumps and stunts are counted. Multiplayer is supported through 4-player split-screen, but no through Xbox Live play or the system link.</p>"},{"name":"Toxic Grind","year":2002,"developer":"Blue Shift, Inc.","url":"microsoft_xbox_t_part2/Toxic%20Grind%20%28Europe%29.zip","filesize":6734417189,"score":5.9,"genres":"Sports > Behind view > Tricks / stunts > Direct control > Bike / bicycling > Sci-fi / futuristic","desc":"<p>Sometime in year 2086 all extreme sports have been banned including skateboarding, BMX, surfing, rollerblading, and scooters. This banning has forced a major television company to create a reality TV show involving racing bikes for your life coined “Toxic Grind”. During this time all of the racers get killed off so the network builds a time machine to recruit some new riders from the past. You play as Jason Hayes, BMX star of the 20th century who is kidnapped and pumped with toxic chemicals insuring you do all the cool tricks to your ability on the game show or your insides will internally combust. You ride a bike, performing tricks to complete missions to advance through the stages of the game. You also have to do battle with your toxic meter which increases if you give a sloppy performance and decreases when you're excelling with your performance. </p><p>Multiplayer modes include Quick Draw, Score War, Turf War, and Tug of War(in which players each start with a certain amount of points and do tricks to take the other players points away.)</p>"},{"name":"TransWorld Snowboarding","year":2002,"developer":"Housemarque Ltd.","url":"microsoft_xbox_t_part2/TransWorld%20Snowboarding%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6583103073,"score":7.4,"genres":"Sports > 3rd-person (Other) > Tricks / stunts > Snowboarding / skiing","desc":"<p>TransWorld Snowboarding is a fast paced snowboarding, in which the focus isn't on the simulation of the sport, but instead on insane jumps, good graphics, easy controls and rock 'n roll.</p><p>There are 17 tracks to choose from, which are loosely based on some real world locations from everywhere around the world in which you can snowboard as a bunch of pro boarders also based on real professionals. The game modes span from trick modes, to speed runs, to the combination of these, and the main game mode is the World Tour mode where one completes different goals to advance levels, buying stuff as the game progresses. The game's soundtrack is a vast compilation on different genres of music, including something for everyone. Mostly hip hop and rock though.</p>"},{"name":"TransWorld Surf","year":2001,"developer":"Angel Studios, Inc.","url":"microsoft_xbox_t_part2/TransWorld%20Surf%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6866221666,"score":7.3,"genres":"Sports > Behind view > Direct control > Surfing","desc":"<p>A surfing game in the vein of Tony Hawk where you perform tricks to rack up points.  With great looking waves and top-notch sound, it can have a somewhat calming effect.  You get to pick from different 13 real-life surfers and 9 different locations such as Pipeline, Hawaii and Teahupoo, Tahiti.  Also includes a \"Karma\" system where if you act like a jerk (stealing other surfers waves, hitting people, etc.) bad things will happen.  Bad things with dorsal fins.</p>"},{"name":"Triangle Again","year":2002,"developer":"KiKi Co., Ltd.","url":"microsoft_xbox_t_part2/Triangle%20Again%20%28Japan%29.zip","filesize":5773934306,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Full Motion Video (FMV) > Music / rhythm > Visual novel","desc":"<p><em>Triangle Again</em> games are often referred to as music adventures rather than typical visual novels in a way that when the branching in the story occurs, choices are presented in a way of notes rather than text. The game story is centered around young Akari Tateshina and her debut as a pop singer. Additionally to typical set of options for this type of game (i.e. clickable versus auto-scrolling text), <em>Triangle Again</em> offers positioning of the text messages (up or down) and also support regular and widescreen picture presentation.</p><p>There are several licensed songs used in the game as protagonist's song hits when she sings them during animated scenes. While same songs are used in both Xbox and PlayStation 2 release, Xbox songs use Japanese lyrics while PlayStation 2 songs use English lyrics.</p>"},{"name":"Triangle Again 2","year":2002,"developer":"KiKi Co., Ltd.","url":"microsoft_xbox_t_part2/Triangle%20Again%202%20%28Japan%29.zip","filesize":5461114693,"score":"","genres":"Adventure > 1st-person > Anime / Manga > Full Motion Video (FMV) > Visual novel","desc":"<p><em>Triangle Again 2</em> continues the story chapters where the predecessor Triangle Again left off. The main scenario follows the story of Akari Tateshina, a young and talented pop singer, and her comeback to the scene. The game features many in-game choices with affect the story leading up to 15 different endings. The game offers up to 10 different save game slots which may help you try out different choices if you save at key points in order to clear many different story arcs. Replay option let you re-play the story arc to the game ending you have reached, making the game re-play feel like watching a full length anime movie.</p><p>Seeing as how this game features chapters 3 and 4 of the overall story, the graphics and gameplay did not change in this sequel. Story progress uses typical page-click or auto mode. Subtitles can be turned off or moved to appear on upper or lower part of the screen. Display picture can be set to normal or widescreen mode. The game also features seven new licensed songs.</p>"},{"name":"Trigger Man","year":2004,"developer":"WNT Games","url":"microsoft_xbox_t_part2/Trigger%20Man%20%28USA%29.zip","filesize":6884714213,"score":5.1,"genres":"Action > 3rd-person (Other) > Shooter","desc":"<p><em>Trigger Man</em> is an action game where the main protagonist Trigger Man works for the Coladangelo Family, who is on the brink of a mafia-style war with the rival Montagano Family, which believes Don Coladangelo is responsible of the death of their Don's son. Shown from a third-person perspective players need to visit typical locations such as villas, restaurants and casinos to take down members of the opposing family.</p><p>Next to the basic action missions there is some focus on stealth and escorting too. Some sections require a key to be found in order to progress. While fighting, there is a focus on head shots, as enemies can take a lot of bullets in other body parts before going down. There are eight missions in total.</p><p>There are different types of weapons including a blade, machine guns and sniper rifles, but only a small amount of clips can be carried. Enemies hardly ever leave anything behind, so ammo crates need to be hunted down.</p>"},{"name":"Triple Play 2002","year":2002,"developer":"Pandemic Studios, LLC","url":"microsoft_xbox_t_part2/Triple%20Play%202002%20%28USA%29.zip","filesize":6702846135,"score":6.3,"genres":"Sports > 3rd-person (Other) > Baseball","desc":"<p>EA Sports delivers their entry into the US Major League baseball game genre with Triple Play 2002. This game features 3D graphics, various modes of play, and guest commentary sound (see details below). </p><p>Triple Play 2002 is the latest installment in the Triple Play series of baseball games produced by Electronic Arts. It follows Triple Play 2001 as part of the continuing Triple Play series of games.</p><p>Triple Play 2002 expands on its predecessors with updated player graphics, including 3D face scans of some major league players, and updated major league ballpark graphics. Gameplay modes include single game, season, and home run derby (but no franchise mode). Triple Play 2002 features voice commentary from familiar sports personalities Bob Costas and Harold Reynolds. Triple Play 2002, like its predecessors, also includes the ability to customize your game by creating your own teams and players to use along side the 2001/2002 Major League rosters.</p>"},{"name":"Trivial Pursuit: Unhinged","year":2004,"developer":"Artech Digital Entertainment, Ltd.","url":"microsoft_xbox_t_part2/Trivial%20Pursuit%20-%20Unhinged%20%28USA%29.zip","filesize":6452054142,"score":5.9,"genres":"Puzzle > Diagonal-down > Top-down > Isometric > Board game > Game show / trivia / quiz > Licensed","desc":"<p>Welcome to Trivial Pursuit with a twist!  Play Trivial Pursuit in one of three ways with 1-6 friends either with you or online through GameSpy (PC) or your console's online system.</p><p>Choose to play in Classic, Unhinged, or Flash.  The classic game is just that, the standard Trivial Pursuit game.  </p><p>Unhinged adds two additional features: special spaces (50/50 chance, teleport, board rotate, etc) and betting.  With betting, you can choose whether your opponent will answer correctly or incorrectly and bet 1-2 points.  These points can allow you to gain the ability to roll again if you don't like your roll.</p><p>Flash mode is for those who want a quick game.  There are 5 levels of the board.  You start on the first level and have a choice of 2 spaces.  Answer correctly and move up a level for another 2 spaces to choose from.  The first to the top wins.</p><p>Questions are asked from the 6 different categories depending on what space you are on.  Each question has a multiple choice selection of 4 possible answers to choose from.  The only exception is with the 50/50 spaces in Unhinged mode where there are only 2 possible answers to choose from.  The questions are read by famous people like Bill Nye the Science Guy and Whoopi Goldberg.  Every now and then, they will throw in other information relating to (or not) the question either before you answer, or after you answer.  They may also make comments about your inability to answer a question correctly.</p>"},{"name":"TRON 2.0","year":2004,"developer":"Monolith Productions, Inc.","url":"microsoft_xbox_t_part2/Tron%202.0%20-%20Killer%20App%20%28USA%2C%20Europe%29.zip","filesize":5838534474,"score":8.1,"genres":"Action > 1st-person > RPG elements > Shooter > Cyberpunk / dark sci-fi > Sci-fi / futuristic > Licensed","desc":"<p>Alan Bradley once helped a computer genius named Kevin Flynn to defeat an evil artificial intelligence with the help of a security program called Tron. Twenty years later, Bradley has reached a new high point in his career: he succeeded in digitizing a human being into the computer and stored the secret of this technique in the Ma3a program. However, the powerful Future Control Industries (fCon) has gained access to this groundbreaking invention, and digitized hackers with the intention of dominating the computer network from within. Alan Bradley is kidnapped, and his son Jet, a computer game programmer, enters the world inside the computer, searching for answers.</p><p><em>TRON 2.0</em> is based on the events of the CG rendered 1982 film TRON, and has been conceived as a sequel to it. The game is a first-person shooter with light role-playing elements. As Jet Bradley, the player must battle digital opponents using guns, rods, grenades, missiles, and the iconic TRON disc. The named of locations and opponents resemble those of programs and other computer-related terms, sometimes with a humorous intention. Using most weapons, as well as acquiring (\"downloading\") various kinds of items depletes the player character's energy bar. Energy and health can be replenished at special terminals or gained in small amounts by defeating enemies. </p><p>The RPG elements appear in form of special items that can be collected and leveling up the player character, allowing the player to upgrade his parameters. The protagonist's level (\"version\") increases when a sufficient amount of so-called \"build notes\" has been collected. The player is free to increase any of the protagonist's five main attributes when leveling up. In addition, various \"sub-routines\" belonging to three classes - combat, defense, and utility - can be found and equipped. These may grant the main character special abilities, new weapons, or combat modifications. Each sub-routine can also be upgraded.</p><p>Players can race against each other in multiplayer light cycle races, designed by Syd Mead, the film’s concept and original light cycle designer. The game has unusual visuals, representing the inside of a computer program (stylized after the movie). It includes the voice acting of many actors and actresses who were part of the original movie cast.</p>"},{"name":"True Crime: New York City","year":2005,"developer":"Z-Axis, Ltd.","url":"microsoft_xbox_t_part2/True%20Crime%20-%20New%20York%20City%20%28Europe%29.zip","filesize":5972326781,"score":6.5,"genres":"Action > Behind view > Shooter > Direct control > North America > Crime > Regional differences","desc":"<p>Marcus Reed is a gangster turned cop who is out to clean the streets of New York.  Marcus joins the Organized Crime Division of the NYPD with the intent to rid the city of crime and violence.  Hoping to make a name for himself after his mentor is shot down, Marcus goes after the top crime syndicates of the city.</p><p>Besides having to do this, Marcus is a street-level cop.  He is responsible for anything from stopping street fights to stopping gang wars to defusing bombs!  Not only this, he can frisk people on the street for contraband, can do trunk searches on cars, as well as issue tickets to speeders.</p><p>But if Marcus is gonna do all those things, he's gonna do it his way.  Need some cash?  Marcus isn't opposed to a bit of extortion from the local pharmacy.  Need some way to stabilize your career after that rampage last week?  Plant some evidence on a guy and bring him in.  No one will know.  Pistols not cutting it for you?  The gun stores sell police officers anything, from M4s to flamethrowers to RPGs.</p><p>With the city of New York at your fingertips, and nearly every building accessible to you, how will you rule?  Will you be a shining beacon of morals, or a shady figure in the underworld of NY.  The choice is up to you.</p>"},{"name":"True Crime: Streets of LA","year":2003,"developer":"Luxoflux Corp.","url":"microsoft_xbox_t_part2/True%20Crime%20-%20Streets%20of%20LA%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5969193427,"score":6.9,"genres":"Action > Racing / Driving > Behind view > Fighting > Sandbox / open world > Shooter","desc":"<p>Nick Kang is a young Chinese-American detective who has been suspended from the Los Angeles Police Department due to his extreme methods of policing and his ability to cause massive amounts of damage to property. However, Wanda Parks, the Chief of the E.O.D (Elite Operations Division), requires Nick's assistance in a case that involves attacks on various venues in the Chinatown district. At first Nick is reluctant to help, preferring the vigilante life and focusing on avenging his father's death. However, he eventually agrees to conduct the investigation, on one condition: he must do it his way.</p><p><em>True Crime: Streets of LA</em> is a free-roaming driving and action game similar in concept to Grand Theft Auto III. The game's structure is mission-based; most of the missions are dictated by the story and initiate following a cutscene that advances it. Failing a mission still allows the player to continue playing through the chapter and undertake subsequent missions; in some cases this will lead to branching paths and optional missions. However, in order to complete the whole chapter the player must eventually succeed in all the main missions.</p><p>Nick can hijack any car on the street (usually with little to no repercussions) and freely drive through the 240 square miles of Los Angeles. Nick is capable of firing his weapon when driving; in an open top vehicle, it is possible to aim anywhere. The player can also opt for exploring the city on foot. Nick will be frequently contacted by other police officers and informed about various street crimes. He can then fight perpetrators, arrest them, knock them unconscious, or kill them to deal with these crimes.</p><p>The gameplay during the missions is separated into third-person shooting, fighting, and (more rarely) stealth sequences. All of these usually take place in relatively small, restricted environments. The shooting sequences involve Nick dealing with waves of enemies that appear in different places. Nick must react quickly, moving, crouching, or diving (with a \"bullet time\" effect) to avoid enemy attacks. A limited amount of painkillers can be found in such stages.</p><p>During the fighting sequences, Nick utilizes his martial arts techniques to defeat enemies in hand-to-hand combat. Nick can punch, kick, grapple and throw enemies. The player can execute combos by pressing various combinations of buttons consecutively. It is also possible to pick up primitive melee weapons lying around, or take them from enemies. Both shooting and fighting stages have destructible environments.</p><p>Stealth missions typically involve Nick traversing a hostile area without attracting the enemies' attention; the mission is failed if an enemy hasn't been dealt with silently, or shortly after he has discovered Nick. The player has the option of killing enemies or knocking them down; the latter awards the protagonist \"good cop\" points. Conversely, \"bad cop\" points are given to Nick for killing innocents or surrendered criminals. Depending on Nick's rating in these categories, the storyline branches during later chapters, leading to different endings.</p>"},{"name":"Turok: Evolution","year":2002,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_t_part2/Turok%20-%20Evolution%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":5819235098,"score":6.2,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic > Regional differences","desc":"<p>In this prequel to the previous Turok games, you are Tal'Set, the saviour of natives of the River Village in the Lost Lands, who must confront the evil Lord Tyrannus, leader of the reptilian hordes. Tyrannus is bent on a \"Holy Mission\" to purify the Lost Land through slaughter and misery.</p><p>During the fight with your nemesis Captain Tobias Bruckner in 1886 Texas, you were injured and sucked in to the Lost Lands. After recovering in the village, you discover that Tyrannus appoints a new general to his armies –Bruckner. So you begin the war in a land of lush jungles, suspended cities, mysterious temples, reptile armies, and towering dinosaurs.</p><p>In the game you can also fly a fully-armed winged Quetzalcoatlus, use the destructible environment – such as trees and massive rocks – to help your weapons, and order your troops to take cover, establish strategic positions, and even surrender.</p>"},{"name":"TY the Tasmanian Tiger","year":2002,"developer":"Krome Studios Pty Ltd.","url":"microsoft_xbox_t_part2/TY%20the%20Tasmanian%20Tiger%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6590257561,"score":6.5,"genres":"Action > Behind view > Platform > Direct control > Fantasy > Oceania","desc":"<p><em>Ty the Tasmanian Tiger</em> is a 3D character action game set in the Australian outback. The player assumes the role of Ty the Tasmanian Tiger and sets out to defeat the evil boss Cass (a Cassowary bird hating mammals) who is after five magical talismans.</p><p>Gameplay includes mostly platforming. Ty can also swim and dive underwater and ride a giant hog. Along the way the player will rescue friends, collect opals and defeat bad guys with boomerangs and a nasty set of chompers.</p>"},{"name":"TY the Tasmanian Tiger 2 - Bush Rescue","year":2004,"developer":"Krome Studios Pty Ltd.","url":"microsoft_xbox_t_part2/TY%20the%20Tasmanian%20Tiger%202%20-%20Bush%20Rescue%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6296953886,"score":7,"genres":"Action > Racing / Driving > 3rd-person (Other) > Platform > Helicopter > Mecha / giant robot > Oceania","desc":"<p><em>TY the Tasmanian Tiger 2</em> is a 3D Platformer with an Australian theme. The player takes the role of TY, a Tasmanian tiger, armed with sharp teeth and boomerangs a-plenty. On TY's quest to defeat the evil Boss Cass and his army of cold-blooded Frilled Lizards, he must assist the colorful residents of Burramudgee Town and the Southern Rivers, who include a tree frog, a lyre bird, a platypus family, some kangaroos and more koalas than you can shake a didgeridoo at.</p><p>While most of the game is standard platform fare, there are some diversions. Notably, there are a number of cart racing tracks which can be played with a friend. Additionally, there are missions that will place the player in giant robots, each with a different speciality (one is good at battle, one can put out fires, one is a submarine, etc.).</p><p>There are many comedic quirks, having the players throw electrified boomerangs at robotic dinosaurs in the Outback, then send them up in a helicopter to rescue sheep stranded by a flood, then have them clear a road following a traffic accident. And finally, to top it all off, the save/continue points are outhouses.</p>"},{"name":"TY the Tasmanian Tiger 3 - Night of the Quinkan","year":2005,"developer":"Krome Studios Pty Ltd.","url":"microsoft_xbox_t_part2/TY%20the%20Tasmanian%20Tiger%20-%20Night%20of%20the%20Quinkan%20%28USA%2C%20Australia%29.zip","filesize":6298717528,"score":6.8,"genres":"Action > Racing / Driving > 3rd-person (Other) > Arcade > Platform > Puzzle elements > Flight / aviation > Mecha / giant robot > Oceania","desc":"<p>After helping the Bunyup Elder by ridding the Dreamtime of the dangerous Quinkan, Ty heads for home. However, something goes wrong, and Ty winds up six months in the future! The Quinkan have invaded Southern Rivers, and even worse, the Bush Rescue team from the previous game has disbanded during Ty's absence! It's up to Ty to reunite his team members, as well as stop the Quinkan from unleashing the mysterious Quinking, an evil being of supreme power.</p><p><em>Night of the Quinkan</em> is the third game in the Ty series. As Ty, players can bite at foes, or use his boomerangs for consecutive ranged attacks. Boomerangs can be customized in an assortment of ways: either by changing the chassis (each chassis has its own special abilities); or by equipping special Bunyip Stones to the boomerang's chassis. Some stones can be combined with others, allowing players to customize their attacks to their liking. Some stones are rewards for completing tasks; others, as well as boomerang chassis, can be purchased from the Rang Shop in exchange for Opals, the game's currency.</p><p>Ty 3 again rolls out the robotic mechs - choose from the Shadow or Extreme Bunyip (your standard mech), the Crabmersible (a submarine shaped like a crab, oddly enough), or the Gunyip (a speedy airplane with an assortment of bombs and guns). Ty can even take part in cart races against other characters for powerups and even more opals.</p>"}]