[{"name":"UEFA Champions League 2004-2005","year":2005,"developer":"Electronic Arts Canada","url":"microsoft_xbox_u/UEFA%20Champions%20League%202004-2005%20%28Europe%29.zip","filesize":6635193746,"score":7.3,"genres":"Sports > Football (European) / Soccer > Licensed","desc":"<p>After many years under Eidos/Silicon Dreams ownership and development, EA releases the official Champions League game for the 2004/2005 season. </p><p>The last rehash of the engine debuted on <em>FIFA 2003</em>, it draws most of it's gameplay elements from the <em>2005</em> edition, but with some changes to gameplay such as a slightly more aggressive AI on attack (reducing the need to constantly push players forward using the <em>Off The Ball</em> controls, still present), new refereeing aspects such as some deliberate errors (as in occasional bad offside calls or throw-ins, not cheating the player through mistakes), advantage rule and handballs and a new set piece system, which replaces the much criticized \"targeting\" and \"push and shove\" featured in 2005. This system is much less rigid and less formulaic, as a directional arrow and powerbars define how balls are crossed and there are four player movement setups, thus making each corner and indirect free kicks different. For direct free kicks, players have the option to take driven or curved shots or drop a pass to a nearby player to explore a gap in the defense. All options are available at all times, instead of being determined by the distance to goal. Many of these changes were later adapted into the new <em>FIFA 06</em> engine, and it was also chosen as the match engine for subsequent Bright Future's <em>FIFA Manager</em>. </p><p>The presentation takes notes from real television broadcasts, with goals, fouls and attempts on goal being recapped not only in the full-time highlight reel but also during game stoppages and PiP popups. As the game is presented in a faux letterboxed format, next to the scoreline some statistics occasionally popup, allowing to keep track of them for some missions. A very requested feature, the ability to see the energy bars of the closest players to the ball of both teams, was finally included, as well as icons for the special abilities (speed, shooting, dribbling or tackling) of the best players.</p><p>The Champions League, where the player leads one team to the Final in the Atatürk Olympic Stadium in Istanbul, in the quest to succeed FC Porto as European Champions, is one of the available modes, but not the most important. That honour goes to the \"The Season\" mode, where the player starts by creating his managing avatar, and then proceeds to a a series of 50 missions, with the first being a close last-week match against a Champions League spot rival, proceeding with a buyout of the club and increased expectations, and (hopefully) closing with the Champions League final. This mode also allows players to unlock additional features such as balls, a stadium and special exhibition modes by fulfilling objectives set by the club president during the season, some of them crucial matches (which can result in a sacking if failed), others simply a matter of balancing the squad. Other modes include the usual friendlies, \"home and away\" (a two-legged friendly), scenarios (where the player can create situations such as a defending a 1-0 nil for 45 minutes while two man down) and practice.</p>"},{"name":"UEFA Euro 2004 Portugal","year":2004,"developer":"Electronic Arts Canada","url":"microsoft_xbox_u/UEFA%20Euro%202004%20-%20Portugal%20%28Europe%29.zip","filesize":6270167305,"score":7.3,"genres":"Sports > Diagonal-down > Direct control > Football (European) / Soccer > Europe > Licensed","desc":"<p>As a tie-in with the European soccer championship, held in Portugal on June 2004, EA Canada created this spin-off of the FIFA Soccer series. With a full license, players can choose any from the 51 nations and duke it out in friendly matches, or follow the path to the championship's final through the qualifying stages, group stages and eventually the play-off. You can also create your own dream team with players from different nations.</p><p>Other highlights includes a new bag of tricks, different weather types, a system to track injuries and suspensions and a dynamic morale system that fluctuates based on individual and team performances. There are also TV-style replays, crowd chants, national anthems and trophy celebrations.</p>"},{"name":"Ultimate Beach Soccer","year":2003,"developer":"Power and Magic Development","url":"microsoft_xbox_u/Ultimate%20Beach%20Soccer%20%28USA%29.zip","filesize":6817583262,"score":6,"genres":"Sports > 3rd-person (Other) > Football (European) / Soccer > Licensed","desc":"<p><em>Ultimate Beach Soccer</em> is a game endorsed by the PBS Limited.</p><p>The game features up to six modes : friendly, arcade, Pro Beach Soccer Tour, Tournament, Championship and Training modes. You will have the choice to play in Bangkok, Rio de Janeiro, Marseille or Venice Beach. You can also have the choice to listen to audio commentaries in English, Thai, French or Portuguese languages. At last, you can play up to two players at the same time, in solo or cooperative modes.</p><p>Since 2000, the Beach Soccer Wordwide organization (BSWW) has links with the FIFA Fair Play Campaign so we can see up to 32 official national teams, with some of their real stars such as Eric Cantonna or Pascal Olmeta for France, Ramiro Figueiras Amarelle or Valeiro Mato Roberto, both for Spain.</p>"},{"name":"Ultimate Fighting Championship: Tapout","year":2002,"developer":"Dream Factory Co., Ltd.","url":"microsoft_xbox_u/UFC%20-%20Ultimate%20Fighting%20Championship%20-%20Tapout%20%28Europe%29.zip","filesize":6478526055,"score":7.2,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p>UFC Tapout is based on the UFC, or the Ultimate Fighting Championship.  The game places you in the position as a real-world fighter, utilizing various fighting styles, such as Freestyle, Wrestling, Kickboxing, Ju Jitsu, etc.</p><p>Each fighter has a variety of real-life moves, in different categories.  There are punches, kicks, grapples and takedowns.  There are also ways of making your opponent submit, or \"tapout\", to gain a victory.</p><p>You have the ability to perform combos, but these combos are realistic; you can perform a 1-2-3-4 punch combo, or a punch-punch-kick, or any variation of those.</p><p>There are over twenty five fighters in the game, each one based off of real-life UFC fighters.</p><p>UFC: Tapout is complete with fighter entrances and authentic voices.</p>"},{"name":"Ultimate Fighting Championship: Tapout 2","year":2003,"developer":"Dream Factory Co., Ltd.","url":"microsoft_xbox_u/UFC%20-%20Ultimate%20Fighting%20Championship%20-%20Tapout%202%20%28USA%29.zip","filesize":6313455391,"score":6.6,"genres":"Action > Sports > 3rd-person (Other) > Fighting > Boxing > Wrestling > Licensed","desc":"<p>An update from the previous UFC game, Ultimate Fighting Championship: Tapout, this one still features the same type of attacks and combos as it's predecessor. It features a different publisher than the last one and has revamped animation models to give it a more life-like feel. There are 35 real UFC fighters to choose from or players can create their own fighter in the career mode.</p>"},{"name":"Ultimate Spider-Man","year":2005,"developer":"Treyarch Corporation","url":"microsoft_xbox_u/Ultimate%20Spider-Man%20%28Europe%29.zip","filesize":6539677513,"score":7.6,"genres":"Action > Behind view > Sci-fi / futuristic > Licensed","desc":"<p>When 15-year-old Peter Parker was bitten by a genetically altered spider he became faster, stronger, more agile and gained the spider-like ability to cling to walls.  Add web shooters and a costume and Peter becomes Spider-Man.  Eddie Brock, Jr. is Peter’s childhood friend.  In search of his scientist father’s legacy, Eddie came in contact with a symbiotic suit which transformed him into the monstrous Venom.  Ultimate Spider-Man follows both their Brian Michael Bendis-scripted adventures, as Spidey attempts to prevent Venom from killing innocents while Venom seeks to avoid S.H.I.E.L.D.’s machinations.</p><p>The Ultimate version of the Spider-Man mythos revamps the franchise, bringing in edgier (and often younger) versions of famous superheroes and supervillains.  The Human Torch, Wolverine, Electro, and Green Goblin are some of the Ultimate characters who make appearances.  Ultimate Spider-Man features a fully rendered, cel-shaded Manhattan open to exploration.  </p><p>With few exceptions, Spider-Man and Venom can explore Manhattan and Queens, climbing, jumping, and web swinging away.  Story missions show up as hot spots on the map as do other in-game objectives.  When the player is done patrolling (or destroying) the city, they can hit these hot spots to advance the story.  Between story missions, Spider-Man and Venom can follow race paths, go on combat tours, discover and collect hidden icons, and help (or hurt) the citizens of New York.</p>"},{"name":"Ultra Bust-a-Move","year":2004,"developer":"Taito Corporation","url":"microsoft_xbox_u/Ultra%20Bust-A-Move%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6861178268,"score":"","genres":"Puzzle > Side view > Real-time > Tile matching puzzle","desc":"<p>The famous, bubble-bursting franchise is back as Ultra Bust-A-Move makes its Xbox Live debut! Pop matching colored bubbles to solve puzzles in a variety of game types including head-to-head play. * Be the best in the world: Xbox Live enable online play with global rankings * Voice and Friends List support * Over 1,000 addictive game boards * Five new game types including: See-Saw, Blind & Count Puzzles * Challenging fun for casual puzzle fans to hardcore gamers</p>"},{"name":"Unreal Championship","year":2002,"developer":"Epic Games, Inc.","url":"microsoft_xbox_u/Unreal%20Championship%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6775203959,"score":7.9,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p><em>Unreal Championship</em> is a first-person-shooter game, that has similarities to the PC game Unreal Tournament 2003.</p><p>UC can be played as a single player campaign or a multiplayer game. In single player, you can fight solo against different and varying enemies, or you can lead a team in team-based games, like Capture the Flag and Bombing Run. In multiplayer mode, you can play with up to four players on a single Xbox, or go online via Xbox <em>Live</em> to play with up to fifteen other people.</p><p>There are five game modes; Deathmatch, which is your standard free for all, kill everyone; Capture The Flag, in which two teams fight to capture their enemies flag, then return it to theirs to score; Bombing Run, which is somewhat like soccer, where two teams have to take a ball and shoot it through a ring to score; Domination, where you must capture and hold three separate control points for a set time to score; and Survival, which is a last man standing kind of game, where the last person alive wins.</p><p>Weapons include the pulse rifle, rocket launcher, telefragger, and lightning gun, which can zap and hurt multiple enemies with one chain attack.</p><p>On Live, you can talk trash or compliment others, download additional content, join an online clan, and view an interactive, constantly updating scoreboard.</p>"},{"name":"Unreal Championship 2: The Liandri Conflict","year":2005,"developer":"Epic Games, Inc.","url":"microsoft_xbox_u/Unreal%20Championship%202%20-%20The%20Liandri%20Conflict%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6324145884,"score":7.7,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p><em>Unreal Championship 2: The Liandri Conflict</em> is the sequel to the Xbox Live game Unreal Championship, and was designed from the ground up for Xbox, and the Xbox Live service.</p><p>The game features 14 different characters and includes an expanded single player mode, enhanced mobility, and expanded upon combo system. The game also adds melee combat, by giving each character the possibility to switch to their respective weapon (e.g. blade, staff).</p>"},{"name":"Unreal II: The Awakening","year":2004,"developer":"Legend Entertainment Company","url":"microsoft_xbox_u/Unreal%20II%20-%20The%20Awakening%20%28Europe%29%20%28En%2CFr%2CEs%2CIt%29.zip","filesize":5991563400,"score":7.2,"genres":"Action > 1st-person > Shooter > Direct control > Sci-fi / futuristic > Regional differences","desc":"<p>Some years after the Strider Wars, humanity has resumed its expansion into space. On the rough frontier, it falls to the Terran Colonial Authority to maintain peace and order among the outlying colonies and outposts. TCA Marshal John Dalton and the crew of his ship, the <em>Atlantis</em>, patrol this dangerous sector of space when several distress calls lead to the discovery of alien artifacts with unique properties. Soon, the hunt for these artifacts is on between several alien factions as well as human corporations and their mercenary forces, with the TCA and their allies caught in the middle.</p><p>The first-person shooter <em>Unreal II</em>, while a sequel to Unreal, has no direct connection to the first game except being set in the same universe (with the Skaarj from <em>Unreal</em> and the Liandri Corporation from <em>Unreal Tournament</em> being major enemy factions). The player controls John Dalton through a dozen missions, taking place in such locations as the dense jungle of a tropical planet, a research facility on a frozen moon, the insides of a planet-sized living organism, the home world of an insectoid machine civilization, as well as a huge starship.</p><p>The weapon arsenal consists of more than a dozen guns. Standard types include pistols, an assault rifle, shotgun, and sniper rifle. Some heavier ones are a flame thrower, as well as rocket and grenade launchers, with the grenade launcher being able to use six different ammunition types, including fragmentation, EMP and smoke grenades. Available in later missions are weapons adapted from alien technologies. These include various energy guns, a biological weapon that creates living spiders that attack enemies, and an autonomous floating orb that either seeks out and attacks enemies or circles around the player in point defense. As in other Unreal titles, each weapon has two different firing modes.</p><p>Missions are usually of the run-and-gun type, but there are exceptions. Several levels include defense assignments where either a position must be held for a certain time or a character be kept alive. These levels usually include additional tools such as energy barriers and automated turrets that can be placed by the player in any location. Sometimes, AI-controlled characters will be there to help out the player as well. In that case they can be given orders on which sector to defend or patrol, for example.</p><p>The story of the game is told through a variety of means: besides in-engine cutscenes, there is a lot of radio chatter during a mission; in fact, it's not unusual for mission objectives to completely change due to story developments. Between missions, Dalton can wander freely about the <em>Atlantis</em> and chat with his crew, going into their personal backstories as well as more details about the main plot.</p>"},{"name":"Urban Chaos: Riot Response","year":2006,"developer":"Rocksteady Studios Ltd","url":"microsoft_xbox_u/Urban%20Chaos%20-%20Riot%20Response%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6328100949,"score":7.4,"genres":"Action > 1st-person > Shooter","desc":"<p>In <em>Urban Chaos: Riot Response</em>, you play as Nick Mason, a member of a new anti-terrorist team named T-Zero. Terrorists and gang members have destroyed your city, and your goal is to bring order back to the city while destroying any terrorists and gang members you encounter. Since your enemies are armed to the teeth (usually with meat cleavers, Molotov cocktails, and sawed-off shotguns), you're equipped with a riot shield that can be used by holding the left trigger. It can absorb an infinite amount of projectiles, but you cannot shoot while you are using it. You can get the assistance of firefighters to put out fires, and medics to replenish your health.</p><p>Your weapons can be upgraded by earning medals during your missions. You can earn these medals by scoring headshots, arresting enemies with your taser (as opposed to killing them), collecting gang masks, etc. You can even unlock extra missions and weapons by arresting gang leaders at the end of each level, so that the police can interrogate him and find out the gang's next move.</p>"},{"name":"Urbz, The Sims in the City","year":2004,"developer":"Maxis Software Inc.","url":"microsoft_xbox_u/Urbz%2C%20The%20-%20Sims%20in%20the%20City%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CNl%2CSv%29.zip","filesize":6443793601,"score":7,"genres":"Simulation > 3rd-person (Other) > Real-time > Life / social simulation > Point and select > Contemporary","desc":"<p>The Urbz is a reworking of the Sims franchise for the console market.</p><p>The Sims have finally moved out of the suburbs and into the big city where reputation is the key to success.</p><p>Socialize with over sixty unique characters, work jobs in a Sims game for the first time, buy new clothes that are actually gameplay relevant (they affect whether how likely other characters are to like you), get tattoos and body piercings and own and decorate one of three unique apartments.</p>"}]