[{"name":"V-Rally 3","year":2003,"developer":"Eden Studios","url":"microsoft_xbox_v/V-Rally%203%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5321263986,"score":7.3,"genres":"Racing / Driving > 1st-person > Behind view > Automobile > Off-roading > Track racing > Vehicle simulator","desc":"<p>The rally racing series is back, with more drivers, cars and tracks than in the preceding games.</p><p>Players can choose from a variety of game modes including rally racing in V-Rally Mode, time runs in Time Attack mode or time limited challenge runs in Challenge Mode, the last two also being available for up two four players taking turns in multiplayer mode. But the main goal is to defeat every racer on the rally circuit and become champion. The better players are and the further they get the more cars and tracks can be unlocked. In all, there are 80 drivers (six being actual rally drivers), 48 tracks (across six countries), and 20 cars for players to beat and unlock. There are two titles to earn - the 1.6 liter 2WD championship, and the 2 liter 4WD championship.</p><p>Players can view the race from inside the car or behind it as they scream through snow, rain, fog, dirt, gravel and over jumps at different times of day and night as they try to become the best rally racer on the planet.</p>"},{"name":"Van Helsing","year":2004,"developer":"Saffire, Inc","url":"microsoft_xbox_v/Van%20Helsing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6201090574,"score":6.6,"genres":"Action > 3rd-person (Other) > Platform > Shooter > Fantasy > Steampunk > Horror > Licensed","desc":"<p>Take the role of Van Helsing, legendary monster hunter and fight through Transylvania towards Count Dracula. This is an action/adventure game where the player encounters monsters such as the Wolfman, the Frankenstein monster, Dr. Jekyl/Mr. Hyde, vampires, and many other terrifying creatures. Use an arsenal of weapons and skills to destroy these monsters, including the unique grapple gun. This game takes the player to many of the places seen in the movie <em>Van Helsing</em> and features voice talent from many of the original actors including Hugh Jackman.</p>"},{"name":"Vexx","year":2003,"developer":"Acclaim Studios Austin","url":"microsoft_xbox_v/Vexx%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%2CPt%29.zip","filesize":6298703266,"score":7,"genres":"Action > Behind view > Platform > Fantasy","desc":"<p>On the forsaken remains of the planet Astara, the villagers of Rockhaven lived difficult but peaceful lives, until the day the Shadowraith, Dark Yabu, and his minions swept down from the sky. With ferocity and ruthless efficiency, they descended upon the townfolk, enslaving them to work deep in the caves that surrounded their village. </p><p>Dark Yabu murdered the grandfather of the young Vexx, who managed to slip quietly aboard the enemy's windship. There, locked deep within Yabu's sanctum, was the last pair of Astani Battle-gauntlets. The gauntlets leapt onto Vexx's outstretched hands and bonded to his arms giving him special powers. Prepared to meet his destiny, Vexx embarks on a quest through volcanic islands, frozen citadels and giant castles to confront Dark Yabu, save his people and avenge the death of his grandfather.</p>"},{"name":"Vietcong: Purple Haze","year":2004,"developer":"Illusion Softworks, a.s.","url":"microsoft_xbox_v/Vietcong%20-%20Purple%20Haze%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6173098696,"score":6.3,"genres":"Action > Compilation > 1st-person > Shooter > Direct control > Asia > Cold War > Historical events > War","desc":"<p><em>Vietcong: Purple Haze</em> is a compilation pack that bundles the original Vietcong game alongside its expansion pack Vietcong: Fist Alpha. For the PlayStation 2 and Xbox version this is the first and only release of the game; the individual game and its expansion were not available separately.</p>"},{"name":"Virtual Pool: Tournament Edition","year":2005,"developer":"Celeris Inc.","url":"microsoft_xbox_v/Virtual%20Pool%20-%20Tournament%20Edition%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CIt%29.zip","filesize":6783032303,"score":"","genres":"Simulation > Sports > 1st-person > Pool / snooker","desc":"<p>Chalk Up!</p><p>The leader in video game billiards offers 18 different pool games on tables from chic Monte Carlo to a dusty biker bar. Shoot some stick with the most advanced pool physics ever experienced, as you bank, angle and put some English on the trickiest shots imaginable. Virtual Pool: Tournament Edition is the definitive 3D pool experience.</p><p>Multiple locations including a suburban garage, dusty biker bar and a beachside mansion * Play 18 different kinds of pool including 8-ball, 9-ball, Snooker and 1 & 3 Cushion Billiards * Easy to play - as quick as setting up a shot on a real pool table * Most accurate table and ball physics ever - balls roll, fly and bounce off the table * Choose from a library of artistic trick shots or set up your own to become a true shark</p>"},{"name":"Volvo: Drive For Life","year":2005,"developer":"Climax Action Limited","url":"microsoft_xbox_v/Volvo%20-%20Drive%20for%20Life%20%28USA%29.zip","filesize":6783986743,"score":"","genres":"Racing / Driving > Behind view > Automobile > Track racing > Vehicle simulator > Licensed","desc":"<p><em>Volvo: Drive For Life</em> lets players test drive the S40, S60R, and XC90 V8. First each car must be driven on a special test track that demonstrates a unique safety/control feature of each vehicle. Afterwards each car can be modified with a paint job, rims, and interior package and driven on a special track: a highway that winds along the beach and cliffs for the S40, a snowy mountain pass for the XC90 V8, and a race circuit for the S60R. Also included are crash test videos and promotional videos for each of the three cars.</p>"},{"name":"Voodoo Vince","year":2003,"developer":"Beep Industries","url":"microsoft_xbox_v/Voodoo%20Vince%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6266809864,"score":7.4,"genres":"Action > 3rd-person (Other) > Platform","desc":"<p><em>Voodoo Vince</em> casts the player as a voodoo doll named, what else, Vince. Vince's owner, Madame Charmaine, has been kidnapped by Kosmo the Inscrutiable because of her valuable zombie dust. During the kidnapping, a bunch of zombie dust spills, warping reality. As a one foot bag of straw, it's up to the player to rescue Madame Charmaine and keep the zombie dust out of Kosmo's hands.</p><p>Throughout the game the player will have to contend with a variety of bad guys, from alligators and bees to imps and demons. Players can use standard platforming attacks, like a spin and a head dive, but also have magic voodoo at their disposal. To use voodoo, the player hurts themself, thereby hurting their enemies. Players may pull out a big magnet that causes a debris of heavy metal objects to squash them, killing nearby enemies, or they can summon a UFO to attack them with laser blasts.</p><p>Each level is littered with different pickups that not only assist players but will allow them to reach 100% completion. Picking up skulls will add another voodoo icon, letting the player use more voodoo powers. Other items will extend the health bar or provide certain powerups.</p><p>Madame Charmaine needs you! Get to it!</p>"}]