[{"name":"Wakeboarding Unleashed featuring Shaun Murray","year":2003,"developer":"Shaba Games LLC","url":"microsoft_xbox_w/Wakeboarding%20Unleashed%20featuring%20Shaun%20Murray%20%28Europe%29.zip","filesize":6578084741,"score":7.9,"genres":"Sports > Behind view > Tricks / stunts > Wakeboarding > Licensed","desc":"<p>Wakeboarding is part of Activision's line of Extreme Sports titles. A rider (using a board that's like a combination of a surf board, body board and skateboard) is pulled along the water by rope at high speeds by the boat up front, and must pull of tricks either by jumping of jumps or using the wake left by the boat itself (hence the sport's name).</p><p><em>Unleashed</em> takes this sport and turns it upside down, allowing you to fly down water ways through well known locations around the world, pulling stunts off buildings or cliff faces. Other objectives are included that have you completing tasks and busting tricks in a unique way.</p><p>Multiplayer modes include one-on-one trick attack and horse, where both players compete against each other to pull off the best tricks. Co-operative mode has one player driving the boat while the other hangs on behind, with new challenges for the boat driver to complete as well as the rider.</p>"},{"name":"Wallace & Gromit in Project Zoo","year":2003,"developer":"Frontier Developments Ltd.","url":"microsoft_xbox_w/Wallace%20%26%20Gromit%20in%20Project%20Zoo%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6661534914,"score":6.1,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Licensed","desc":"<p>Inventor Wallace and his clever dog Gromit, characters in a series of Academy Award-winning Claymation short films, star in this video game adventure.</p><p>Project Zoo starts off one morning as Wallace and Gromit are preparing to visit their adopted friend, Archie the polar bear, in the local zoo.  As soon as they get to the zoo, they find that it's been closed!  What's worse, a villainous penguin named Feathers McGraw has taken Archie and hidden him deep within the zoo.  So, Wallace and Gromit set out to rescue him.</p><p>This game is an action-platform game, with many puzzles and side quests.  The player controls the long-suffering Gromit, and must cooperate with Wallace to complete tasks such as fixing machines or pulling switches. The main goal of each of the six levels is to free 3 trapped baby animals.  Doing so  opens up new areas and allows you to continue to the next area.  In addition, there are hidden bonus levels and coins to collect that unlock video clips from the animated shorts.</p>"},{"name":"Wallace & Gromit: The Curse of the Were-Rabbit","year":2005,"developer":"Frontier Developments Ltd.","url":"microsoft_xbox_w/Wallace%20%26%20Gromit%20-%20The%20Curse%20of%20the%20Were-Rabbit%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6433032516,"score":6.8,"genres":"Action > Behind view > Licensed","desc":"<p>A faithful game to film tie in of the hit animated duo Wallace and Gromit, based on the feature film released in 2005 and featuring all the plasticine characters in their full glory. Your job as Anti Pesto the pest control team of Wallace, Gromit and Hutch is to protect the prize winning vegetables from garden pests using the tailor made bun gun and other cracking contraptions. And to uncover the terrible truth about the Wererabbit that plagues Wallaby Gardens.</p>"},{"name":"WarPath","year":2006,"developer":"Digital Extremes Toronto","url":"microsoft_xbox_w/WarPath%20%28USA%29.zip","filesize":6631683280,"score":5.7,"genres":"Action > 1st-person > Shooter > Sci-fi / futuristic","desc":"<p><em>Warpath</em> is a budget-priced first-person shooter from the same people that developed Pariah. As such, the gameplay is very similar to that game. For instance, you can heal yourself with a portable healing tool, and run at speeds so fast that they blur your vision. The main difference between the two games is that the singleplayer game is multiplayer-oriented, similar to Unreal Tournament. There is a storyline, however. You can select from one of three races fighting for the control of a beautiful, resource-rich planet named Kaladi. The Ohm are a cyborg-like race that need the planet's resources to live. The House of Kovos are robots that want to take control of Kaladi because their religion says that they should. The Human Coalition is a group of homeless humans that are trying to find a home.</p><p>In the singleplayer game, each arena is connected by a turn-based, Risk-style minigame. There's a zone for each side of the war, each with five arenas, for a total of 15 arenas. When it's your turn, you can choose an arena to attack that's owned by either of the other two sides. When you attack, the other side will try to defend the arena. If you win, you take control of that arena. If you win an attack on certain arenas, you can unlock a new weapon in the game. If you have control of all 15 arenas, you get to play a surprise \"boss\" arena.</p><p><em>Warpath</em>'s weapons and healing tool are also upgradeable. In singleplayer, you get skill-based weapon upgrades between levels. In multiplayer, you upgrade weapons just like you did in <em>Pariah</em> -- pick up weapon energy cores from fallen enemies and upgrade your weapons during gameplay.</p>"},{"name":"Warriors, The","year":2005,"developer":"Rockstar Toronto","url":"microsoft_xbox_w/Warriors%2C%20The%20%28Europe%2C%20Australia%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5812765832,"score":8,"genres":"Action > 3rd-person (Other) > Beat 'em up / brawler > Crime > Licensed","desc":"<p>Based on the 1979 Paramount Pictures film of the same name and voiced by most of the original cast, <em>The Warriors</em> follows the career of a Coney Island street gang. Starting months before the events of the film, The Warriors expand and defend their Coney Island turf, while proving that they are heavy enough players to join The Riffs’ network. With a citywide rep, they can get invited to a major gang meeting where the future of New York street crime will be decided. </p><p>The game follows the nine lead members of The Warriors (with flashback missions showing how they came to The Warriors): leader Cleon, Swan, Ajax, Cowboy, Cochise, Snow, Fox, Rembrandt, and Vermin. During the game, the player will control each member, usually acting as a war chief and leading a squad of Warriors on a mission. Missions vary from simply wrecking another crew to completing a series of objectives while avoiding arrest or worse. </p><p>During missions, players can mug pedestrians, steal car radios, commit smash and grabs, tag walls or bomb other gangs’ burners, and load up on flash. Between each story based mission, The Warriors return to their Coney Island hangout where they can train to improve their stats, go out on patrol, review their accomplishments, replay levels, or enter into a series of quick-play combat matches. </p><p>The game plays like a squad-based brawler. Each Warrior has his own fighting style and much of the game environment can be weaponized. Fights are fast and often brutal, but stealth is also an option. Players can perform stealthy finishing moves and distract police or other gang members with thrown bottles. The game’s environments are fully 3D allowing Warriors to escape along the rooftops, hop over fences, or dash into shadowy areas.</p>"},{"name":"WCR: World Championship Rugby","year":2004,"developer":"Swordfish Studios Limited","url":"microsoft_xbox_w/WCR%20-%20World%20Championship%20Rugby%20%28Europe%29%20%28En%2CFr%29.zip","filesize":6430563092,"score":6.8,"genres":"Sports > Diagonal-down > 2D scrolling > Rugby > Licensed","desc":"<p><em>WCR: World Championship Rugby</em> is an action-oriented translation of the rugby sport. The player uses the gamepad or the keyboard to simulate various motion sequences, e.g. passing or kicking. Playing modes are single matches or a world cup championship using one of the 20 teams which participated in the 2003 World Cup. </p><p>The game also features most of the official rugby rules, the original names for the teams of England and Wales and commentary by Miles Harrison and Stuart Barnes.</p>"},{"name":"Whacked!","year":2002,"developer":"Presto Studios, Inc.","url":"microsoft_xbox_w/Whacked%21%20%28USA%2C%20Europe%29.zip","filesize":6336113900,"score":6.4,"genres":"Action > 3rd-person (Other) > Board game > Game show / trivia / quiz > Shooter","desc":"<p>Whacked! features fast and furious combat in which eight demented contestants are pitted against each other in the world's most irreverent and dangerous game show. When contestants take the stage, all hell breaks loose as free-for-all combat ensues. Contestants must use power-ups and zany weapons such as giant staplers and rubber ducky grenades to flatten their opponents to win a grand prize that's out of this world.</p>"},{"name":"Whiplash","year":2003,"developer":"Crystal Dynamics, Inc.","url":"microsoft_xbox_w/Whiplash%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5952439004,"score":6.9,"genres":"Action > 3rd-person (Other) > Platform > Puzzle elements > Sci-fi / futuristic","desc":"<p>Chained together and doomed for destruction, you must make your escape from the evil animal testing laboratory. As Spanx, the only weapon and tool you have is the indestructible Redmond</p><p>Dip Redmond in toxic waste to poison enemies, electro-charge him to zap attackers, fill him with helium to lift you to higher platforms.</p><p>Make your getaway, free other animals and sabotage the twisted corporation.</p>"},{"name":"Whiteout","year":2002,"developer":"Driver-Inter, Ltd.","url":"microsoft_xbox_w/Whiteout%20%28USA%29.zip","filesize":6675381302,"score":5.6,"genres":"Racing / Driving > 1st-person > 3rd-person (Other) > Snowmobile","desc":"<p>This is a snowmobile racing game. The game engine simulates the real physics of a sled on all kinds of surfaces such as snow, ice, mud and many others so the player has to pay attention to where and how to accelerate, break and turn in order to win a race. The AI engine uses a complicated model that simulates real human behaviors so that NPC opponents can fall asleep on fanfares or get reckless in a rage. Making different stunts is not the last tactic that might lead to the win.</p>"},{"name":"Wild Rings, The","year":2003,"developer":"Paon Corporation, Ltd.","url":"microsoft_xbox_w/Wild%20Rings%2C%20The%20%28Japan%29.zip","filesize":6673065394,"score":"","genres":"Action > Sports > 3rd-person (Other) > Real-time > Direct control > Boxing > Wrestling","desc":"<p><em>The Wild Rings</em> is a wrestling/martial arts game that combines professional wrestling with mixed martial arts, offering eleven different fighting styles, from various kinds of wrestling (including sumo) to judo, boxing, karate and kickboxing.</p><p>The game includes 100 fighters, many of which are modeled after real-life athletes. The pre-existing fighters can be edited and up to 50 additional ones can be created in a character editor. Exhibition matches allow one-on-one and tag team fights as well as a Battle Royale. Single and tag matches are also available in tournament and league modes, and the game's main career mode is Champions Road, which is a 30-fight ladder to claim the title.</p><p>In the ring, the controls allow for normal, running, grappling and ground attacks in three different strengths, as well as taunts. For each different fighting style there are also style-specific attacks and moves.</p>"},{"name":"WinBack 2: Project Poseidon","year":2006,"developer":"KOEI Co., Ltd.","url":"microsoft_xbox_w/WinBack%202%20-%20Project%20Poseidon%20%28USA%29.zip","filesize":6216051291,"score":5.8,"genres":"Action > 3rd-person (Other) > Shooter > Spy / espionage","desc":"<p>A third-person action game which centers around the exploits of a crisis response team. The three player characters, Craig Contrell, Nick Bruno, and Mia Cabrera, must shoot their way through 30 missions of hostage rescuing, drug cartel smashing, and world saving in a wide variety of offices, warehouses, mansions, and laboratories.</p><p>The most unique aspect of the game is its \"Route\" system. Each mission has two different characters, and is played through from both perspectives. During the first part each mission, a number of \"Assist\" points will happen where the player must assist the second character -- their performance here affects the playthrough of the second part of the mission, and doing well will reward you with cover fire or health bonuses later.</p><p>There is also a multiplayer mode for up to four players, featuring several game mode including deathmatch and sniper battles. Bots are available if you have fewer than four players.</p>"},{"name":"Wings of War","year":2004,"developer":"Silver Wish Games","url":"microsoft_xbox_w/Wings%20of%20War%20%28USA%29.zip","filesize":6685859402,"score":6.8,"genres":"Action > 1st-person > Behind view > Flight / aviation > Historical events > World War I","desc":"<p><em>Wings of War</em> takes you back to World War I, as you take to the skies in a variety of early combat airplanes and fight off the German armada.</p><p>The game is played as a 3rd-person arcade flyer in which most physics are downplayed in favor of arcade action. You can collect power-ups that can upgrade your engine, the amount of machine-guns you carry, replenish your health and shield (yes, shield) and increase the number of bombs and rockets you carry. You can also swap planes in mid-air, man turrets in AI-controlled bombers and even ground vehicles.</p><p>The game features a single player campaign composed of several missions with dozens of mandatory objectives as well as optional ones played which reward extra points and/or upgrades. Also available is an online multiplayer mode with standard combat and CTF modes, as well as a customizable instant action mode.</p>"},{"name":"Without Warning","year":2005,"developer":"Circle Studio Limited","url":"microsoft_xbox_w/Without%20Warning%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5769037161,"score":4.9,"genres":"Action > 3rd-person (Other) > Puzzle elements > Shooter","desc":"<p>When terrorists invade a chemical plant and the employees are struggling to get out of the plant alive, a Navy SEALs team has come to rescue hostages and trapped employees, as well as killing terrorists and defusing bombs at the plant.</p><p>In <em>Without Warning</em> the player is able to control six different characters with overlapping storylines. Three of these characters are the SEALs that come to the plant. The other characters include a security guard and a secretary at the plant, as well as a news reporter whose chopper was shot down at the plant and wants to get a story of what is going on. The game mixes traditional run-'n-gun elements with puzzles such as unlocking doors and defusing bombs.</p>"},{"name":"World Championship Poker","year":2004,"developer":"Coresoft, Inc.","url":"microsoft_xbox_w/World%20Championship%20Poker%20%28USA%29.zip","filesize":6824233388,"score":6.1,"genres":"Gambling > Strategy > 3rd-person (Other) > Cards / tiles","desc":"<p><em>World Championship Poker</em> is a poker simulation featuring twelve types of poker (Texas Hold'em, Omaha, Pineapple, Crazy Pineapple, Tahoe, Double Flop Hold'em, Super Hold'em, Five-Card Draw, Seven-Card Stud, Triple Draw, Billabong Poker, and Shanghai). WCP supports both online and offline play. Online, you can play poker with random people, or your friends. Offline play includes a tutorial, Sit &amp; Go mode for a fast game or a more extensive Tournament mode.</p><p>In addition, the game features the ability to create your own custom character, by adjusting the appearance of various features. Both the players and the tables are completely in 3D. The games supports online multiplayer.</p>"},{"name":"World Championship Poker 2 featuring Howard Lederer","year":2005,"developer":"Point of View, Inc.","url":"microsoft_xbox_w/World%20Championship%20Poker%202%20featuring%20Howard%20Lederer%20%28USA%29.zip","filesize":6803923965,"score":7,"genres":"Gambling > Strategy > 1st-person > 3rd-person (Other) > Cards / tiles > Licensed","desc":"<p><em>World Championship Poker 2 Featuring Howard Lederer</em> is a poker simulation featuring fourteen types of poker, including Texas Hold'em, Five Card Draw, Seven Card Stud and Pineapple. WCP 2 supports both online and offline play. Online, you play poker with up to seven other players. Offline play includes Quick Play mode for a fast game or a more extensive Career mode where the players begins his career as a low ranking upstart living in their mothers basement. As the player advances in their career, they encounter real professional poker players, including Greg Raymer, Clonie Gowen, Amir Vahedi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke.</p><p>Using WiFi, you can use the PSP version to play against PS2 players. The PS2 version supports EyeToy to add your own likeness to the game. AI players have their own playing style, emotions and they react to the events. In-game commentary is provided by Matt Savage.</p>"},{"name":"World Championship Pool 2004","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_w/World%20Championship%20Pool%202004%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6102417567,"score":7,"genres":"Sports > Pool / snooker > Licensed","desc":"<p><em>World Championship Pool 2004</em> is a pool game similar to the World Championship Snooker series and working under the same engine.</p><p>Both single-player and multiplayer gameplay are available, with six different play modes to choose from. It is possible to compete against real-world pool players, or create custom players to take through the tournament. An aiming mode for beginners is available. Also included are off-beat bonus games such as Minefield.</p>"},{"name":"World Championship Snooker 2003","year":2003,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_w/World%20Championship%20Snooker%202003%20%28Europe%29.zip","filesize":6535775414,"score":7.2,"genres":"Sports > 1st-person > Top-down > Pool / snooker > Licensed","desc":"<p>The 2003 edition of the snooker series features more than 25 top professional players, including every world champion from the last 11 years. Players can create their own characters and compete in all the major tournaments in Career Mode, earning ranking points and unlocking new features as they progress. It is also possible to play 8 or 9-ball Pool, a Coaching Mode, several mini-games, and a Trickshot Challenge presented by John Virgo, who provides in-game commentary alongside Dennis Taylor.</p>"},{"name":"World Championship Snooker 2004","year":2004,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_w/World%20Championship%20Snooker%202004%20%28Europe%29.zip","filesize":6407465270,"score":7.5,"genres":"Sports > 1st-person > Top-down > Pool / snooker > Licensed","desc":"<p>This edition of Codemasters' official licensed snooker game includes over 30 snooker champions and 10 official tournaments.</p><p>The LG Tour is the campaign of the game in which you can make your own player and play against the best of the world to win the championship. To make it easy for beginners and as realistic as possible for those who want it, you can change how much help the program gives you while you play (i.e. a aim-meter). Also included is a tutorial which teaches you everything from the rules to the right angle for a shot. It is possible to make a free game where you get feedback for every shot you make.</p><p>Besides the campaign you can also play 8-Ball &amp; US-9-Ball Pool, trick-snooker, five bonus game-modes (e.g. Against the clock - play a frame with the clock ticking and only a limited amount of time for each shot) and the Classic Match mode, which allows you to play famous games from the history of snooker. </p><p>LAN or online gameplay against up to 16 players is included as well. The names of the best players appear in the hall of fame on the official website.</p>"},{"name":"World Poker Tour","year":2005,"developer":"Coresoft, Inc.","url":"microsoft_xbox_w/World%20Poker%20Tour%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6578314745,"score":6.5,"genres":"Strategy > 1st-person > Cards / tiles > Licensed","desc":"<p>Poker tournament game with six tour-exclusive casinos to choose from. Possibility to create custom poker games with editor or choose from 15 different community poker game types. You can either play against 1000 different AI characters or go on-line and battle other players.</p>"},{"name":"World Racing","year":2003,"developer":"Synetic GmbH","url":"microsoft_xbox_w/World%20Racing%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6274248735,"score":6.9,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Track racing","desc":"<p><em>World Racing</em> is a racing game developed in cooperation with DaimlerChrysler AG, allowing players to control various Mercedes-Benz cars.</p><p>The game features 117 different tracks throughout 7 large terrains (Nevada, Japan, Mexico, Australia, the Alps, the City, and the Test Centre). Players can drive more than 100 original Mercedes-Benz cars, including classic Silberpfeile and Mercedes-Benz SLR McLaren. Different mission types include Sport Runs, Training Sessions, Test Runs, Checkpoint Races, Endurance Contests and others.</p><p>Players can customize AI skill level and simulation precision (from arcade to real simulation). In dynamic AI skill mode computer opponents will adapt to the player's skill.</p>"},{"name":"World Racing 2","year":2005,"developer":"Synetic GmbH","url":"microsoft_xbox_w/World%20Racing%202%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6489262970,"score":6.6,"genres":"Racing / Driving > Simulation > 1st-person > Behind view > Automobile > Street racing > Vehicle simulator > Licensed","desc":"<p>Compared to its predecessor, where players could only drive different Mercedes Benz cars, this sequel allows them to control over 90 different cars from 17 different manufacturers, such as Alfa Romeo, Morgan, and others.</p><p>The core of the game is the career-mode with 120 races which take players all around the globe, from Italy to Florida, where players can earn their 'Speedbucks' to buy new cars and tuning options.</p><p>The game also features oncoming traffic and a detailed damage model including realistic driving physics. Players can also customize their cars with vinyls, alloy rims and many other extras.</p>"},{"name":"World Series Baseball","year":2002,"developer":"Visual Concepts Entertainment, Inc.","url":"microsoft_xbox_w/World%20Series%20Baseball%20%28USA%29.zip","filesize":6205384794,"score":7.9,"genres":"Sports > Baseball > Licensed","desc":"<p><em>World Series Baseball</em> makes its appearance for the 2003 season. This installment includes an in-depth franchise mode that allows players to manage their coaches and minor league teams, playing it for an unlimited number of seasons. In what has since almost become a standard for the series, Create-a-Player mode is present for players to make their own teams. </p><p>Also featured are Season, Exhibition, Home Run Derby and Playoffs modes. Little extras include saving the player's statistics to a user profile, and old-school players and uniforms. The game utilizes licenses from the MLBA, the MLB Players Choice, the National Baseball Hall of Fame, the Cooperstown Collection, and the 2002 World Series.</p>"},{"name":"World Series Baseball 2K3","year":2003,"developer":"Exile Interactive Inc.","url":"microsoft_xbox_w/World%20Series%20Baseball%202K3%20%28USA%29.zip","filesize":5943926310,"score":8.4,"genres":"Sports > 3rd-person (Other) > Diagonal-down > Direct control > Multiple units/characters control > Baseball > Licensed","desc":"<p><em>World Series Baseball 2K3</em> is a follow-up to World Series Baseball 2K2. This installment of the series includes several new features:</p><ul><li>The new ESPN broadcast license allows improved replay and cutscenes, adding further realism to the presentation of baseball</li><li>Hall of Fame legends join the complete list of MLB teams, players and coaches, along with retro and alternate uniforms for all teams.</li><li>Some of the classic ballparks from yesteryear are fully featured, including Crosley Field and Griffth Stadium.</li></ul><p>Other additions and enhancements include improved animations for players, a new jump button for outfield catches, a full list of MLB awards to win during the regular season and playoffs, and updated team lists including the latest rookies and trades made during the offseason.</p>"},{"name":"World Series of Poker","year":2005,"developer":"Left Field Productions, Inc.","url":"microsoft_xbox_w/World%20Series%20of%20Poker%20%28USA%2C%20Europe%29.zip","filesize":6864510087,"score":5.9,"genres":"Gambling > Strategy > 3rd-person (Other) > Top-down > Cards / tiles > Licensed","desc":"<p>The official game of the premier poker tournament, <em>World Series Of Poker</em> allows you to take on some of the greatest poker players in 26 different poker games, earn WSOP bracelets and earn a place in the \"WSOP Hall of Fame\".</p><p>During tournaments, you take part in several tables en route to the final table. Each table consists of 8 players that are automatically replenished with new players when numbers dwindle.Once the tournament is down to the last 16, you move onto the \"featured table\", and once down to the last 8, you move onto the final table, where the winner will be decided.</p><p>Several famous poker players make an appearance in game including Chris \"Jesus\" Ferguson, Men the Master and Jennifer Tilly.</p>"},{"name":"World Snooker Championship 2005","year":2005,"developer":"Blade Interactive Studios Ltd.","url":"microsoft_xbox_w/World%20Snooker%20Championship%202005%20%28Europe%29.zip","filesize":6364077090,"score":7.4,"genres":"Sports > 1st-person > 3rd-person (Other) > Pool / snooker > Licensed","desc":"<p><em>World Snooker Championship 2005</em> continues the World Championship Snooker series. Like its predecessors, it features professional players; this time the 100 top players from all over the world, such as Ronnie O'Sullivan, Stephen Hendry, Matthew Stevens and Paul Hunter. Authentic locations, including the Crucible Theatre, from the 2004/2005 season are represented in the game. There are multiple game modes to play with, including an unlockable League of Champions which allows you to replay past events. As a bonus you can also play Pool, Billiards and Bar Billiards. The game enables you to create your own character.</p><p>Commentary in the game is provided by Steve Davis, John Virgo and John Parrott.</p>"},{"name":"World Soccer: Winning Eleven 8 International","year":2004,"developer":"Konami Computer Entertainment Tokyo, Inc.","url":"microsoft_xbox_w/World%20Soccer%20Winning%20Eleven%208%20-%20International%20%28USA%29%20%28En%2CEs%29.zip","filesize":6668622324,"score":8.1,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer","desc":"<p>The new Pro Evolution Soccer has over 3000 licensed players,and Fully Licensed Leagues &amp; teams from Serie A (Italy), Liga Espanola (Spain), &amp; Eredivisie (Holland). So this new PES has definitely improved on the License front. There's also full leagues of  England, France &amp; Germany.  Also there is a revampedMaster League, and this time you don't have to start with them stupid rubbish Default players, you can start with the proper team!!!Still if you want a challenge you can choose to start the ML with the default players. Another thing you can create your very own team,and play against the world in the Master League, and you get toswap the Default players, for half-decent ones!It's not just the master league that's changed in the Edit mode,you get to edit or change the player's goal celebrations!Another feature is the PES Shop, you acquire points to unlock bonuses! </p>"},{"name":"World Soccer: Winning Eleven 9","year":2005,"developer":"Konami Digital Entertainment Co., Ltd.","url":"microsoft_xbox_w/World%20Soccer%20Winning%20Eleven%209%20%28USA%2C%20Asia%29%20%28En%2CEs%29.zip","filesize":6702936317,"score":8.3,"genres":"Sports > Diagonal-down > 2D scrolling > Managerial / business simulation > Direct control > Football (European) / Soccer > Regional differences","desc":"<p>Pro Evolution Soccer 5 pushes the franchise one level up towards realism by expanding and improving character moves and control. Now, the match feels more real to the actual play as players make mistakes more often and passes don't go too well if the player is on the wrong foot, or makes a bad turn. The new gameplay may require slight adjustment for players to switch from older versions to this one. The standard modes are here, match mode (with newly added memorial match), various leagues, and cups. Some more teams now have their proper names (like \"Arsenal\" and \"Chelsea\"), and are having up to date players in the teams. Also, new weather condition has been added, snow.</p>"},{"name":"World War II Combat: Iwo Jima","year":2006,"developer":"Direct Action Games","url":"microsoft_xbox_w/World%20War%20II%20Combat%20-%20Iwo%20Jima%20%28USA%29.zip","filesize":6689443220,"score":4.3,"genres":"Action > 1st-person > Shooter > World War II","desc":"<p><em>World War II Combat: Iwo Jima</em> is a follow-up to World War II Combat: Road to Berlin, sporting the same gameplay mechanics and budget price tag of its predecessor.</p><p>The gameplay is basically just like any other first-person shooter out there, but you can't pick up any weapons or health during a mission -- instead, your health recharges at the end of each mission and your weapons are automatically assigned for each mission.</p><p>The main difference between <em>Road to Berlin</em> and <em>Iwo Jima</em> is that you're now pitted against the Japanese instead of the Germans, as the only surviving member of a squad of Marines during the American conquest of the Japanese island Iwo Jima.</p>"},{"name":"World War II Combat: Road to Berlin","year":2006,"developer":"Direct Action Games","url":"microsoft_xbox_w/World%20War%20II%20Combat%20-%20Road%20to%20Berlin%20%28USA%29.zip","filesize":6717550055,"score":4.9,"genres":"Action > 1st-person > Shooter > World War II","desc":"<p>A follow-up to Combat: Task Force 121, <em>World War II Combat: Road to Berlin</em> shares the same basic mechanics and multiplayer functionality as its predecessor. You are Steven Moore, a young officer in the Office of Strategic Services attempting to secure research and plans for the top secret German \"Vengeance Weapons\" during the last days of the war. The Russians may be allies, but they also want this research for their own purposes - you must beat them to it. The single player game takes you through aircraft fields, submarine bunkers, underground complexes and finally the remains of a war torn Berlin.</p><p>As with its predecessor, the real value in this title is the multiplayer. Seven multiplayer modes, a good assortment of weapons, simple play mechanics and large maps make for a surprisingly good experience. This game also features online bots, which is a feature its predecessor lacked.</p>"},{"name":"Worms 3D","year":2003,"developer":"Team17 Software Limited","url":"microsoft_xbox_w/Worms%203D%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6724418189,"score":7.3,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p>As depicted very well by the title of the game, the infamous quarrelsome Worms are squirming for the first time in full 3D.The goal of the game hasn't changed a single bit from its predecessors: the objective is still to crush, annihilate and put into oblivion the worm team of the enemy using massively-wacky weapons of destruction. About all the features of its original 2D ancestors are also present, including random wind and a fully destructible landscape.</p><p>Not all the weapons that were previously available have made the cut into the 3 dimensional realm, however Worms 3D comes too with a selective set of new weaponry such as the Lottery Strike or the Gas Grenade which should allow you to find a few dozen of new ways to kill your fellow worms online.</p>"},{"name":"Worms 4: Mayhem","year":2005,"developer":"Team17 Software Limited","url":"microsoft_xbox_w/Worms%204%20-%20Mayhem%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6793916902,"score":7.3,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Comedy > War","desc":"<p><em>Worms 4: Mayhem</em> is a sequel to Worms 3D. Like its predecessor, it is a turn-based artillery variant with humorous themes and weapons, in which players control small armies of worms. The gameplay is similar to that of the previous game, adding a more developed Story mode, in which the player cooperates with the wise Professor Worminkle, who can use a time machine to travel to different time periods such as American Old West, ancient Arabia, and Prehistoric Age.</p><p>In this installment, players can customize the appearance of their worms, including helmets, glasses, facial hair, gloves, etc. A new mode called \"Weapon Factory\" has been added, allowing players to forge their own weapons. The game also contains a shop where players can purchase various items, using points accumulated by completing story missions or unlocking trophies. Shop items include new maps, accessories, outfits, character voices, etc.</p>"},{"name":"Worms Forts: Under Siege","year":2004,"developer":"Team17 Software Limited","url":"microsoft_xbox_w/Worms%20Forts%20-%20Under%20Siege%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6798853734,"score":6.4,"genres":"Strategy > 1st-person > Behind view > Top-down > Turn-based > Artillery > Direct control > Multiple units/characters control > Classical antiquity > Egypt (Ancient) > Japan (Ancient/Classical/Medieval) > Medieval > Comedy > War","desc":"<p><em>Worms Forts: Under Siege</em> is a turn-based strategy game where 2 – 4 people battle it out with a team of 4 worms with the help of weapons and forts. Each player takes timed turns bombing, shooting, causing natural and unnatural disasters, punching and blowing up the opponent’s worms. Each worm has a set amount of health and once that health is depleted or the worm drowns that worm is dead.</p><p>New to the series is the ability to construct buildings to aid in the fight. Build hospitals to resurrect dead worms, science labs to increase your firepower, strongholds to base your operations in and protect your worms, towers, keeps, castles and citadels to deploy weapons from their tops and weapon factories to produce multiple weapons around them at the start of each turn you take. Along with these typical buildings you can create Wonders which your opponent has two turns to knock down and if they don’t succeed you win. If they in turn build their own you must destroy it to win the game.</p><p>Along with the typical <em>Worms</em>-style weapons like the mini gun, bazooka, rocket launcher, earthquake and homing pigeon (a homing missile in the form of a pigeon), you will also have weapons to destroy buildings like the trebuchet, fridge launcher, nuclear strike and the Trojan Donkey (which you get to place where you like and it remains there until it explodes, how long it takes to explode is not known). Some weapons like the Old Women and Rhino can be steered to your desired location upon which they explode on contact, or they can be exploded early by pressing a button.</p><p>Throughout the game different crates will fall from the sky or teleport onto the playing field. There are four different types of crates: weapon crates (more powerful weapons); health crates (increase the health of a wounded or sick worm); utility crates, which carry instant utilities such as spy (see contents of all crates on the field), double time (doubling the time for your turn) and double damage (for one turn inflict double the damage); and collectible utilities like freeze (freeze your worms or buildings to protect them from damage for one turn), parachute (so your worm can safely jump from heights), jet pack (to reach distant locations and heights) and repair (to fix damaged buildings). </p><p>Single play allows for a quick game, tutorial, campaign, the trials (death match against the CPU) and the viewing gallery, which allows you to view movies you have unlocked in the game by winning matches, see how much of the game you have completed, check out the credits and look through the Fortapedia (a list of buildings available in the game and their descriptions).</p><p>As with the other <em>Worms</em> games, in multiplayer you have a plethora of options to choose from to set up a match against other people including allowing the CPU to play. Choose schemes (selection of pre-set weapons and game options), landscapes (the type of playing field – Roman, Egyptian, Samurai and Old World), Fortpot (a slot machine that randomly selects three game options from the many available), game settings (wins required, turn time, etc.), worm health and sudden death settings.</p>"},{"name":"Wrath Unleashed","year":2002,"developer":"The Collective, Inc.","url":"microsoft_xbox_w/Wrath%20Unleashed%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5893163234,"score":6.5,"genres":"Action > Strategy > Diagonal-down > Real-time > Turn-based > Arcade > Fighting > Fantasy","desc":"<p><em>Wrath Unleashed</em> is a strategy game with both turn-based and real-time components, as well as action-oriented battles, similar in concept to Archon: The Light and the Dark. The gods of the four Elements (Water, Fire, Earth, and Wind) inhabit an asteroid belt, the only remnant of their former world, which has been shattered to pieces. The gods are waging war on each other, each trying to reclaim the coveted throne of Gaia. Each of the gods represents an alignment: Light Order, Light Chaos, Dark Order, or Dark Chaos, ranging from the most benevolent to the most evil. Their armies consist of supernatural creatures. The player can choose to command any of the armies, taking it to victory through four campaign missions each.</p><p>In the game's campaign mode, the units are navigated in turn-based fashion over a board of hexagonal spaces, each representing a type of terrain. The main objectives of this strategic part of the game usually involve occupying the opposing army's temples or defeating specific enemies. When two opposing units meet on the same hexagonal space, a battle ensues. The battles take place on large arenas, and are a combination of real-time strategy and pure action. The player can take control of individual fighters and engage in direct arcade-like combat against the opponents.</p><p>Versus and team fighter modes are available, both removing all the strategic elements, retaining only the action battles. Also included is an editor that allows players to create and customize their own soldiers and units.</p>"},{"name":"Wreckless: The Yakuza Missions","year":2002,"developer":"Bunkasha Games","url":"microsoft_xbox_w/Wreckless%20-%20The%20Yakuza%20Missions%20%28Europe%29.zip","filesize":6203822365,"score":7.1,"genres":"Action > Racing / Driving > 1st-person > 3rd-person (Other)","desc":"<p><em>Wreckless: The Yakuza Missions</em> casts the player as either two members of the Hong Kong Police Force or as a pair of spies who must put a stop to the Yakuza (Japanese Mafia) stranglehold of Hong Kong. There are ten missions per side, for a total of twenty missions. Missions range from destroying cars to picking up documents to rescuing people.</p><p>The game sports a real-time damage modeling system, so cars will break apart depending on how much they are damaged. Hoods and doors will pop loose and fly off, glass will shatter and break, license plates will get knocked loose and swing from side to side before finally falling off. The environment can be damaged as well, with street carts falling to pieces and neon signs exploding into a shower of sparks. Each side starts with a default car, but both gain access to exclusive new rides as they complete missions or by finding and touching hidden cars during levels.</p>"},{"name":"WTA Tour Tennis","year":2002,"developer":"Konami Computer Entertainment Osaka Co., Ltd.","url":"microsoft_xbox_w/WTA%20Tour%20Tennis%20%28USA%29.zip","filesize":6615219602,"score":6.2,"genres":"Sports > Diagonal-down > Direct control > Tennis > Licensed","desc":"<p>Play with The Pros!<br>Serve up action with up to 4 players<br>Challenge the pros including Serena Williams, Martina Hingis and Jelena Dokic<br>Lifelike graphics with intuitive controls<br>Track your success with statistics on all aspects of your game<br>10 locations around the world<br>3 court surfaces affecting ball dynamics</p>"},{"name":"WWE Raw 2","year":2003,"developer":"Anchor, Inc.","url":"microsoft_xbox_w/WWE%20Raw%202%20%28Europe%29.zip","filesize":6442644447,"score":7,"genres":"Action > Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>WWE Raw 2</em> is a follow-up to WWF Raw. The game contains new modes, superstars, and an enhanced season mode. It features 64 WWE superstars, along with the ability to add 64 additional wrestlers of the player's own creation from the Create-a-Superstar mode.</p><p>New modes include Ladder Matches, Table Matches, Cage Matches, and \"Hell in a Cell.\" All of these modes can be played with up to five other CPU-controlled wrestlers (or three other human opponents).</p><p>The season mode allows the player to choose any superstar, be it a WWE star or a wrestler he has created, and play his way through a year's worth of WWE programming. Set traps, interfere with other matches, steal from other wrestlers, and encourage others in order to make it all the way to Wrestlemania.</p>"},{"name":"WWE WrestleMania 21","year":2005,"developer":"Studio Gigante","url":"microsoft_xbox_w/WWE%20WrestleMania%2021%20%28Europe%29.zip","filesize":6743203885,"score":5.9,"genres":"Sports > 3rd-person (Other) > Wrestling","desc":"<p><em>WWE WrestleMania 21</em> is the successor to WWE Raw 2. Based on the twenty-first annual WrestleMania professional wrestling pay-per-view produced by World Wrestling Entertainment (WWE), it lets players take control of over 40 superstars including Rey Mysterio, The Undertaker, Stone Cold Steve Austin, and many more. Online multiplayer games for up to four players are supported via Xbox Live. This is also the first wrestling game to feature a countering system that incorporates a specific reversal for each and every attacking move.</p><p>This game also has the Create-a-Wrestler feature, character evolution, and other customization options. It contains the Smackdown and Raw arena plus certain PPV arenas like SummerSlam. Certain match types include First Blood, Hell in the Cell, Hardcore, and others.</p>"},{"name":"WWF Raw","year":2002,"developer":"Anchor, Inc.","url":"microsoft_xbox_w/WWF%20Raw%20%28USA%29.zip","filesize":6205255122,"score":6.4,"genres":"Sports > 3rd-person (Other) > Wrestling > Licensed","desc":"<p><em>WWF Raw</em> is a wrestling game based on the television show of the game name, the flagship program of the World Wrestling Federation. The player can control any of the forty-five WWF superstars, including The Rock, Stone Cold Steve Austin, The Undertaker, Triple H, and others. The game features a tag team mode, in which four wrestlers can compete with each other. Also included is a superstar mode, which allows the player to create and customize an own wrestler, taking him through a series of matches on the way to the WWF crown. Many of the game's presentation details imitate those seen in the original show, such as introduction sequences for each wrestler, \"double replay\" feature, the ability to assault opponents and interfere with them on their way to the ring, etc.</p>"}]