[{"name":"X-Men: Legends","year":2004,"developer":"Raven Software Corporation","url":"microsoft_xbox_x/X-Men%20Legends%20%28World%29.zip","filesize":6676170582,"score":7.5,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Isometric > Action RPG > Cyberpunk / dark sci-fi > Licensed","desc":"<p>Shortly after teen Alison Crestmere begins to exhibit her mutant powers, she's hunted through the streets of New York City by anti-mutant troops and The Brotherhood. Rescued by the X-Men, Alison is taken to Professor Charles Xavier's School for the Gifted where she begins her quest to learn control over her lava-based powers.</p><p><em>X-Men: Legends</em> is a role-playing game set in the Marvel Universe. Offering single and multiplayer support, Legends tells the broad story of the war between mutants and humankind and the conflict between the X-Men and The Brotherhood, against the personal story of Alison and the role she plays.</p><p>Controlling a party of four X-Men, picked from a roster that grows to 15 mutants, players take on armed guards, evil mutants, and killer Sentinels. Mutant powers grow stronger as the X-Men level up, but so do the challenges: securing an aircraft carrier, preventing a nuclear power plant meltdown and more.</p>"},{"name":"X-Men: Legends II - Rise of Apocalypse","year":2005,"developer":"SuperVillain Studios, Inc.","url":"microsoft_xbox_x/X-Men%20Legends%20II%20-%20Rise%20of%20Apocalypse%20%28USA%2C%20Europe%29.zip","filesize":6717557835,"score":7.9,"genres":"Role-playing (RPG) > Diagonal-down > 2D scrolling > Action RPG > Cyberpunk / dark sci-fi > Licensed","desc":"<p>The mutants from the Brotherhood and the X-Men try to forget their differences since a common enemy has appeared - the dreaded Apocalypse. His plan involves kidnapping mutants, and, with the help of the mad geneticist Mr. Sinister, extract their powers and use them to make himself even more powerful. At first, the heroes must rescue Professor X, who has fallen into the clutches of the enemy. However, when Apocalypse kidnaps Magneto's son Quicksilver, the leader of the Brotherhood is determined more than ever to team up with his former foes and stop Apocalypse's evil plans.</p><p><em>X-Men: Legends II - Rise of Apocalypse</em> is an action role-playing game and a sequel to X-Men Legends. The player controls a party of four characters, though only one at a time can be controlled directly. Beside switching the characters for combat purposes, the player is often obliged to do so, because some of the tasks in the game require the specific abilities of a certain mutant. For example, Iceman can put out fire, Magneto can generate a metal bridge across a gap, etc.. Most of the time, however, is spent in combat, collecting loot and acquiring experience points. Unlike the first game, items dropped by enemies are random. The character will level up, become stronger, and learn new skills. The player can opt to allocate all the experience and skill points manually.</p><p>Each character has several different skills based on their mutant powers. These include melee, boost, projectile, traps, and others. Each character can also learn powerful super skill: for example, Cyclops has a super beam attack that can hit multiple targets; Wolverine has a spinning attack that inflicts heavy damage; Magneto has a metal attack, crushing everything in sight by manipulating metal objects in the environment, etc.</p><p>New in the sequel is on-line multiplayer with both co-operative and six competitive modes. Four players can play on a single console by plugging in additional controllers at any time.</p>"},{"name":"X-Men: Next Dimension","year":2002,"developer":"Paradox Development","url":"microsoft_xbox_x/X-Men%20-%20Next%20Dimension%20%28Europe%29.zip","filesize":6639210038,"score":6.7,"genres":"Action > Side view > 2D scrolling > Fighting > Direct control > Licensed","desc":"<p>A group of humanoids known as the Sentinels plan to to rid the world of mutants. The X-Men must ally with their greatest enemies in order to save their teammate - Forge. The mutants must save Forge before the Sentinels can coax secrets from him that are capable of destroying all mutant-kind.</p><p><em>X-Men: Next Dimension</em> is a fighting game in which the player can choose between up to twenty-four available characters. The game features an extensive combo system, including normal chains, air juggles, and air launchers. Beside the basic blocking system, characters have various counter-attacks available, specific to the type of attack the player is countering. In addition to standard attacks, the player can execute super attacks by pressing two punch or kick buttons simultaneously. These include blasts or beams, some of which can stun an opponent, as well as physical attacks that have special effects. There are several different types of super attacks, each having four different levels of power.</p><p>The stages are rendered in 3D; unlike in most fighting games, many stages consist of multiple screens. The player can choose to move between these screens; kicking the opponent out of the current screen also leads to a location change. </p><p>Most of the versions include the following modes:<em> </em>Story Mode* - the player follows a scripted mode; only several of the characters are available to control.</p><ul><li><em>Arcade Mode</em> - a one-player mode where the player fights against the AI in a series of ten matches.</li><li><em>Versus Mode</em> - a two-player game for one-on-one combat.</li><li><em>Survival Mode</em> - a one-player game where the player tests his skills against a never-ending series of enemies, achieving as many victories as possible with only one life bar.</li></ul><p>The GameCube version contains two exclusive modes, Team and Practice. The Xbox version features an extra stage and the ability to play as Pyro.</p>"},{"name":"X-Men: The Official Game","year":2006,"developer":"Z-Axis, Ltd.","url":"microsoft_xbox_x/X-Men%20-%20The%20Official%20Game%20%28USA%2C%20Europe%29.zip","filesize":6456339046,"score":6.1,"genres":"Action > Side view > 2D scrolling > Beat 'em up / brawler > Hack and slash > Flight / aviation > Licensed","desc":"<p><em>X-Men: The Official Game</em> acts as a story bridge between the second and third <em>X-Men</em> movies. In the game, the player takes control of Wolverine, Iceman and Nightcrawler, as they deal with the aftermath of the incident at Alkali Lake. The heroes return to Alkali Lake to recover two stolen Cerebro parts, and find out that an unknown organization is doing a salvage operation on the base. What they uncover reveals to be a threat to all mutants...</p><p>The three playable characters have distinct fighting abilities. Wolverine fights from a fixed third-person view; the player essentially has to \"button mash\" his way through hordes of soldiers and classic <em>X-Men</em> villains as Sabretooth and Lady Deathstrike. Iceman can fly; his abilities are widely used when he traverses the ice bridge to fly out and save places such as a nuclear power plant and the Statue of Liberty. As Nightcrawler, the player views the world from a free third-person perspective; he possesses a teleportation ability, which allows him to drop on his enemies while getting the missing Cerebro parts and saving the Brooklyn Bridge from Mirror Man.</p>"},{"name":"X-Men 2: Wolverine's Revenge","year":2003,"developer":"GenePool Software","url":"microsoft_xbox_x/X2%20-%20Wolverine%27s%20Revenge%20%28USA%29.zip","filesize":6557903110,"score":6.7,"genres":"Action > Behind view > Sci-fi / futuristic > Licensed","desc":"<p>Wolverine has just hours to find a cure to a virus and save his life. Along the way, he will discover further details on his past, and fight against other familiar characters from the X-Men franchise, including Magneto and Sabertooth.</p><p>Returning to the lab where Logan became Weapon X, you must use his unique abilities (adamantium claws and hightened sense of smell) to sneak your way around the areas past the many guards. And if needs be, you can use stealth abilities to quietly attack the enemy from behind or above.</p><p>Bonus objectives include finding hidden Wolverine comic covers and dog tags to unlock secrets such as new costumes and improved abilities.</p>"},{"name":"XGRA: Extreme G Racing Association","year":2003,"developer":"Acclaim Studios Cheltenham","url":"microsoft_xbox_x/XGRA%20-%20Extreme%20G%20Racing%20Association%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6601058527,"score":7.1,"genres":"Action > Racing / Driving > Behind view > Direct control > Hovercraft > Track racing > Cyberpunk / dark sci-fi","desc":"<p>After the F1 Nurburgring disaster of 2025, the Extreme Gravity Racing Association, or XGRA, was set up as a regulatory governing body for all heavy gravity race events as an equivalent of NASCAR or the FIA. The year is 2080 and a new season is about to begin. You start as a new rookie for a team and have to work your way up through leagues of increasing difficulty with various racing modes: Endurance, Peacekeeper, Speed Limited, Extreme Weather Races, Burn Off and Warmonger.</p><p>Jump into your speed bike and race in more than 14 different courses, while you blast your enemies to little bits with an assortment of lasers, mines and rockets. After a few successful races, you have the opportunity to upgrade your bike and access new areas.</p>"},{"name":"Xiaolin Showdown","year":2006,"developer":"BottleRocket Entertainment, Inc.","url":"microsoft_xbox_x/Xiaolin%20Showdown%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6756412726,"score":5.2,"genres":"Action > 3rd-person (Other) > Anime / Manga > Fighting > Licensed","desc":"<p><em>Xiaolin Showdown</em> is a game based on the animated series of the same name from Warner. It is a fighting game where you play as the four main characters of the show (Kimiko, Omi, Raimundo and Clay). Even if you play alone (the game supports 4 simultaneous players in story mode), the other 3 are present, controlled by the computer. You can also unlock 2 additional characters: Jack Spicer and Chase Young.</p><p>The players must defeat waves of enemy robots to collect Shen Gong Wu artifacts to increase their power and defeat series of enemies, until they are able to face Mala Mala Jong and put an end on the plans of the evil boy genius, Jack Spicer. Each Shen Gong Wu provides a new power, like locking nearby characters or punching the ground for area damage. Additional Shen Gong Wu can be bought using coins collected during the game.</p><p>The gameplay is inspired by party fighting games, like Power Stone and Super Smash Bros. You can chain combos with button combinations, jump and give flying kicks.</p><p>Between the game levels, there are showdowns, where the characters have to bet a Shen Gong Wu. The one that wins the challenge chooses a Shen Gong Wu from the player who lost. You can also only play the showdowns, instead the full story mode.</p>"},{"name":"XIII","year":2003,"developer":"Ubisoft Paris Studios SARL","url":"microsoft_xbox_x/XIII%20%28USA%2C%20Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6381859354,"score":7.4,"genres":"Action > 1st-person > Shooter > Direct control > Spy / espionage > Licensed","desc":"<p><em>XIII</em> is a cel-shaded first-person shooter based on the popular Belgian cult comic created by Jean Van Hamme and illustrated by William Vance. The game is loosely based on the first five comics. The main theme of the game is based on Robert Ludlum's book <em>The Bourne Identity</em>, and features a man who is suffering from amnesia and quite possibly involved in the recent assassination of the President of the United States. The hero knows almost nothing except that he must be important, since everyone is trying to kill him. Gradually uncovering the mystery, the hero, learns more about his secret agent past and his curious name: XIII.</p><p>The player unravels clues, trying to solve a conspiracy set in an environment that breathes a comic book ambiance. Footsteps and shots are visualized in text and actions: for example, head shots are shown in a series of still images. Aside from that, the game has all the typical FPS elements: both stealth and action, more than fifteen weapons (shotguns, crossbows, rifles, ...), interaction with environmental objects and plenty of enemies in levels spread all over the world. During the game, the player can learn a number of skills such as silent walking, lockpicking and dual weapons handling.</p>"},{"name":"Xyanide","year":2006,"developer":"Playlogic Game Factory BV","url":"microsoft_xbox_x/Xyanide%20%28USA%29%20%28En%2CFr%2CDe%2CEs%29.zip","filesize":6688433712,"score":6.9,"genres":"Action > 3rd-person (Other) > Side view > Top-down > Arcade > Shooter","desc":"<p>The space-witch Aguira, a young fragile girl, has turned the world of Mardar into living hell. Her sentence is death by the Maelstrom, a gigantic black hole. But on route to the Maelstrom, the ship that carries her is hit by a meteorite full of Xyanide, which allows her to materialize her thoughts and escape. Her first target, unsurprisingly, is Drake, her executioner who accompanies her into the Maelstrom. His ship becomes entangled into her world, and he has to fight her demons and destroy the crystals that power her devilish creations. </p><p><em>Xyanide</em> is essentially a 2D shooter, though technically, the graphics are three-dimensional. The player character advances automatically, the screen scrolling forward and often changing the camera view. The path is not entirely linear: at certain intersections, the player can choose where to go next. The game encompasses six large levels; regular enemies, mid-bosses, and end bosses will try to do everything in their might to foil Drake's mission.</p><p>Drake's ship has two primary weapons, which can be switched at any time. One is a spread attack normally used against small enemies; the other is a concentrated laser that's effective against bigger targets. Both weapons also have an alternate firing mode, homing missiles. All these can be upgraded during the course of the game. Collecting power-ups not only strengthens the weapons, but allows the ship to perform various offensive and defensive manoeuvres.</p><p>The game is story-driven; animated cutscenes appear between the levels, advancing the plot.</p>"}]