[{"name":"Yager","year":2003,"developer":"YAGER Development GmbH","url":"microsoft_xbox_y/Yager%20%28Europe%29%20%28En%2CFr%2CDe%29.zip","filesize":6360287576,"score":7.4,"genres":"Action > 1st-person > Behind view > Shooter > Direct control > Flight / aviation > Sci-fi / futuristic","desc":"<p><em>Yager</em> is a futuristic aerial combat game that puts the player in the role of air ace Magnus Tide. After crashing his plane, losing his job and being dumped by his girlfriend, he feels like his life can't get any worse. Fortunately, Magnus managed to get himself a new ship and a new job as a freelancer for his former employer, Proteus. Unfortunately for Magnus, his new job couldn't have come at a worse time, as the world is on the verge of full scale war.</p><p>It is this war that Magnus must survive and prosper in. From the cockpit the player must shoot through 22 missions through responsive terrain, with ground and air targets. As the game goes on, better machinery becomes available.</p>"},{"name":"Yetisports: Arctic Adventures","year":2005,"developer":"Pirate Games","url":"microsoft_xbox_y/Yetisports%20Arctic%20Adventures%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6497688062,"score":"","genres":"Action > Behind view > Mini-games > Party game > Fantasy > Licensed","desc":"<p><em>Yetisports: Arctic Adventure</em> is a party game staring the yeti and penguin from the Yetisports browser games. The game features six mini games and eighteen levels in total. The six mini games are:</p><ul><li>Baseball: the yeti has to hit a penguin jumping from a hole with the baseball bat as far as possible, extra points can be collected along the way;</li><li>Free flight: the player has reach the end of the level before the time runs out, by navigating an albatross through rings in the air to gain extra time. Red feathers can be collated to gain more speed;</li><li>Pingu flight: the player has to launch a penguin in the air that will then be picked up by an albatross. By collecting white feathers the albatross gains stamina. When unable to go farther the penguin has to be drop as close as possible to a target for more points;</li><li>Snowboarding: while snowboarding the player has to pick up penguins. At the end the penguins must be thrown at ice statues for points.</li><li>Pingu golf: the penguin has to be hit by the yeti with an ice bat into a golf hole for the highest score;</li><li>Half pipe racing: the player has finish several laps with a penguin thrown by the yeti before the time runs out, by collecting pocked watches extra time is gained. Additional speed can be gained by hitting red bowties;</li><li>Pingu darts: the Yeti has to throw snowballs at jumping penguins in front of a dartboard to get them in the dartboard and earn points.</li></ul>"},{"name":"Yourself Fitness","year":2004,"developer":"Respondesign","url":"microsoft_xbox_y/Yourself%21Fitness%20%28USA%29.zip","filesize":6444375938,"score":"","genres":"Sports > Meditative / Zen > Health / nutrition","desc":"<p><em>Yourself!Fitness</em> is a fitness game that includes over 500 types of exercises led by a virtual personal fitness coach named Maya. There are five areas in which you can focus your exercise: Weight Loss, Cardio, Upper Strength, Core Strength, and Lower Strength. Also, you can do Yoga and many healthy recipes are included in the program. The game starts with a fitness assessment where the intensity of the training is determined by comparing the player's resting heart rate with the heart rate after performing a set of jumping jacks. External elements such as an exercise ball, hand weights, an exercise step, or a heart rate monitor can be incorporated in the program.</p>"},{"name":"Yu-Gi-Oh!: The Dawn of Destiny","year":2004,"developer":"Konami Computer Entertainment Japan, Inc.","url":"microsoft_xbox_y/Yu-Gi-Oh%21%20The%20Dawn%20of%20Destiny%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":5826645339,"score":5.7,"genres":"Strategy > Anime / Manga > Cards / tiles > Trading / collectible card > Licensed","desc":"<p>The first Yu-Gi-Oh game to reach the X-Box, Dawn of Destiny combines the normal trading card game with 3D images and animations of each card put into play.  This brings the card game closer to what is seen in the TV show.</p><p>Offering over 1000 cards to use and the ability to create 3 different decks, players can create strategies for multiple different opponents.  Play against friends in Link Duel Mode, or for a greater challenge, play in Triple Duel Mode where you need to beat all three opponents in order to gain your new cards.</p><p>Summon your monsters and wage battle as you draw new cards to help you defeat your opponent.  Use spells and traps to increase your chances of success as you avoid your opponent's spells, traps, and monsters.  High-power cards do not guarantee victory.</p><p>The game comes with 3 limited edition cards: Dark Sage, Widespread Ruin, and the Egyptian God card: The Winged Dragon of Ra.</p>"}]