[{"name":"Zapper: One Wicked Cricket!","year":2002,"developer":"Blitz Games Ltd.","url":"microsoft_xbox_z/Zapper%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6752143726,"score":6.3,"genres":"Action > 3rd-person (Other) > Diagonal-down > Platform > Shooter > Direct control > Fantasy > Comedy","desc":"<p>In this game the player controls a cricket named Zapper on a mission to save his brother. The protagonist will have to pass through six worlds divided into 20 levels, each with hazards to avoid and eggs to capture, meeting both friends and enemies that help and hinder his progress towards a diabolical nest-building magpie named Maggie. Zapper can move in four directions, climb vertical surfaces like trees and walls, and zap opponents with his electric antennae.</p>"},{"name":"Zathura","year":2005,"developer":"High Voltage Software, Inc.","url":"microsoft_xbox_z/Zathura%20%28Europe%29%20%28En%2CFr%2CDe%2CEs%2CIt%29.zip","filesize":6571026352,"score":5.5,"genres":"Action > 3rd-person (Other) > Platform > Fantasy > Sci-fi / futuristic > Licensed","desc":"<p><em>Zathura</em> is a third-person platformer based on the 2005 fantasy science fiction film of the same name, which is in turn inspired by the book by Chris Van Allsburg. After an argument with his brother Walter, Danny goes into the basement of his house and finds an old mechanical board game. When they start to play the game, their house is catapulted into space, they get a large battle robot, and visit other planets in order to complete the game and return home.</p><p>You play in turn as either one of the brothers or the robot. Walter can melee combat with a wrench and shoot projectiles while Danny has a slingshot, and the robot can shoot lasers or a charged shot, and can charge an enemy and jump high. As they progress through the different levels cut-scenes advance the story. They can grab power-ups and need to fight boss enemies as well.</p>"},{"name":"Zuma Deluxe","year":2005,"developer":"PopCap Games, Inc."}]